/*
Description:
This json file is used to store pokemon move information

Details:
* Name is the name of the move
* Points is how much the move is valued
* Tier is the overally power level of hte move
* Power is a statistic to determine how much of an effect the move will have
* Style is the general type of the move
* Flavor is the flavor text of the move
* Effect is what the move can do in laymens terms
* Critical is what happens if the move is super effective

Move Template:
"TEMPLATE": 
		{
			"name": "", 
			"power": "",
			"style": "",
			"flavor": "",
			"effect": "",
			"critical": ""
		}

*/
var moves =
{
	"Normal":
	{
		"Acupressure": 
		{
			"name": "Acupressure",
			"power": "50",
			"style": "Melee",
			"flavor": "You press on an ally/'s pressure points to increase its vitality.",
			"effect": "The target/'s next attack does 60 extra damage.",
			"critical": "Does not crit."
		},
		"Attract": 
		{
			"name": "Attract",
			"power": "40",
			"style": "Ranged",
			"flavor": "Romantic savvy charms the target.",
			"effect": "This causes a compulsion to charm the target into helping you and attacking anyone who is a \n threat to you. This only affects opposite-gendered Pokémon, but if the target is in the same egg group \n as the user, the effect is harsh even if the target would be resistant or immune to normal attacks. A \n Pokémon that knows this move rolls an extra die to determine if breeding is successful, taking the highest die.",
			"critical": "The effect is harsh if used on opposite-gendered Pokémon and will now affect a same-gendered Pokemon."
		},
		"Scratch": 
		{
			"name": "Scratch",
			"power": "20",
			"style": "Melee",
			"flavor": "A light attack with claws.",
			"effect": "This deals 20 damage.",
			"critical": "15 repeating damage."
		}
	},
	"Electric":
	{
		"Jolt": 
		{
			"name": "Jolt",
			"power": "20",
			"style": "Melee",
			"flavor": "The user charges in and electrifies everyone around it.",
			"effect": "This deals 20 damage to all enemies around you.",
			"critical": "Targets are stunned."
		},
		"Electrify":
		{
			"name": "Electrify",
			"power": "20",
			"style": "Ranged",
			"flavor": "This shocks the target and continues to electrocute it.",
			"effect": "This deals 20 repeating damage to the target.",
			"critical": "The target is trapped."
		}
	}
};