/*
Description:
This json file is used to store pokemon move information

Details:
* Name is the name of the move
* Points is how much the move is valued
* Tier is the overally power level of hte move
* Power is a statistic to determine how much of an effect the move will have
* Style is the general type of the move
* Flavor is the flavor text of the move
* Effect is what the move can do in laymens terms
* Critical is what happens if the move is super effective

Move Template:
"": 
		{
			"name": "", 
			"power": ,
			"style": "",
			"flavor": "",
			"effect": "",
			"critical": "",
		},

*/
var moves =
{
	"Bug":
	{

	},
	"Dark":
	{

	},
	"Dragon":
	{

	},
	"Electric":
	{
		"Jolt": 
		{
			"power": 20,
			"style": "Melee",
			"flavor": "The user charges in and electrifies everyone around it.",
			"effect": "This deals 20 damage to all enemies around the user.",
			"critical": "Targets are stunned.",
		},
		"Electrify":
		{
			"power": 20,
			"style": "Ranged",
			"flavor": "This shocks the target and continues to electrocute it.",
			"effect": "This deals 20 repeating damage to the target.",
			"critical": "The target is trapped.",
		},
		"Electric_Boogaloo": 
		{
			"power": 40,
			"style": "Ranged",
			"flavor": "The user rocks on to electric avenue with a dance that builds up static.",
			"effect": "User and everyone in range are charged, meaning the next uncharged Pokemon that moves adjacent to them takes 2d60 electric damage.",
			"critical": "none",
		},
		
	},
	"Fairy":
	{

	},
	"Fighting":
	{

	},
	"Fire":
	{

	},
	"Flying":
	{

	},
	"Ghost":
	{

	},
	"Grass":
	{

	},
	"Ground":
	{

	},
	"Ice":
	{

	},
	"Normal":
	{
		"Acupressure": 
		{
			"power": 50,
			"style": "Melee",
			"flavor": "User presses on an ally's pressure points to increase its vitality.",
			"effect": "The target's next attack does 60 extra damage.",
			"critical": "none",
		},
		"Attract": 
		{
			"power": 40,
			"style": "Ranged",
			"flavor": "Romantic savvy charms the target.",
			"effect": "This causes a compulsion to charm the target into helping the user and attacking anyone who is a threat to it. This only affects opposite-gendered Pokémon, but if the target is in the same egg group as the user, the effect is harsh even if the target would be resistant or immune to normal attacks. A Pokémon that knows this move rolls an extra die to determine if breeding is successful, taking the highest die.",
			"critical": "The effect is harsh if used on opposite-gendered Pokémon and will now affect a same-gendered Pokemon.",
		},
		"Bind":
		{
			"power": 30,
			"style": "Melee",
			"flavor": "User wraps itself around the target and starts squeezing.",
			"effect": "Pin the target for 30 damage.",
			"critical": "The pin is harsh.",
		},
		"Copycat":
		{
			"power": 30,
			"style": "Self",
			"flavor": "User replicates a move.",
			"effect": "Use the same move as the last Pokemon did.",
			"critical": "none",
		},
		"Defense_Curl":
		{
			"power": 40,
			"style": "Self",
			"flavor": "The user rolls up into a ball for protection.",
			"effect": "The user takes 20 less damage from all attacks for the remainder of combat.",
			"critical": "none",
		},
		"Disable":
		{
			"power": 20,
			"style": "Ranged",
			"flavor": "The user hexes a target into temporary forgetfulness.",
			"effect": "This burns out a move you know the target has, perhaps one it has already used.",
			"critical": "Target is stunned.",
		},
		"Encode":
		{
			"power": 60,
			"style": "Self",
			"flavor": "The user erects a barrier that reduces moves to their constituent code.",
			"effect": "Until the beginning of the user's next turn, if it is hit by a move it can make a mind save instead of the usual save to dodge attacks. If it succeeds, it creates a disk with the move's data on it.",
			"critical": "none",
		},
		"Encore":
		{
			"power": 30,
			"style": "Ranged",
			"flavor": "The user claps and applauds, compelling its target to keep using the same move.",
			"effect": "This acts as a compulsion for the target to repeat the same move every turn. If the move was a difficult one for the Pokémon, it takes 30 damage every time it uses that move.",
			"critical": "The status is harsh.",
		},
		"Endure":
		{
			"power": 40,
			"style": "Self",
			"flavor": "I will survive. I will survive!",
			"effect": "If the user is KO'd, its remains on the field with 10 HP left. The user cannot use this two turns in a row.",
			"critical": "none",
		},
		"Flail": 
		{
			"power": 40,
			"style": "Ranged",
			"flavor": "User thrashes about aimlessly in its pain.",
			"effect": "This deals damage equal to half the HP the user has lost.",
			"critical": "Now deals damage equal to total HP the user has lost.",
		},
		"Flash": 
		{
			"power": 40,
			"style": "Ranged",
			"flavor": "The Pokemon blinds everyone nearby with blinding light.",
			"effect": "Everyone in range is blinded.",
			"critical": "Blindness is harsh",
			"out_of_battle": "This lights up the area and causes the Pokemon to glow for an hour or so."
		},
		"Focus_Energy": 
		{
			"power": 30,
			"style": "Self",
			"flavor": "User concentrates its power.",
			"effect": "For the remainder of the fight the user crits on any doubles.",
			"critical": "none",
		},
		"Fury_Attack": 
		{
			"power": 30,
			"style": "Melee",
			"flavor": "The user attacks with uncontrolled rage.",
			"effect": "This deals 1d60 damage.",
			"critical": "Deals an extra 1d60 damage.",
		},
		"Growl": 
		{
			"power": 20,
			"style": "Ranged",
			"flavor": "A sharp growl causes the target to jump back.",
			"effect": "Move the target 2 spaces.",
			"critical": "The target takes a compulsion to stay away from the user.",
		},
		"Harden": 
		{
			"power": 20,
			"style": "Self",
			"flavor": "User hardens its protective coating.",
			"effect": "This allows the user to use strength saves when dodging.",
			"critical": "none",
		},
		"Lock_On": 
		{
			"power": 30,
			"style": "Ranged",
			"flavor": "User focuses on the target.",
			"effect": "The user's next attack against the target will not miss, regardless of circumstances, even if it is out of range.",
			"critical": "The user's next attack against the target automatically crits.",
		},	
		"Scratch": 
		{
			"power": 20,
			"style": "Melee",
			"flavor": "A light attack with claws.",
			"effect": "This deals 20 damage.",
			"critical": "15 repeating damage.",
		},
		"Sentry": 
		{
			"power": 40,
			"style": "Self",
			"flavor": "The user prepares to attack unwary foes.",
			"effect": "For the remainder of combat, if any foe gets adjacent to the user but doesn't use a melee move on it, the user may deal its strength in damage to the enemy.",
			"critical": "none",
			"mark": "Designer's Choice."
		},
		"Sharpen": 
		{
			"power": 30,
			"style": "Self",
			"flavor": "The user gets sharper while making that “shwing” sound.",
			"effect": "The user’s next attack does 30 extra damage.",
			"critical": "none",
		},
		"Sing": 
		{
			"power": 40,
			"style": "Ranged",
			"flavor": "The hypnotic song lulls everyone nearby into a slumber.",
			"effect": "This inflicts sleep on everyone in range, friend or foe.",
			"critical": "Sleep is harsh.",
		},
		"Sleep_Talk": 
		{
			"power": 20,
			"style": "?",
			"flavor": "User talks in its sleep and then suddenly use a move at random.",
			"effect": "Roll a d6. On a 1, the Pokemon uses its first move, on a 2 the second, and so on. If sleep talk itself is picked, choose another move of your choice.",
			"critical": "Only roll for a crit on the chosen move.",
		},
		"Sleepwalk": 
		{
			"power": 30,
			"style": "Melee",
			"flavor": "The user moves about in its sleep, fighting its enemies in dream and reality.",
			"effect": "This move deals 50 damage. It can only be used while asleep.",
			"critical": "+30 damage",
		},
		"Snore": 
		{
			"power": 40,
			"style": "Ranged",
			"flavor": "The user snores so loudly that it distracts and damages its foes.",
			"effect": "This deals 60 damage. It can only be used while asleep.",
			"critical": "+30 damage.",
		},
		"Sonic_Boom": 
		{
			"power": 20,
			"style": "Ranged",
			"flavor": "The target is hit with precise waves of sound.",
			"effect": "The target takes 30 automatic damage.",
			"critical": "none",
		},
		"Spike_Cannon": 
		{
			"power": 30,
			"style": "Ranged",
			"flavor": "The target is hit with a volley of spikes.",
			"effect": "The target takes 1d60 damage.",
			"critical": "+1d60 damage.",
		},
		"Squeak": 
		{
			"power": 30,
			"style": "Ranged",
			"flavor": "High-pitched chatter causes hearing loss, annoyance, and distraction.",
			"effect": "No one in range can crit or dodge on their next turn.",
			"critical": "Crit: +30 damage.",
			"mark": "Designer's Choice"
		},
		"Rapid_Spin": 
		{
			"power": 50,
			"style": "Melee",
			"flavor": "The user spins rapidly, freeing itself from constraints.",
			"effect": "This deals 30 damage to all adjacent targets and can be used even if trapped or pinned. It removes trapped, pinned, and leech seed.",
			"critical": "+30 damage",
		},
		"Struggle": 
		{
			"power": 10,
			"style": "Melee",
			"flavor": "A desperate attempt to hurt the enemy.",
			"effect": "This 20 damage and the user takes 10 damage.",
			"critical": "+40 damage dealt, +20 damage self-inflicted.",
			"special": "Any Pokemon may learn this as a free action."
		},
		"Sweet_Scent": 
		{
			"power": 20,
			"style": "Ranged",
			"flavor": "A variety of aromas and pheromones draw in nearby Pokémon.",
			"effect": "All Pokémon in range, friend or foe, are compelled to come as close as possible to the user.",
			"critical": "The compulsion is harsh",
			"out_of_battle": "Once per session this move can be used to initiate an encounter with local Pokemon.",
		},
		"Tackle": 
		{
			"power": 20,
			"style": "Melee",
			"flavor": "The user body-checks its opponent.",
			"effect": "This deals 20 damage.",
			"critical": "Crit: +30 damage.",
		},
		"Tail_Wag": 
		{
			"power": 30,
			"style": "Ranged",
			"flavor": "User wags its tail, distracting a foe.",
			"effect": "An enemy in range cannot crit or dodge until the user’s next turn.",
			"critical": "This status becomes harsh, meaning is lasts the rest of combat.",
		},
		"Odor_Sleuth": 
		{
			"power": 40,
			"style": "Ranged",
			"flavor": "The user’s sense of smell allows it to locate the enemy with ease, no matter the distance.",
			"effect": "The target is identified.",
			"critical": "The target is harshly identified.",
			"out_of_battle": "Once per encounter, when a wild Pokémon escapes, if you have a Pokémon with this move handling roundup, you may have it make a sense save. If it passes, it tracks down the fleeing Pokémon giving you a second shot at catching it. You may use this immediately after the first encounter has ended. Tracking down the fleeing Pokémon to catch it counts as a new encounter, so if it flees again you can make a new sense save to track it again.",
		},
		"Transform": 
		{
			"power": 20,
			"style": "Self",
			"flavor": "The user copies another Pokémon on a cellular level.",
			"effect": "Choose a Pokemon on the map. The user now have the same typing and know all the same attacks as the target Pokémon, as well as taking on its appearance and abilities. This does not copy the target’s stats or personality. The user may revert to its original form as a free action.",
			"critical": "none",
		},
		"Quick_Attack": 
		{
			"power": 40,
			"style": "Melee",
			"flavor": "User quickly strikes its opponent.",
			"effect": "User moves 2 extra spaces and deal half its agility in damage.",
			"critical": "User may make a dash after using this attac.",
		},
		"Yawn": 
		{
			"power": 30,
			"style": "Ranged",
			"flavor": "Stop yawning. That’s contagio-",
			"effect": "Causes a compulsion on the target for it to fall asleep. The sleep is harsh but once the target falls asleep the compulsion ends. If the user woke up last turn, it automatically crits.",
			"critical": "The target falls asleep immedaitely.",
		},
		"Agility": 
		{
			"power": 50,
			"style": "Self",
			"flavor": "A quick warmup increases the user’s speed.",
			"effect": "For the remainder of combat, the user takes an extra dash action each turn.",
			"critical": "none",
		},
		"Barrage": 
		{
			"power": 60,
			"style": "Ranged",
			"flavor": "The user fires a stream of projectiles at the target.",
			"effect": "This deals 2d60 damage.",
			"critical": "Crit: +1d60 damage.",
		},
		"Baton_Pass": 
		{
			"power": 50,
			"style": "Self",
			"flavor": "User passes on its boosts to an ally.",
			"effect": "This causes the Pokemon to retreat and forces the trainer to make a switch. Any status effects this Pokémon has are transferred to the next one. ",
			"critical": "none",
		},
		"Belly_Drum": 
		{
			"power": 50,
			"style": "Self",
			"flavor": "User drums harshly on its stomach, becoming stronger.",
			"effect": "User deals 50 damage to itself, but all its attacks for the rest of the fight do double damage.",
			"critical": "none",
		},
		"Bide": 
		{
			"power": 50,
			"style": "Ranged",
			"flavor": "User absorbs energy and supercharges it.",
			"effect": "Once used, keep track all damage dealt to the user. On the user’s next turn, as its standard action, deal double that damage to a Pokémon in range. This attack does not miss.",
			"critical": "none",
		},
		"Bullrush": 
		{
			"power": 70,
			"style": "Melee",
			"flavor": "User charges recklessly across the field.",
			"effect": "This deals 50 damage, and while using it the user can cross any terrain but water without terrain problems. If it is a water type, it can also cross water hazards without a problem.",
			"critical": "+30 damage.",
		},
		"Claw": 
		{
			"power": 70,
			"style": "Melee",
			"flavor": "User snips the target with its claws.",
			"effect": "This deals 50 damage and the target cannot take a dash action next turn.",
			"critical": "+30 damage.",
		},
		"Comet_Punch": 
		{
			"power": 60,
			"style": "Melee",
			"flavor": "User punches the target repeatedly.",
			"effect": "This deals 2d60 damage.",
			"critical": "Crit: +1d60 damage.",
		},
		"Constrict": 
		{
			"power": 50,
			"style": "Melee",
			"flavor": "User wraps itself around the target and starts squeezing.",
			"effect": "Pin the target for 50 damage.",
			"critical": "The pin is harsh.",
		},
		"Conversion": 
		{
			"power": 50,
			"style": "Self",
			"flavor": "A change in type.",
			"effect": "Pick a type. The user is now that type.",
			"critical": "none",
		},
		"Crush_Claw": 
		{
			"power": 60,
			"style": "Melee",
			"flavor": "A strong claw can break an enemy’s defense.",
			"effect": "This deals 40 damage. Flip a coin. On heads, the target takes double damage from the next attack to hit it.",
			"critical": "+20 damage and there is no need to flip a coin, the target will take the double damage from the next attack.",
		},
		"Double_Slap": 
		{
			"power": 50,
			"style": "Melee",
			"flavor": "User smacks the target twice.",
			"effect": "Make 2 attacks. Both do 20 damage.",
			"critical": "Each attack does +20 damage on a crit.",
		},
		"Double_Team": 
		{
			"power": 60,
			"style": "Self",
			"flavor": "User moves so quickly that its opponents see 2 of it.",
			"effect": "Place a second marker for your Pokémon on the field. Move both individually. One of those markers is the real pokemon, one is a fake. Whenever the user performs an action that affects another Pokémon, or one of the markers is attacked with a move, choose which one is the real one at that point.",
			"critical": "none",
		},
		"Double_Whip": 
		{
			"power": 70,
			"style": "Ranged",
			"flavor": "User whips the target twice.",
			"effect": "Make 2 attacks. Both do 30 damage.",
			"critical": "Roll independently for each hit. On a crit, +20 damage.",
		},
		"Follow_Me": 
		{
			"power": 60,
			"style": "Ranged",
			"flavor": "User draw attention to itself.",
			"effect": "This places a harsh compulsion on all enemies in range to attack only the user.",
			"critical": "none",
		},
		"Foresight": 
		{
			"power": 70,
			"style": "Ranged",
			"flavor": "The user sees just into the future, spotting a target without fail.",
			"effect": "This harshly identifies a target. Ghost Pokémon take 1x damage from normal and fighting type moves.",
			"critical": "Target is stunned.",
		},
		"Frustration": 
		{
			"power": 70,
			"style": "Melee",
			"flavor": "The user pours out its frustrations with its trainer on a foe.",
			"effect": "This deals damage equal to 30 plus ten times all the friendship points the user is currently missing.",
			"critical": "+50 damage and the user loses an FP.",
		},
		"Fury_Swipes": 
		{
			"power": 60,
			"style": "Melee",
			"flavor": "User slashes the target in a rage.",
			"effect": "This deals 2d60 damage.",
			"critical": "Crit: +1d60 damage.",
		},
		"Glare": 
		{
			"power": 60,
			"style": "Ranged",
			"flavor": "A paralyzing stare.",
			"effect": "The target is harshly stunned.",
			"critical": "The target also has a compulsion to flee from the user.",
		},
		"Headbutt": 
		{
			"power": 70,
			"style": "Melee",
			"flavor": "The Pokémon rams the other with its thick head.",
			"effect": "This deals 70 damage.",
			"critical": "+30 damage.",
		},
		"Head_Charge": 
		{
			"power": 70,
			"style": "Melee",
			"flavor": "User charges the target head-on.",
			"effect": "Target takes 90 damage and the user takes 20 automatic damage.",
			"critical": "+40 damage dealt and user takes an extra 10.",
		},
		"Heal_Bell": 
		{
			"power": 50,
			"style": "Ranged",
			"flavor": "The user rings a curative bell.",
			"effect": "Cure all statuses of everyone within range.",
			"critical": "none",
		},
		"Hold_Hands": 
		{
			"power": 50,
			"style": "Melee",
			"flavor": "Hand in hand two friends share an adventure.",
			"effect": "Choose an adjacent ally. Both user and ally automatically move together. Both lose their dash actions, but as long as they choose to continue to hold hands, both of gain a friendship point each turn.",
			"critical": "none",
		},
		"Herd": 
		{
			"power": 60,
			"style": "Ranged",
			"flavor": "The user gathers together several enemies into one location.",
			"effect": "All enemies in range have a compulsion to move to a spot of your choosing.",
			"critical": "The compulsion is harsh, and you may change the spot by having the same Pokémon use this move again, with automatic success against anyone under the compulsion.",
			"mark": "Designer's Choice.",
		},
		"Horn_Attack": 
		{
			"power": 60,
			"style": "Melee",
			"flavor": "When in doubt, gore someone.",
			"effect": "This deals 60 damage.",
			"critical": "+30 damage.",
		},
		"Hyper_Fang": 
		{
			"power": 70,
			"style": "Melee",
			"flavor": "The user bites down hard on a foe.",
			"effect": "This deals 70 damage.",
			"critical": "Target is pinned for 30 damage.",
		},
		"Payday": 
		{
			"power": 60,
			"style": "Ranged",
			"flavor": "User throws coins at the target.",
			"effect": "This deals 20 damage. It drops pokedollars on the battlefield equal to 10 times the user’s speed stat.",
			"critical": "+20 damage and 5 times the pokedollars dropped.",
			"out_of_battle": "You can use a downtime action with this Pokémon to drop 50 times its speed stat in Pokedollars. Additionally, once per scene when you make a financial transaction, you can decrease the total amount owed by that amount.",
			"opinion": "This move should be steel-typed, due to metal coins.",
		},
		"Perish_Song": 
		{
			"power": 50,
			"style": "Ranged",
			"flavor": "User sings a dirge that dooms everyone around it.",
			"effect": "Every Pokemon in range will faint at the end of its second turn.",
			"critical": "All affected have one turn left.",
		},
		"Power_Nap": 
		{
			"power": 60,
			"style": "Self",
			"flavor": "In the midst of a fight, when everything's on the line, few have the courage to sleep.",
			"effect": "This heals 60 damage. And then the user falls asleep.",
			"critical": "none",
		},
		"Pound": 
		{
			"power": 70,
			"style": "Melee",
			"flavor": "User smashes the target with all its might.",
			"effect": "This deals 70 damage.",
			"critical": "+30 damage.",
		},
		"Present": 
		{
			"power": 60,
			"style": "Melee",
			"flavor": "User give the target a present with a mystery gift.",
			"effect": "Choose a target in range and announce your choice. This deals 3d60 damage, but if the dice come up triples it heals the target by the amount listed.",
			"critical": "none",
			"out_of_battle": "once per session you may use a downtime action on a Pokémon with this move to have it give you a present. You get an item chosen by the GM, which will probably be good but maybe not.",
		},
		"Protect": 
		{
			"power": 60,
			"style": "Self",
			"flavor": "User protects itself at all cost.",
			"effect": "User automatically passes all dodge rolls for one turn, except crits.",
			"critical": "none",
		},
		"Rage": 
		{
			"power": 60,
			"style": "Melee",
			"flavor": "User focus its anger into a berserk attack.",
			"effect": "This deals 80 damage. It is under a compulsion to continue to use rage as long as it is possible to use it on an enemy.",
			"critical": "+20 damage on this and all further uses of rage until another move is used.",
		},
		"Retaliate": 
		{
			"power": 70,
			"style": "Melee",
			"flavor": "A strike driven by the need to avenge a fallen comrade.",
			"effect": "This deals 100 damage if an ally fainted since the user’s last turn. Otherwise, 40.",
			"critical": "+30 damage for each ally that has fainted since the user’s last turn.",
		},
		"Roar": 
		{
			"power": 50,
			"style": "Ranged",
			"flavor": "A fearsome roar causes the target to take leave of its senses.",
			"effect": "This causes a compulsion to flee the area and does not miss. The compulsion ends if the Pokémon is not returned.",
			"critical": "The compulsion is harsh.",
		},
		"Rock_Ballad": 
		{
			"power": 70,
			"style": "Ranged",
			"flavor": "A move that inspires allies by rocking out. Yeeaaaaahhhhhh!!!!! ",
			"effect": "The user and every ally in range does 30 extra damage on their next attacks.",
			"critical": "none",
			"mark": "Designer's Choice",
		},
		"Scary_Face": 
		{
			"power": 50,
			"style": "Ranged",
			"flavor": "A move that paralyzes the target with fear. ",
			"effect": "The target is trapped.",
			"critical": "The trap is harsh",
		},
		"Screech": 
		{
			"power": 60,
			"style": "Ranged",
			"flavor": "A sharp cry distracts enemies.",
			"effect": "Everyone in range loses its dash action next turn and deals half damage on its next attack, whether friend or foe.",
			"critical": "All targets are also stunned.",
		},
		"Secret_Power": 
		{
			"power": 50,
			"style": "Self",
			"flavor": "The Pokémon turns nearby terrain into a secret base.",
			"effect": "The Pokémon cannot move on the turn it uses this. Mark the area it’s standing on as containing a base. Any Pokémon in that base takes half damage from all attacks and has 2 extra spaces of range.",
			"critical": "none",
			"out_of_battle": "This creates a secret base in a tree, cave, or something else that allows the players some downtime even in a somewhat hostile environment. The secret base can be decorated, furnished, and even used as a home for a long time to come, or it can simply be used as a temporary camp. Wild Pokémon and trainers will have a hard time finding, let alone entering the secret base. This is a great way to get some downtime. ",
		},
		"Self_Destruct": 
		{
			"power": 60,
			"style": "Melee",
			"flavor": "The user explodes into fragments, fainting from the damage. It will get better at some point.",
			"effect": "This deals 150 damage to all adjacent targets, friend or foe. The user is KO'd.",
			"critical": "+30 damage.",
		},
		"Shell_Smash": 
		{
			"power": 70,
			"style": "Self",
			"flavor": "The user cracks its shell, reducing defense but increasing offense.",
			"effect": "This move can only be used if the user has the shell special. It loses that special but for the rest of combat it takes an extra dash action and it does 30 extra damage on each attack.",
			"critical": "none",
		},
		"Slash": 
		{
			"power": 60,
			"style": "Melee",
			"flavor": "A sharp cut that can leave a bleeding wound.",
			"effect": "This deals 60 damage.",
			"critical": "Also deals 15 repeating damage.",
		},
		"Strength": 
		{
			"power": 70,
			"style": "Melee",
			"flavor": "User wrestles the target with raw strength.",
			"effect": "This deals the user’s strength in damage and moves it one space.",
			"critical": "+20 damage or +2 spaces of movement, your choice.",
		},
		"Sonar": 
		{
			"power": 50,
			"style": "Self",
			"flavor": "By projecting sound waves and listening to the echoes, the user can see even in pitch black.",
			"effect": "Identify a target.",
			"critical": "The target is harshly identified.",
		},
		"Stomp": 
		{
			"power": 70,
			"style": "Melee",
			"flavor": "User steps on a smaller enemy.",
			"effect": "Deal the user’s strength + 20 damage. This only affects enemies that are lower in strength (though a gargantuan Pokémon may use this on any non-gargantuan Pokémon).",
			"critical": "Target is stunned.",
		},
		"Substitute": 
		{
			"power": 60,
			"style": "Self",
			"flavor": "User creates a small golem to take damage for it.",
			"effect": "User takes its strength in damage. This creates a substitute that will absorb that much damage before breaking. While a substitute in play, the user may carry as if it were riding the user, and it takes all damage that would go to the user, and any negative status effects that aren’t self-inflicted. If the substitute takes more damage than would be required to break it, the damage does not roll over onto the user. ",
			"critical": "none",
		},
		"Swift": 
		{
			"power": 70,
			"style": "Ranged",
			"flavor": "User shoots a rain of stars at its foe.",
			"effect": "This deals the user’s speed in damage and does not miss.",
			"critical": "none",
		},
		"Swords_Dance": 
		{
			"power": 70,
			"style": "Self",
			"flavor": "An elegant dance to prepare for an all-out assault.",
			"effect": "On the user’s next turn,  it takes an extra dash action and deals double damage.",
			"critical": "none",
		},
		"Takedown": 
		{
			"power": 50,
			"style": "Melee",
			"flavor": "The user recklessly charges the target.",
			"effect": "This deals 80 damage. The user takes 30 damage.",
			"critical": "Target is stunned",
		},
		"Thrash": 
		{
			"power": 60,
			"style": "Melee",
			"flavor": "The user recklessly attacks everyone in the area.",
			"effect": "This deals 90 damage. However, flip a coin. On heads, it uses this move next turn. On tails it takes a compulsion to insanity.",
			"critical": "",
		},
		"Whirlwind": 
		{
			"power": 60,
			"style": "Ranged",
			"flavor": "A tornado blows the target around the battlefield.",
			"effect": "This moves the target 6 spaces.",
			"critical": "+3 spaces.",
		},
		"Body_Slam": 
		{
			"power": 100,
			"style": "Melee",
			"flavor": "The user crushes a foe beneath its bulk.",
			"effect": "This deals twice strength +50 in damage the target.",
			"critical": "The target is stunned.",
		},
		"Boomburst": 
		{
			"power": 100,
			"style": "Ranged",
			"flavor": "The user releases a devastating sonic wave.",
			"effect": "This deals 90 damage to everything in range.",
			"critical": "",
		},
		"Crush_Grip": 
		{
			"power": 80,
			"style": "Melee",
			"flavor": "User crushes the target in a massive grip. The bigger they are, the harder they fall.",
			"effect": "This deals damage equal to half the target's current HP, rounded down.",
			"critical": "none",
		},
		"Double_Edge": 
		{
			"power": 90,
			"style": "Melee",
			"flavor": "The user recklessly swipes at the target.",
			"effect": "This deals 150 damage, but the user takes 60 automatic damage.",
			"critical": "+50 damage dealt, and the user takes an extra 20 damage.",
		},
		"Egg_Bomb": 
		{
			"power": 80,
			"style": "Ranged ",
			"flavor": "The user launches an exploding egg.",
			"effect": "This deals 70 damage to the target and all adjacent targets.",
			"critical": "+30 damage.",
		},
		"Explosion": 
		{
			"power": 90,
			"style": "Ranged",
			"flavor": "The user self-destructs, taking everyone nearby with it.",
			"effect": "This deals 180 damage to all targets in range. The user is KO'd.",
			"critical": "+30 damage.",
		},
		"Extreme_Speed": 
		{
			"power": 90,
			"style": "Melee",
			"flavor": "User charges speedily across the battlefield.",
			"effect": "This deals the user’s speed in damage to the target, and it gets to move 4 extra spaces.",
			"critical": "+30 damage.",
		},
		"Giga_Impact": 
		{
			"power": 90,
			"style": "Melee",
			"flavor": "The user wears itself out attacking.",
			"effect": "This deals 130 damage. The user may not use difficult moves next turn.",
			"critical": "Target is stunned.",
		},
		"Horn_Drill": 
		{
			"power": 100,
			"style": "Melee",
			"flavor": "The user charges the target with a vicious drill, not stopping until it faints.",
			"effect": "The target gets to save twice against this. If both saves fail, the target is KO'd.",
			"critical": "The target only gets one save.",
		},
		"Hyper_Beam": 
		{
			"power": 90,
			"style": "Ranged",
			"flavor": "The user fires an unstoppable beam of pure energy. ",
			"effect": "This deals 80 damage to every target along a line. User may not use any more moves until encouraged by its trainer.",
			"critical": "+30 damage.",
		},
		"Maximize": 
		{
			"power": 90,
			"style": "Self",
			"flavor": "The user grows to gargantuan size.",
			"effect": "The user adds the gargantuan ability to itself, but it does not get the stat boosts. However, the maximized Pokémon is not considered legendary. Minimize and maximize are opposites, and if one is used the other will cancel it out. ",
			"critical": "none",
		},
		"Minimize": 
		{
			"power": 90,
			"style": "Self",
			"flavor": "The user gets smaller and faster.",
			"effect": "For the remainder of combat, the user takes an extra dash action and rolls twice on all saves.",
			"critical": "none",
		},
		"Milk_Drink": 
		{
			"power": 90,
			"style": "Melee",
			"flavor": "Refreshing milk to heal the bones.",
			"effect": "The target is healed for 60 damage. ",
			"critical": "none",
			"out_of_battle": "Out of Combat: As a downtime action, you can get one bottle of milk that heals 60 HP.",
		},
		"Noble_Roar": 
		{
			"power": 90,
			"style": "Ranged",
			"flavor": "The user roars an all enemies in range are shaken.",
			"effect": "All enemies in range, but not allies, take double damage from all attacks until the the end of the user’s next turn.",
			"critical": "Also causes a compulsion to stay as far away as possible from the user.",
		},
		"Pincer": 
		{
			"power": 90,
			"style": "Melee",
			"flavor": "The user catches the target in its claws.",
			"effect": "This pins the target for 90 damage.",
			"critical": "The pin is harsh.",
		},
		"Round": 
		{
			"power": 80,
			"style": "Ranged",
			"flavor": "The user and allies all sing together.",
			"effect": "This deals 30 damage plus another 30 for each ally in range. Damage is dealt to all enemies in range.",
			"critical": "+30 damage.",
		},
		"Skull_Bash": 
		{
			"power": 90,
			"style": "Melee",
			"flavor": "User charges and rams the target.",
			"effect": "On the first turn, the user tucks in its head. It takes half damage from all attacks until its next turn. On the second turn, it gets to dash and deal 120 damage.",
			"critical": "+30 damage.",
		},
		"Slam": 
		{
			"power": 90,
			"style": "Melee",
			"flavor": "The user whips the target hard with a tail, vines, or other such appendage.",
			"effect": "This deals 90 damage.",
			"critical": "+30 damage.",
		},
		"Razor_Wind": 
		{
			"power": 80,
			"style": "Ranged",
			"flavor": "The user calls forth a storm of blades.",
			"effect": "The user must be encouraged before using this attack. It deals 130 damage.",
			"critical": "+30 damage.",
		},
		"Soft_Boiled": 
		{
			"power": 90,
			"style": "Melee",
			"flavor": "User gives an ally a cooked, refreshing egg.",
			"effect": "This restores 60 HP to the target.",
			"critical": "none",
			"out_of_battle": "This move can be used as a downtime action to cure 60 health.",
		},
		"Super_Fang": 
		{
			"power": 90,
			"style": "Melee",
			"flavor": "User bites down extremely hard on the target.",
			"effect": "This halves the target's current health, rounded up.",
			"critical": "+30 damage.",
		},	
	},
	"Poison":
	{

	},
	"Psychic":
	{

	},
	"Rock":
	{

	},
	"Steel":
	{

	},
	"Water":
	{

	}
};