/*
Description:
This json file is used to store pokemon move information

Details:
* Name is the name of the move
* Points is how much the move is valued
* Tier is the overally power level of hte move
* Power is a statistic to determine how much of an effect the move will have
* Style is the general type of the move
* Flavor is the flavor text of the move
* Effect is what the move can do in laymens terms
* Critical is what happens if the move is super effective

Move Template:
		"": 
		{
			"power": ,
			"style": "",
			"flavor": "",
			"effect": "",
			"critical": "",
		},

*/
var moves =
{
	"Bug":
	{
		"Chitin": 
		{
			"power": 40,
			"style": "Self",
			"flavor": "User reinforces its armored shell.",
			"effect": "For the remainder of combat, the user takes 20 less damage from all attacks.",
			"critical": "",
		},
		"Fell_Stinger": 
		{
			"power": 30,
			"style": "Melee",
			"flavor": "User stings the target and tries to take the last of its might.",
			"effect": "This deals 20 damage. If it KO’s the target, restore the use of a burnt out move.",
			"critical": "restore the use of a burnt-out move",
		},
		"Leech_Life": 
		{
			"power": 30,
			"style": "Melee",
			"flavor": "User sucks a bit of the target’s energy.",
			"effect": "This deals 20 damage and the user heals half the damage dealt.",
			"critical": "+20 damage dealt with increased healing. ",
		},
		"Powder": 
		{
			"power": 30,
			"style": "Melee",
			"flavor": "User covers the target in explosive powder.",
			"effect": "The target is now weak against fire.",
			"critical": "The target takes 15 repeating damage.",
		},
		"Spider_Web": 
		{
			"power": 30,
			"style": "Melee",
			"flavor": "User traps the target in a web.",
			"effect": "The target is trapped.",
			"critical": "The trap is harsh. ",
		},
		"String_Shot": 
		{
			"power": 20,
			"style": "Ranged",
			"flavor": "A streak of silk binds up the target.",
			"effect": "The target loses its next dash action.",
			"critical": "The target is trapped.",
		},
		"Bug_Bite": 
		{
			"power": 60,
			"style": "Melee",
			"flavor": "User bites the target, and its goodies if possible.",
			"effect": "This deals 50 damage. If the target is holding a berry, immediately eat it and gain the benefit.",
			"critical": "+30 damage.",
		},
		"Fury_Cutter": 
		{
			"power": 60,
			"style": "Melee",
			"flavor": "User slashes the target with growing rage.",
			"effect": "This deals 30 damage, +30 for each time it has already been used in combat.",
			"critical": "+30 damage.",
		},
		"Hive_Mind": 
		{
			"power": 50,
			"style": "Ranged",
			"flavor": "The user calls to all other bugs to coordinate.",
			"effect": "This causes the user to crit its next attack, as with all other allied insect Pokémon on the field.",
			"critical": "",
			"mark": "Designer's Choice",
		},
		"Honey_Gather": 
		{
			"power": 70,
			"style": "Self",
			"flavor": "The user gathers up some honey and eats it.",
			"effect": "This heal the user for 40 HP. If used while adjacent to an allied plant Pokémon, that Pokémon’s next attack deals double damage.",
			"critical": "",
		},
		"Infestation": 
		{
			"power": 60,
			"style": "Melee",
			"flavor": "User bites into the target and holds on tight.",
			"effect": "The target is pinned for 60 damage.",
			"critical": "Recover 40 HP each turn of the pin.",
		},
		"Rage_Powder": 
		{
			"power": 50,
			"style": "Ranged",
			"flavor": "User cover the area in a pheromone that causes all targets to be enraged at the user.",
			"effect": "All enemies in range are under a compulsion to attack only the user. This move does not miss.",
			"critical": "The compulsion is harsh.",
		},
		"Silver_Wind": 
		{
			"power": 60,
			"style": "Melee",
			"flavor": "User blow silver scales on the wind to damage a foe.",
			"effect": "This deals 50 damage to the target and all adjacent targets. ",
			"critical": "User’s next attack deals double damage.",
		},
		"Struggle_Bug": 
		{
			"power": 60,
			"style": "Melee",
			"flavor": "User attacks with all its legs.",
			"effect": "This deals 30 damage to all adjacent targets, friend or foe, and they cannot use a difficult move next turn.",
			"critical": "Burns out all the targets’ difficult moves ",
		},
		"Attack_Order": 
		{
			"power": 90,
			"style": "Ranged",
			"flavor": "User orders its insect underlings to swarm the target.",
			"effect": "This deals 70 damage and crits on any doubles.",
			"critical": "The target takes 15 repeating damage.",
		},
		"Bug_Buzz": 
		{
			"power": 80,
			"style": "Ranged",
			"flavor": "User vibrates its wings to create a deafening shockwave of sound.",
			"effect": "This deals 80 damage.",
			"critical": "+30 damage.",
		},
		"Defend_Order": 
		{
			"power": 80,
			"style": "Self",
			"flavor": "User orders its insect underlings to swarm around it protectively.",
			"effect": "The user takes 40 less damage from all attacks for the remainder of combat.",
			"critical": "",
		},
		"Heal_Order": 
		{
			"power": 90,
			"style": "Self",
			"flavor": "User order its insect underlings to rub healing salve on it.",
			"effect": "Restore 60 HP.",
			"critical": "",
		},
		"Queen_Bee": 
		{
			"power": 100,
			"style": "Ranged",
			"flavor": "User dominates the insects in range.",
			"effect": "You can make all allied insect Pokémon take an extra standard action of your choice this turn. This does not affect Pokémon that have already been affected by Queen Bee this turn, or that know this move. ",
			"critical": "",
		},
		"Megahorn": 
		{
			"power": 90,
			"style": "Melee",
			"flavor": "User rams the target with the massive horn on its head.",
			"effect": "This deals 90 damage.",
			"critical": "+30 damage.",
		},
		"Pin_Missile": 
		{
			"power": 90,
			"style": "Ranged",
			"flavor": "User fires a barrage of tiny spikes at the target.",
			"effect": "This deals 2d60 damage to all targets along a line.",
			"critical": "+1d60 damage. ",
		},
	},
	"Dark":
	{
		"Ambush": 
		{
			"power": 20,
			"style": "Self",
			"flavor": "User prepares to hit the target at the last second.",
			"effect": "The user must remain stationary when using this move. It allows the user to delay taking its standard action until later in the fight. When the time comes, declare what standard action you’re taking and immediately take it, even if this interrupts someone else’s turn. If you have not taken your move action yet, you may immediately take it as well. The opportunity this move offers ends when your next turn comes up.",
			"critical": "",
		},
		"Bribery": 
		{
			"power": 30,
			"style": "Melee",
			"flavor": "The user pays off an opponent.",
			"effect": "Give the target pokedollars equal to 10 times its mind. It is now under a compulsion to fight on the user’s side. The target’s trainer gets to keep the cash. This move does not miss.",
			"critical": "Double the payout, but the compulsion is harsh.",
		},
		"Chaos_Tail": 
		{
			"power": 30,
			"style": "Melee",
			"flavor": "User whips its tail at the target with pure chaos following behind.",
			"effect": "This deals 1d60 damage.",
			"critical": "Crit: +1d60 damage.",
		},
		"Dark_Void": 
		{
			"power": 40,
			"style": "Ranged",
			"flavor": "User opens a portal to the netherworld of dreams.",
			"effect": "The target and all adjacent targets are asleep.",
			"critical": "Sleep is harsh. ",
		},
		"Embargo": 
		{
			"power": 20,
			"style": "Melee",
			"flavor": "A dark curse prevents items from reaching the target.",
			"effect": "The target cannot use items and items cannot be used on the target.",
			"critical": "The target is trapped. ",
		},
		"Fake_Tears": 
		{
			"power": 30,
			"style": "Ranged",
			"flavor": "The user tricks the target into lowering its guard with crocodile tears.",
			"effect": "The next attack against the target automatically crits.",
			"critical": "The target is under a compulsion to not attack the user.",
		},
		"Flattery": 
		{
			"power": 40,
			"style": "Ranged",
			"flavor": "The user manipulates the enemy with false praise.",
			"effect": "This inflicts a compulsion on the target to side with the user. Its next attack deals 10 extra damage regardless of whether it attacks friend or foe.",
			"critical": "The compulsion is harsh.",
		},
		"Fling": 
		{
			"power": 30,
			"style": "Ranged",
			"flavor": "User throws its item at the target, smashing it into shards.",
			"effect": "This deals damage equal to 1/10 the value of the item in pokedollars. The item is broken.",
			"critical": "The item does not break.",
		},
		"Nip": 
		{
			"power": 30,
			"style": "Melee",
			"flavor": "User quickly bites the target.",
			"effect": "Move an extra space and deal 20 damage.",
			"critical": "+30 damage.",
		},
		"Punishment": 
		{
			"power": 40,
			"style": "Melee",
			"flavor": "User slams the target for its hubris.",
			"effect": "This deals 30 damage plus 20 extra damage for each beneficial status the target has.",
			"critical": "Target loses all beneficial statuses.",
		},
		"Steal_Item": 
		{
			"power": 30,
			"style": "Melee",
			"flavor": "User takes something.",
			"effect": "If the user isn’t holding something and the target is, it takes the target’s item. The item may be used or kept if the fight is won.",
			"critical": "Player may keep the item even on a loss.",
		},
		"Steal_Heart": 
		{
			"power": 40,
			"style": "Melee",
			"flavor": "User transfers the affection the target had for its trainer onto itself.",
			"effect": "The target is under a compulsion to aid and defend the user. The target makes a save by rolling 2d6 and hoping to get under its current friendship points.",
			"critical": "The compulsion is harsh.",
		},
		"Stealth": 
		{
			"power": 30,
			"style": "Self",
			"flavor": "Enemies have a vague idea of where the user was, but not well enough to hit it.",
			"effect": "The user is sneaking.",
			"critical": "",
		},
		"Taunt": 
		{
			"power": 20,
			"style": "Ranged",
			"flavor": "User angers the foe into attacking wildly.",
			"effect": "The target is under a compulsion to use the most damaging move available, and if possible to attack the user.",
			"critical": "The compulsion is harsh.",
		},
		"Torment": 
		{
			"power": 30,
			"style": "Ranged",
			"flavor": "The target faces a fear of repeating its mistakes.",
			"effect": "This causes the last move the target used to burn out.",
			"critical": "Burn out a second move of your choice.",
		},
		"Anger_Strike": 
		{
			"power": 50,
			"style": "Melee",
			"flavor": "User’s anger fuels the attack.",
			"effect": "This deals damage equal to 10 times the amount of friendship points the user is missing, and the user cannot use friendship points to aid this move.",
			"critical": "Double damage.",
		},
		"Backstab": 
		{
			"power": 70,
			"style": "Melee",
			"flavor": "The user runs up behind its target and attack.",
			"effect": "This deals 50 damage. If the user attacking from the opposite side as one of its allies, this move automatically crits.",
			"critical": "+50 damage",
		},
		"Beat_Up": 
		{
			"power": 60,
			"style": "Melee",
			"flavor": "The user and allies lay the smackdown on a common enemy.",
			"effect": "This deals 30 damage to a foe, and anyone else adjacent to the foe can add 30 damage if they wish.",
			"critical": "Every participant can do any natural melee attack.",
		},
		"Bite": 
		{
			"power": 60,
			"style": "Melee",
			"flavor": "User sinks its teeth into the target, its jaws filled with dark energy.",
			"effect": "This deals 60 damage.",
			"critical": "Target is stunned.",
		},
		"Chaos_Swipe": 
		{
			"power": 60,
			"style": "Melee",
			"flavor": "User chaotically slashes at the target.",
			"effect": "This deals 2d60 damage.",
			"critical": "+1d60 damage.",
		},
		"Feint_Attack": 
		{
			"power": 70,
			"style": "Melee",
			"flavor": "User attacks with deception and cunning, faking out its foe.",
			"effect": "This deals the user’s sense in damage and does not miss.",
			"critical": "",
		},
		"Foul_Play": 
		{
			"power": 50,
			"style": "Melee",
			"flavor": "User tricks the opponent into hurting itself.",
			"effect": "The target takes damage equal to its strength.",
			"critical": "+30 damage.",
		},
		"Hit_and_Run": 
		{
			"power": 60,
			"style": "Ranged",
			"flavor": "The user shoots the target and runs away before it can face a counterattack.",
			"effect": "This deals 30 damage and the user can move 2 spaces after using it. Additionally, if it didn’t dash beforehand, it may dash afterward.",
			"critical": "+20 damage and +1 space of movement.",
		},
		"Hone_Claws": 
		{
			"power": 50,
			"style": "Self",
			"flavor": "The user prepares to attack with extra viciousness.",
			"effect": "For the remainder of combat, the user crits on any doubles.",
			"critical": "",
		},
		"Knock_Off": 
		{
			"power": 70,
			"style": "Melee",
			"flavor": "User smacks the target and force it to drop what it is holding.",
			"effect": "This deals the user’s strength in damage and forces the target to drop held items and pinned opponents. Previously held items can be picked up after battle.",
			"critical": "+50 damage.",
		},
		"Memento": 
		{
			"power": 50,
			"style": "Melee",
			"flavor": "The user puts the last of its energy into giving its target something to remember it by.",
			"effect": "The target does half damage for the remainder of the fight, but the user faints from the effort.",
			"critical": "Target has a compulsion to terror.",
		},
		"Nasty_Plot": 
		{
			"power": 60,
			"style": "Self",
			"flavor": "The user plans its opponents’ downfall.",
			"effect": "The user deals 30 extra damage on all damaging attacks. ",
			"critical": "",
		},
		"Night_Slash": 
		{
			"power": 70,
			"style": "Melee",
			"flavor": "User attacks with dark claws.",
			"effect": "This deals 50 damage and crits on any doubles.",
			"critical": "+30 damage.",
		},
		"Pursuit": 
		{
			"power": 70,
			"style": "Melee",
			"flavor": "There’s nowhere to escape from the user’s wrath.",
			"effect": "This deals 60 damage. Until the user's next turn, if the target is returned to a Pokeball, tries to leave the battlefield, or is forced off the battlefield,  it immediately takes 40 extra damage.",
			"critical": "The target is trapped as well.",
		},
		"Sabretooth": 
		{
			"power": 60,
			"style": "Melee",
			"flavor": "User sinks its teeth into the target and doesn’t let go.",
			"effect": "This pins the target for 60 damage.",
			"critical": "The pin is harsh.",
		},
		"Snipe": 
		{
			"power": 70,
			"style": "Ranged",
			"flavor": "The user shoot from afar.",
			"effect": "This deals 30 damage and has a range of +4 spaces.",
			"critical": "Headshot! +30 damage.",
		},
		"Thief": 
		{
			"power": 60,
			"style": "Melee",
			"flavor": "An old-fashioned mugging.",
			"effect": "This deals 40 damage, and if the target has a held item but the user don’t, take the target’s item.",
			"critical": "+30 damage.",
		},
		"Assassinate": 
		{
			"power": 100,
			"style": "Melee",
			"flavor": "User sneaks up behind the target and takes it out in one well-placed attack.",
			"effect": "This automatically KO’s the target unless it makes a speed save. This move cannot be used unless the user is sneaking.",
			"critical": "The target is KO’d without a save.",
		},
		"Chaos_Blast": 
		{
			"power": 100,
			"style": "Melee",
			"flavor": "Pure chaos assaults a group of enemies.",
			"effect": "This deals 3d60 damage to the target and all adjacent targets.",
			"critical": "+1d60 damage.",
		},
		"Chomp": 
		{
			"power": 80,
			"style": "Melee",
			"flavor": "The user bites down with massive jaws.",
			"effect": "This deals 80 damage.",
			"critical": "+30 damage.",
		},
		"Dark_Pulse": 
		{
			"power": 90,
			"style": "Ranged",
			"flavor": "User releases a beam of black energy.",
			"effect": "This deals 90 damage.",
			"critical": "The target is stunned.",
		},
		"Eclipse": 
		{
			"power": 100,
			"style": "Weather",
			"flavor": "Darkness across the land.",
			"effect": "All dark and ghost types gain the sneaking status at the end of their turn.",
			"critical": "",
		},
		"Hyperspace_Fury": 
		{
			"power": 80,
			"style": "Melee",
			"flavor": "User pounds the target with extradimensional arms.",
			"effect": "This deals 60 damage. It does not miss.",
			"critical": "",
		},
		"Moonshadow": 
		{
			"power": 80,
			"style": "Self",
			"flavor": "The user blends in with the darkness like a shadow in the night.",
			"effect": "The user is sneaking and remains sneaking even when it takes actions that would end the effect. Only bright light can end the sneaking effect such as a fire or electric attack.",
			"critical": "",
		},
		"Night_Daze": 
		{
			"power": 90,
			"style": "Ranged",
			"flavor": "User shoots a wave of blinding darkness at the sucker who earned its wrath.",
			"effect": "This deals 90 damage.",
			"critical": "The target is blinded.",
		},
		"Steal_Mojo": 
		{
			"power": 80,
			"style": "Melee",
			"flavor": "User takes the target’s positive vibes.",
			"effect": "If the target has any positive statuses, the user gains all of them and the target loses all of them.",
			"critical": "The target misses its next attack, and user crits its next attack.",
		},
		"Ultimate_Chaos": 
		{
			"power": 100,
			"style": "Ranged",
			"flavor": "The user unleashes unfettered chaos.",
			"effect": "Flip a coin. On tails, this does 2d60 of damage. On heads, it crits. (The coin flip replaces the normal crit roll.)",
			"critical": "+2d60 damage.",
		},
		"Vampire_Bite": 
		{
			"power": 90,
			"style": "Melee",
			"flavor": "The user bites the target and siphons its health.",
			"effect": "The target takes 60 damage and the user recovers half the damage dealt in HP. If this faints the target, the target replaces one of its moves with vampire bite.",
			"critical": "+20 damage dealt with increased healing.",
		}, 		
	},
	"Dragon":
	{
		"Dragon’s_Luck": 
		{
			"power": 40,
			"style": "Self",
			"flavor": "Have you ever heard of an unlucky dragon?",
			"effect": "The next move the user performs automatically crits.",
			"critical": "",
			"mark": "Designer's Choice",
		},
		"Grow_Scales": 
		{
			"power": 30,
			"style": "Self",
			"flavor": "The user grows extra scales that counteract various hazards.",
			"effect": "The user is immune to the next status that would otherwise be inflicted on it.",
			"critical": "",
			"mark": "Designer's Choice",
		},
		"Twister": 
		{
			"power": 30,
			"style": "Ranged",
			"flavor": "Leathery wings send out a small cyclone to bat around foes.",
			"effect": "This deals 20 damage to the target and all adjacent targets, friend or foe.",
			"critical": "Targets are trapped. ",
		},
		"Ancestral_Power": 
		{
			"power": 50,
			"style": "Self",
			"flavor": "User calls upon the power of its forebears.",
			"effect": "The next attack the user makes deals double damage.",
			"critical": "",
		},
		"Dragon_Claw": 
		{
			"power": 60,
			"style": "Melee",
			"flavor": "User slashes with draconic talons.",
			"effect": "This deals 60 damage.",
			"critical": "+30 damage.",
		},
		"Dragon_Dance": 
		{
			"power": 80,
			"style": "Self",
			"flavor": "User dances like only a dragon can, and its physical prowess rises.",
			"effect": "The user gains an extra dash action for the remainder of combat and its next attack deals 30 extra damage.",
			"critical": "",
		},
		"Dragon_Pulse": 
		{
			"power": 60,
			"style": "Ranged",
			"flavor": "User create a massive shockwave and expel it from its mouth.",
			"effect": "This deals 60 damage.",
			"critical": "+30 damage.",
		},
		"Dragon_Rage": 
		{
			"power": 60,
			"style": "Melee",
			"flavor": "A dragon’s wrath is not hot and random but cold and calculating. This fiery breath hits all alike.",
			"effect": "This deals 60 damage regardless of typing, damage multipliers, or other factors involved.. ",
			"critical": "",
		},
		"Dual_Chop": 
		{
			"power": 70,
			"style": "Melee",
			"flavor": "User strikes twice, like the double dragon.",
			"effect": "This makes 2 attacks at 30 damage each.",
			"critical": "Roll a crit for each, and each crit deals +20 damage.",
		},
		"Dragon_Roar": 
		{
			"power": 70,
			"style": "Ranged",
			"flavor": "There are two kinds of Pokémon: those that are friends with dragons, and those that are KO’d.",
			"effect": "All enemies in range are under a compulsion to stay far away from the user. Allies are not affected.",
			"critical": "The compulsion is harsh.",
		},
		"Shrug_Off": 
		{
			"power": 50,
			"style": "Self",
			"flavor": "Dragons don’t take sick days. ",
			"effect": "Cure all statuses on the user.",
			"critical": "",
		},
		"Dragon_Landing": 
		{
			"power": 70,
			"style": "Melee",
			"flavor": "User lands so hard it makes a crater. It might not be able to fly any longer, but it’s more a dragon than ever.",
			"effect": "This deals 50 damage to all adjacent targets. Lose the flying type, and replace it with the dragon type if user isn’t already a dragon. If the user has an ability like airborne or levitate, lose it, and deal 30 extra damage.",
			"critical": "All adjacent enemies are moved 4 spaced directly away from the user. If two spaces seem equally good as a landing position, the user chooses where the target lands.",
		},
		"Complete_Humiliation": 
		{
			"power": 90,
			"style": "Ranged",
			"flavor": "The user reminds the target of how weak it is.",
			"effect": "Burn out all of the target’s difficult moves.",
			"critical": "The target has a compulsion to complete apathy.",
		},
		"Draco_Meteor": 
		{
			"power": 100,
			"style": "Ranged",
			"flavor": "User calls down a meteor from the sky with sheer force of mind.",
			"effect": "This does 90 damage to the targeted space, all spaces adjacent to that, and all spaces adjacent to those.",
			"critical": "+30 damage.",
		},
		"Dragon_Rush": 
		{
			"power": 90,
			"style": "Melee",
			"flavor": "User charges the target with wings and scales.",
			"effect": "This deals 90 damage.",
			"critical": "The target is stunned.",
		},
		"Dragon_Tail": 
		{
			"power": 80,
			"style": "Melee",
			"flavor": "Looks like Team Rocket’s blasting off again.",
			"effect": "The target is moved 8 spaces in a direction of your choosing.",
			"critical": "The target is moved anywhere on the map you wish, or off the map.",
		},
		"Dragon’s_Wings": 
		{
			"power": 90,
			"style": "",
			"flavor": "Melee",
			"effect": "User flies forward, borne by reptilian wings.",
			"critical": "This deals 50 damage, and the user moves 3 extra spaces, ignoring terrain hazards.",
		},
		"Indomitable_Will": 
		{
			"power": 40,
			"style": "Self",
			"flavor": "You’re a dragon. Who’s going to boss you around?",
			"effect": "Clear any compulsions on the user. This move can be used by choice even if the user is under compulsion. ",
			"critical": "",
		},
		"Outrage": 
		{
			"power": 90,
			"style": "Melee",
			"flavor": "The user fills itself with imperial fury and smashes its foes.",
			"effect": "This deals 90 damage, and the user is under a compulsion to continue to use it turn after turn. While doing so, it may continue to use this move as if it were natural. When the compulsion ends, the user takes a compulsion to insanity.",
			"critical": "Don’t roll saves against compulsion to continue using this move. Remove it or not as you see fit. ",
		},
		"Protect_the_Hoard": 
		{
			"power": 100,
			"style": "Ranged",
			"flavor": "No one separates a dragon from its money.",
			"effect": "This deals damage equal to 1/10 the pokedollars you currently have on you.",
			"critical": "Gain $ equal to damage dealt, due to interest payments on money owned. ",
		},
		"Roar_of_Time": 
		{
			"power": 90,
			"style": "Ranged",
			"flavor": "User shouts as it chaotically rends time and space to attack a foe.",
			"effect": "This deals 120 damage, but the user cannot use any further moves until encouraged.",
			"critical": "Use a natural move immediately due to speeding up the user’s personal time.",
		},
		"Seize_Power": 
		{
			"power": 90,
			"style": "Self",
			"flavor": "Bored by the foes around it, the user concentrates on increasing its power for a later, more challenging fight.",
			"effect": "If used move in combat, immediately train one of the user’s stats. It does nothing else, and automatically fails outside of combat.",
			"critical": "",
		},
		"Spatial_Rend": 
		{
			"power": 100,
			"style": "Melee",
			"flavor": "The user bends the fabric of space to defeat its foe.",
			"effect": "This deals 80 damage and crits on any doubles.",
			"critical": "+30 damage.",
		},
		"Ultimate_Power": 
		{
			"power": 120,
			"style": "Ranged",
			"flavor": "The user unleashes its true power, firing a beam of pure blue light that obliterates everything in its way.",
			"effect": "Every target along a line takes damage equal to the user’s mind plus its strength.",
			"critical": "If there are any survivors, one of them is KO’d at random.",
		},	
	},
	"Electric":
	{
		"Jolt": 
		{
			"power": 30,
			"style": "Melee",
			"flavor": "The user charges in and electrifies everyone around it.",
			"effect": "This deals 20 damage to all enemies around the user.",
			"critical": "Targets are stunned.",
		},
		"Electrify":
		{
			"power": 40,
			"style": "Ranged",
			"flavor": "This shocks the target and continues to electrocute it.",
			"effect": "This deals 20 repeating damage to the target.",
			"critical": "The target is trapped.",
		},
		"Electric_Boogaloo": 
		{
			"power": 40,
			"style": "Ranged",
			"flavor": "The user rocks on to electric avenue with a dance that builds up static.",
			"effect": "User and everyone in range are charged, meaning the next uncharged Pokemon that moves adjacent to them takes 2d60 electric damage.",
			"critical": "",
		},
		"Electrolocation": 
		{
			"power": 30,
			"style": "Self",
			"flavor": "The user senses electrical impulses to scan the environment.",
			"effect": "The target is identified.",
			"critical": "Target is harshly identified. ",
			"out_of_battle": "This move is particularly adept at picking up on electrical sources, such as the nervous systems of animals or lost electronics.",
		},
		"Electroweb":
		{
			"power": 40,
			"style": "Ranged",
			"flavor": "User traps the targets in a web of electricity.",
			"effect": "This traps the targets and all adjacent targets.",
			"critical": "Targets are harshly trapped. ",
		},
		"Lightning_Reflexes": 
		{
			"power": 40,
			"style": "Self",
			"flavor": "User’s nerves begin to conduct electrical impulses quicker and more effectively.",
			"effect": "",
			"critical": "For the remainder of combat, the user automatically gets the benefit of the dodge order without that needing to be said, due to a shortened reaction time..",
		},
		"Magnet_Rise": 
		{
			"power": 30,
			"style": "Self",
			"flavor": "The user floats on magnetic currents.",
			"effect": "User gains the levitate ability.",
			"critical": "",
		},
		"Magnetize": 
		{
			"power": 30,
			"style": "Ranged",
			"flavor": "User causes the target to be attracted to metal.",
			"effect": "The target is now weak against steel attacks.",
			"critical": "",
		},
		"Nuzzle": 
		{
			"power": 30,
			"style": "Melee",
			"flavor": "User rubs its electrified cheeks against the target.",
			"effect": "This stuns the target.",
			"critical": "Also deals 30 damage.",
		},
		"Shuffle": 
		{
			"power": 30,
			"style": "Self",
			"flavor": "User shuffles its feet along the ground, building up a charge.",
			"effect": "Reduce the user’s dash by 1 while using this move. The user’s next electric attack deals double damage.",
			"critical": "",
		},
		"Spark": 
		{
			"power": 20,
			"style": "Melee",
			"flavor": "A spark jumps from the user to a foe.",
			"effect": "This deals 20 damage to the target.",
			"critical": "Stuns the target.",
		},
		"Supercharge": 
		{
			"power": 40,
			"style": "Melee",
			"flavor": "The user provides an ally with enormous amounts of electricity.",
			"effect": "Target’s next electric attack does double damage.",
			"critical": "",
			"out_of_battle": "The Pokemon can provide the target with way more energy than it needs to function, increasing performance. This move gives the GM the right and responsibility to insult anyone who says 'That can cause problems with technology in our world, so the semi-magical nature of Pokémon moves will always have the exact same effect on advanced Pokémon-world tech that is designed to be able to handle exposure to electric attacks.'",
			"mark": "Designer's Choice"
		},
		"Superstatic": 
		{
			"power": 30,
			"style": "Self",
			"flavor": "The user builds up a massive static charge that is about to go off.",
			"effect": "This deals 60 damage to the next Pokemon that moves adjacent to the user.",
			"critical": "",
		},
		"Thunder_Shock": 
		{
			"power": 30,
			"style": "Ranged",
			"flavor": "User shoots the target with electricity.",
			"effect": "This deals 30 damage.",
			"critical": "Stuns the target.",
		},
		"Zap": 
		{
			"power": 40,
			"style": "Ranged",
			"flavor": "User shoots a bit of lightning at a foe.",
			"effect": "This deals 40 damage.",
			"critical": "+30 damage.",
		},
		"Ball_Lightning": 
		{
			"power": 70,
			"style": "Ranged",
			"flavor": "User shoots an exploding orb of electricity.",
			"effect": "Deal 60 damage to the target and all adjacent targets, friend or foe.",
			"critical": "+30 damage.",
		},
		"Charge": 
		{
			"power": 50,
			"style": "Self",
			"flavor": "User builds up an electrical charge.",
			"effect": "The next electric attack the user does inflicts double damage.",
			"critical": "",
		},
		"Discharge": 
		{
			"power": 60,
			"style": "Melee",
			"flavor": "User releases a powerful electric blast in every direction.",
			"effect": "Deal 60 damage to all adjacent targets, friend or foe.",
			"critical": "Targets are stunned.",
		},
		"Eerie_Impulse": 
		{
			"power": 70,
			"style": "Ranged",
			"flavor": "St. Elmo’s fire distracts the opponent, keeping it from targeting allies.",
			"effect": "The target’s range is halved for the remainder of combat.",
			"critical": "Target is also blinded.",
		},
		"Empty_Batteries": 
		{
			"power": 60,
			"style": "Melee",
			"flavor": "User pours all its electrical energy into the target.",
			"effect": "Deal 80 damage to the target. User can't use electric attacks next turn.",
			"critical": "Target is trapped.",
		},
		"Parabolic_Charge": 
		{
			"power": 70,
			"style": "Melee",
			"flavor": "User absorbs electrical energy from all adjacent enemies and uses that to recharge. ",
			"effect": "Deal 40 damage to all adjacent targets, friend or foe, and restore health equal to 10 times the number of targets shocked.",
			"critical": "+20 damage and double the healing. ",
		},
		"Tetrashock": 
		{
			"power": 60,
			"style": "Ranged",
			"flavor": "User shoots lightning out in 4 directions.",
			"effect": "Choose 4 directions; either north, east, south, and west, or northeast, southeast, southwest, and northwest. Deal 50 damage to all targets along those 4 lines, friend or foe.",
			"critical": "+30 damage.",
		},
		"Ion_Beam": 
		{
			"power": 70,
			"style": "Ranged",
			"flavor": "A broad beam of electrons washes over everything in its path.",
			"effect": "Every target along a line takes 40 damage.",
			"critical": "+30 damage.",
		},
		"Thunderbolt": 
		{
			"power": 60,
			"style": "Ranged",
			"flavor": "User shoots a bolt of lightning at the target.",
			"effect": "This deals 60 damage.",
			"critical": "Crit: Target is stunned.",
		},
		"Thunder_Fang": 
		{
			"power": 50,
			"style": "Melee",
			"flavor": "User bites the target with electrified teeth.",
			"effect": "This deals 50 damage.",
			"critical": "Target is stunned. ",
		},
		"Thunder_Punch": 
		{
			"power": 60,
			"style": "Melee",
			"flavor": "User punches the target with an electrified fist.",
			"effect": "This deals 60 damage.",
			"critical": "Target is stunned.",
		},
		"Thunderwave": 
		{
			"power": 60,
			"style": "Ranged",
			"flavor": "Waves of electricity roll over the target.",
			"effect": "The target is harshly stunned. ",
			"critical": "Target takes 30 damage. ",
		},
		"Bolt_Strike": 
		{
			"power": 100,
			"style": "Ranged",
			"flavor": "User shoots the target with a powerful bolt of lightning.",
			"effect": "This deals 100 damage to the target.",
			"critical": "Target is stunned. ",
		},
		"Charge_Beam": 
		{
			"power": 100 ,
			"style": "Ranged",
			"flavor": "User zaps the target and absorbs the leftover electricity.",
			"effect": "This deals 40 damage to the target and doubles the damage of the next electric attack from the user.",
			"critical": "+30 damage.",
		},
		"Electro_Ball": 
		{
			"power": 90,
			"style": "Ranged",
			"flavor": "User shoots a lightning-fast ball of electricity.",
			"effect": "This deals the user’s speed +40 in damage to the target. ",
			"critical": "+30 damage.",
		},
		"Lightning": 
		{
			"power": 80,
			"style": "Ranged",
			"flavor": "A pure bolt of electric devastation.",
			"effect": "This deals 80 damage to the target.",
			"critical": "+30 damage.",
		},
		"Shockwave": 
		{
			"power": 100,
			"style": "Ranged",
			"flavor": "User shoots a lightning-fast bolt of electricity.",
			"effect": "This deals 70 damage and does not miss.",
			"critical": "",
		},
		"Thunder": 
		{
			"power": 90,
			"style": "Melee",
			"flavor": "User calls down lightning, channeling it through its own body into an explosion of lightning.",
			"effect": "This deals 80 damage to everyone adjacent to the user.",
			"critical": "Stun the targets.",
		},
		"Thunderstorm": 
		{
			"power": 100,
			"style": "Ranged",
			"flavor": "User calls down lightning from the sky, blasting the area with bolt after bolt.",
			"effect": "This deals 90 damage to all targets within range, friend or foe.",
			"critical": "Stun the targets.",
		},
		"Volt_Tackle": 
		{
			"power": 80,
			"style": "Melee",
			"flavor": "User electrifies itself, charges the target, and shocks it repeatedly.",
			"effect": "User deals 120 damage but takes 40 damage.",
			"critical": "Target is stunned.",
		},
		"Wild_Charge": 
		{
			"power": 90,
			"style": "Melee",
			"flavor": "User electrifies itself and rams the target.",
			"effect": "This deals 110 damage, but the user takes 20 damage.",
			"critical": "+40 damage and the user takes +10 damage.",
		},
		"Zap_Cannon": 
		{
			"power": 80,
			"style": "Ranged",
			"flavor": "User shoots a powerful beam of lightning at the target.",
			"effect": "This deals 80 damage and stuns the target.",
			"critical": "",
		},
	},
	"Fairy":
	{
		"Charm": 
		{
			"power": 30,
			"style": "Ranged",
			"flavor": "Using wiles to distract the enemy.",
			"effect": "The target cannot use a difficult move next turn.",
			"critical": "Target cannot use difficult moves for the rest of combat.",
		},
		"Disarming_Voice": 
		{
			"power": 40,
			"style": "Melee",
			"flavor": "User lower the targets’ defense and then smacks them.",
			"effect": "This deals 20 damage to all adjacent foes and does not miss.",
			"critical": "",
		},
		"Fairy_Dust": 
		{
			"power": 20,
			"style": "Ranged",
			"flavor": "The user sprinkles mysterious magical dust on the target.",
			"effect": "Roll a d6 and do an effect from this list: 1: The target is stunned 2: The target is asleep 3: The target takes 30 fire damage 4: The target takes 30 grass damage 5: The target takes a compulsion to pretending it’s a fairy 6: The target takes 15 repeating damage",
			"critical": "Roll twice and do both effects.",		
			"out_of_battle": "This can be applied to various inanimate objects. This has whatever effect on the item the GM says it has, or roll a d6. 1: The object disappears, where to no one knows. 2: The object is transformed into a similar object. 3: The object is transformed into the Pokémon that most closely resembles the object. 4: The object is transformed into the opposite of itself. 5: Ask a really creative player what should happen, but it can’t be the player who used the move. If the GM agrees, that happens. If not, the GM picks something annoying and that happens instead. 6: The user takes its mind in damage and may no longer use this move this game session."
		},
		"Fairy_Tail":
		{
			"power": 20,
			"style": "Melee",
			"flavor": "The user slaps the target with a magical tail.",
			"effect": "This deals 20 damage.",
			"critical": "Crit: +30 damage.",
		},
		"Fairy_Wind": 
		{
			"power": 30,
			"style": "Ranged",
			"flavor": "User sends a blast of enchanted wind at its target.",
			"effect": "This deals 30 damage.",
			"critical": "Move the target 3 spaces.",
		},
		"Glomp": 
		{
			"power": 10,
			"style": "Melee",
			"flavor": "User tacklehugs its opponent, distracting it with kindness.",
			"effect": "This pins the target for no damage, and grants it a friendship point. The target is under a compulsion not to hurt the user.",
			"critical": "Target has a compulsion to protect and aid the user above all else. ",
		},
		"Sweet_Kiss": 
		{
			"power": 30,
			"style": "Melee",
			"flavor": "A quick peck and some fairy magic and the target suddenly goes bananas.",
			"effect": "The target suffers a compulsion to confusion.",
			"critical": "The compulsion is harsh.",
		},
		"Aromatic_Mist": 
		{
			"power": 50,
			"style": "Melee",
			"flavor": "User sprays a stimulating aromatherapy scent.",
			"effect": "User and all adjacent targets regain the use of a burnt out move.",
			"critical": "",
		},
		"Baby-Doll_Eyes": 
		{
			"power": 30,
			"style": "Ranged",
			"flavor": "User bats its cute eyes at a Pokémon, lowering its aggression.",
			"effect": "This has a range of 3 extra spaces. The target has a compulsion not to hurt others.",
			"critical": "The compulsion is harsh.",
		},
		"Dazzling_Gleam": 
		{
			"power": 70,
			"style": "Ranged",
			"flavor": "User blasts all targets in the area with fairy light.",
			"effect": "All targets in range take 60 damage.",
			"critical": "+30 damage.",
		},
		"Draining_Kiss": 
		{
			"power": 60,
			"style": "Melee",
			"flavor": "Wow, what a kiss!",
			"effect": "This deals 40 damage and heals half the damage dealt.",
			"critical": "+20 damage with increased healing. ",
		},
		"Fairy_Godmother": 
		{
			"power": 60,
			"style": "Ranged",
			"flavor": "User blesses the target with luck and good health.",
			"effect": "The target’s next attack automatically crits and it restores 20 health. ",
			"critical": "",
			"out_of_battle": "Every time an egg hatches, if you have at least one Pokémon in your party that knows this move, the egg trains all stats. Multiple fairy godmothers do not stack. ",
		},
		"Friendship_Is_Magic": 
		{
			"power": 50,
			"style": "Ranged",
			"flavor": "User channels the power of its friendship into a powerful blast.",
			"effect": "This deals damage equal to 10 times the number of friendship points the user has. ",
			"critical": "Double Damage",
		},
		"Crafty_Shield": 
		{
			"power": 90,
			"style": "Ranged",
			"flavor": "A protective field keeps friends safe.",
			"effect": "User and all allies in range, but not enemies, are protected from all statuses for the remainder of combat. ",
			"critical": "",
		},
		"Fairy_Lock": 
		{
			"power": 100,
			"style": "Weather",
			"flavor": "Fairy barriers keep everyone together.",
			"effect": "No Pokémon may leave the battlefield unless KO’d, whether that is being returned by pokeball, leaving the field, or being forcibly moved off.",
			"critical": "",
		},
		"Geas": 
		{
			"power": 80,
			"style": "Ranged",
			"flavor": "User forces the enemy to play fair and not be a cheaty cheaterson.",
			"effect": "Pick a target anywhere on the battlefield. It is under a harsh compulsion to abandon whatever overpowered, piece of crap strategy it’s been abusing. This move does not miss.",
			"critical": "",
		},
		"Geomancy": 
		{
			"power": 100,
			"style": "Self",
			"flavor": "User slowly draws elemental power from the environment.",
			"effect": "At the end of the user's next turn, all of its moves are now natural.",
			"critical": "",
		},
		"Giant_Slayer": 
		{
			"power": 100,
			"style": "Ranged",
			"flavor": "The user takes down a greater foe with a smart plan and a clever wit.",
			"effect": "This move has one less space of range, but it deals damage equal to the sum total of the target’s IV’s. Thus, it’s most effective against overpowered Pokémon. Giant slayer does double damage to gargantuan Pokémon.",
			"critical": "Extra damage equal to the target’s strength EV. ",
		},
		"Light_of_Ruin": 
		{
			"power": 100,
			"style": "Ranged",
			"flavor": "A devastating ray of light, fuelled by the user’s strength.",
			"effect": "This deals 100 damage to every target along a line, but the user takes 50 damage.",
			"critical": "+30 damage",
		},
		"Misty_Terrain": 
		{
			"power": 100,
			"style": "Weather",
			"flavor": "Healing mist rolls in low to the ground.",
			"effect": "All Pokémon on the ground are immune to status effects and immune to dragon moves. ",
			"critical": "",
		},
		"Moonblast": 
		{
			"power": 100,
			"style": "Ranged",
			"flavor": "In the name of the moon I will punish you.",
			"effect": "This deals 90 damage to the target and all adjacent targets.",
			"critical": "+30 damage.",
		},
		"Moonlight": 
		{
			"power": 90,
			"style": "Self",
			"flavor": "User raise its arms to the moon and draws in energy.",
			"effect": "Restore 50 health, or 80 if it’s nighttime and the user can see the light of the moon.",
			"critical": "",
		},
		"Play_Rough": 
		{
			"power": 90,
			"style": "Melee",
			"flavor": "Time to get serious.",
			"effect": "This deals 90 damage.",
			"critical": "Target cannot use a difficult attack next turn.",
		},
	},
	"Fighting":
	{
		"Arm_Thrust": 
		{
			"power": 30,
			"style": "Melee",
			"flavor": "User repeatedly palm-strikes the enemy.",
			"effect": "This deals 1d60 damage. ",
			"critical": "+1d60 damage. ",
		},
		"Karate_Chop": 
		{
			"power": 30,
			"style": "Melee",
			"flavor": "Hiyaaa!",
			"effect": "This deals 20 damage and crits on any doubles.",
			"critical": "+30 damage.",
		},
		"Headlock": 
		{
			"power": 20,
			"style": "Melee",
			"flavor": "User grabs the target by the head.",
			"effect": "This pins the target for 20 damage.",
			"critical": "Pin is harsh.",
		},
		"Rock_Smash": 
		{
			"power": 40,
			"style": "Melee",
			"flavor": "User smashes whatever is in front of it.",
			"effect": "This deals 30 damage and crits on any doubles.",
			"critical": "The target takes double damage from the next attack.",
		},
		"Spin_Kick": 
		{
			"power": 30,
			"style": "Melee",
			"flavor": "A reckless twirling kick.",
			"effect": "This deals 20 damage and hits all adjacent targets.",
			"critical": "Move all targets 3 spaces.",
		},
		"Slap": 
		{
			"power": 20,
			"style": "Melee",
			"flavor": "A quick fighting smack.",
			"effect": "This deals 20 damage.",
			"critical": "+30 damage.",
		},
		"Submission": 
		{
			"power": 30,
			"style": "Melee",
			"flavor": "User grabs the target and dives for the ground.",
			"effect": "This deals 60 damage and the user takes 30 damage.",
			"critical": "Target is stunned. ",
		},
		"Triple_Kick": 
		{
			"power": 40,
			"style": "Melee",
			"flavor": "3 short kicks.",
			"effect": "Make 3 attacks, each doing 10 damage.",
			"critical": "Roll to crit for each, and on each crit, do +10 damage. ",
		},
		"Aura_Sphere": 
		{
			"power": 60,
			"style": "Ranged",
			"flavor": "Hadouken!",
			"effect": "This deals 30 damage and does not miss, hitting the target and all adjacent targets.",
			"critical": "",
		},
		"Brick_Break": 
		{
			"power": 50,
			"style": "Melee",
			"flavor": "User chops straight through the enemy’s defenses.",
			"effect": "This deals 40 damage and ignores any buffs or abilities the user may have that allow it to avoid attacks or reduce damage taken.",
			"critical": "+30 damage.",
		},
		"Bulk_Up": 
		{
			"power": 50,
			"style": "Self",
			"flavor": "User becomes even more muscled.",
			"effect": "The user’s next attack deals double damage.",
			"critical": "",
		},
		"Circle_Throw": 
		{
			"power": 70,
			"style": "Melee",
			"flavor": "User twirls the target around and tosses it from the area.",
			"effect": "This deals 30 damage and moves the target 4 spaces. ",
			"critical": "+30 damage.",
		},
		"Close_Combat": 
		{
			"power": 50,
			"style": "Melee",
			"flavor": "User strikes with reckless abandon.",
			"effect": "This deals 100 damage and the user burns out all its difficult moves.",
			"critical": "+40 damage dealt, +10 damage",
		},
		"Counter": 
		{
			"power": 60,
			"style": "Melee",
			"flavor": "A riposte that knocks the enemy back.",
			"effect": "If the user did not dash before using this move, it deals 100 damage and moves the target back 1 space.",
			"critical": "+30 damage",
		},
		"Cross_Chop": 
		{
			"power": 50,
			"style": "Melee",
			"flavor": "User chops with each arm in an X pattern.",
			"effect": "This deals 40 damage and crits on any doubles.",
			"critical": "+30 damage.",
		},
		"Double_Kick": 
		{
			"power": 70,
			"style": "Melee",
			"flavor": "User kicks in quick succession with each foot.",
			"effect": "This deals 30 damage, and the user attacks twice.",
			"critical": "Roll a crit for each attack, each crit does +20 damage.",
		},
		"Drain_Punch": 
		{
			"power": 60,
			"style": "Melee",
			"flavor": "Users saps energy from the target with the hit.",
			"effect": "This deals 40 damage, and if it hits the user restores half the damage dealt.",
			"critical": "+20 damage with the extra healing that would result. ",
		},
		"Force_Palm": 
		{
			"power": 60,
			"style": "Melee",
			"flavor": "User makes a forceful blow with its hand. ",
			"effect": "This deals 40 damage and moves the target 2 spaces. ",
			"critical": "Target is stunned.",
		},
		"Grapple": 
		{
			"power": 50,
			"style": "User puts the target in a wrestling hold.",
			"flavor": "Pin the target for 50 damage.",
			"effect": "",
			"critical": "+30 immediate damage.",
		},
		"Hammer_Arm": 
		{
			"power": 70,
			"style": "Melee",
			"flavor": "User brings its fist down in a devastating attack.",
			"effect": "This deals 90 damage but the user loses its next dash action.",
			"critical": "Target is stunned. ",
		},
		"Jump_Kick": 
		{
			"power": 60,
			"style": "Melee",
			"flavor": "User leaps to the target foot first.",
			"effect": "Draw a line from the user straight through the target. One a hit, this moves the user adjacent to the target and deals 80 damage. On a miss, the user moves its full movement distance to the end of the line and the user takes 30 damage.",
			"critical": "+30 damage.",
		},
		"Low_Kick": 
		{
			"power": 60,
			"style": "Melee",
			"flavor": "Using a low, sweeping kick that is more effective against heavier targets.",
			"effect": "This deals damage equal to the target’s strength.",
			"critical": "User kicks the jewels. Target burns out its difficult moves.",
		},
		"Low_Sweep": 
		{
			"power": 50,
			"style": "Melee",
			"flavor": "Users sweeps the target’s legs.",
			"effect": "This deals 30 damage and the target loses its next dash action.",
			"critical": "Target is stunned.",
		},
		"Mach_Punch": 
		{
			"power": 70,
			"style": "Melee",
			"flavor": "User flies forward and delivers a lightning-speed punch.",
			"effect": "This deals 40 damage and allows the user to move 3 extra spaces.",
			"critical": "Take an extra dash action.",
		},
		"Power-Up_Punch": 
		{
			"power": 70,
			"style": "Melee",
			"flavor": "User throws warm-up punches to get ready.",
			"effect": "This deals 20 damage and doubles the damage of the user’s next attack.",
			"critical": "Double damage to the next 2 attacks instead of just 1.",
		},
		"Roundhouse": 
		{
			"power": 60,
			"style": "Melee",
			"flavor": "User punches and follows through in a circle.",
			"effect": "This deals 50 damage to all adjacent targets, friend or foe.",
			"critical": "+30 damage.",
		},
		"Seismic_Toss": 
		{
			"power": 50,
			"style": "Melee",
			"flavor": "User picks the target up and throws it on the ground.",
			"effect": "This does damage equal the user’s strength.",
			"critical": "Target is stunned.",
		},
		"Sky_Uppercut": 
		{
			"power": 70,
			"style": "Melee",
			"flavor": "Shoryuken!",
			"effect": "This deals 50 damage and flying Pokémon are treated as being weak against it. It also allows the user to hit targets flying above the battlefield without any range penalty.",
			"critical": "+30 damage.",
		},
		"Dynamic_Punch": 
		{
			"power": 90,
			"style": "Melee",
			"flavor": "A punch straight to head.",
			"effect": "This deals 60 damage, and the target has a compulsion to acting dazed.",
			"critical": "Target loses 30 mind.",
		},
		"Final_Gambit": 
		{
			"power": 90,
			"style": "Melee",
			"flavor": "User risks it all for one last takedown.",
			"effect": "This deals 180 damage, and the user instantly faints. ",
			"critical": "+30 damage. ",
		},
		"Fists_of_Fury": 
		{
			"power": 90,
			"style": "Melee",
			"flavor": "User barrages its opponent with punches.",
			"effect": "This deals 3d60 damage.",
			"critical": "+1d60 damage.",
		},
		"Focus_Blast": 
		{
			"power": 80,
			"style": "Ranged",
			"flavor": "User channels its chi into an erratic blast.",
			"effect": "This deals 100 damage to the target and all adjacent targets.",
			"critical": "",
		},
		"Flying_Press": 
		{
			"power": 90,
			"style": "Melee",
			"flavor": "User dives down on the target from above.",
			"effect": "This deals 80 damage. Treat it as being either fighting or flying, whichever is of the most benefit to you at the moment.",
			"critical": "+30 damage",
		},
		"One-Armed_Hold": 
		{
			"power": 100,
			"style": "Melee",
			"flavor": "User picks the target up in a one-armed chokehold and carries it around.",
			"effect": "This pins the target for 50 damage a turn, but instead of the user being unable to act, if the Pokémon is light enough to ride it, the user simply carries it around. If the Pokémon has many arms, this deals double damage.",
			"critical": "Pin is harsh.",
		},
		"War_Dance": 
		{
			"power": 80,
			"style": "Melee",
			"flavor": "Like the ancient Maori, the user and allies perform a haka dance.",
			"effect": "This allows the user and all adjacent allies to take an extra dash action next turn, and their next attacks deal double damage.",
			"critical": "",
		},
	},
	"Fire":
	{
		"Ember": 
		{
			"power": 30,
			"style": "Ranged",
			"flavor": "User flings burning embers onto the target.",
			"effect": "This deals 30 damage.",
			"critical": "15 repeating damage.",
		},
		"Flame": 
		{
			"power": 20,
			"style": "Melee",
			"flavor": "User smacks the target with an open flame.",
			"effect": "This deals 20 damage.",
			"critical": "+30 damage.",
		},
		"Thermography": 
		{
			"power": 30,
			"style": "Ranged",
			"flavor": "Heat-sensing pits detect the flow of thermal energy to see prey even in pitch-black conditions.",
			"effect": "Identify a target.",
			"critical": "The target is harshly identified.",
		},
		"Torch": 
		{
			"power": 40,
			"style": "Melee",
			"flavor": "User attacks with a burning fire.",
			"effect": "This deals 40 damage.",
			"critical": "Target takes 15 repeating damage.",
		},
		"Will-O-Wisp": 
		{
			"power": 30,
			"style": "Ranged",
			"flavor": "User shoots a queer ball of fire that burns the target.",
			"effect": "This deals 10 repeating damage to the target and all adjacent targets.",
			"critical": "Repeating damage is harsh.",
		},
		"Brand": 
		{
			"power": 50,
			"style": "Melee",
			"flavor": "User leaves a burn mark on the target that disracts with pain.",
			"effect": "The target burns out all its difficult moves.",
			"critical": "+30 automatic damage.",
		},
		"Burning_Aura": 
		{
			"power": 60,
			"style": "Self",
			"flavor": "The user bursts into flames that singe anyone nearby.",
			"effect": "Anyone who comes adjacent to the user for the rest of combat takes 40 fire damage.",
			"critical": "",
		},
		"Burning_Land": 
		{
			"power": 60,
			"style": "Self",
			"flavor": "The user charges across the land, leaving burning footprints behind.",
			"effect": "Any terrain the user crosses this turn is on fire, dealing 50 fire damage. The user may incorporate this effect into both its dash action and standard action for extra fire.",
			"critical": "",
		},
		"Blaze_Kick": 
		{
			"power": 50,
			"style": "Melee",
			"flavor": "User kicks the target with a burning foot.",
			"effect": "This deals 40 damage and crits on any doubles.",
			"critical": "+30 damage.",
		},
		"Fire_Fang": 
		{
			"power": 60,
			"style": "Melee",
			"flavor": "User bites the target while breathing fire.",
			"effect": "This deals 60 damage.",
			"critical": "Target is stunned.",
		},
		"Fire_Punch": 
		{
			"power": 60,
			"style": "Melee",
			"flavor": "User punches the target with a burning fist.",
			"effect": "The target takes 60 damage.",
			"critical": "Target takes 15 repeating damage.",
		},
		"Flame_Charge": 
		{
			"power": 70,
			"style": "Melee",
			"flavor": "User wreaths itself in flames and charges.",
			"effect": "Move 2 extra spaces and deal 50 damage. ",
			"critical": "+50 damage.",
		},
		"Flame_Wheel": 
		{
			"power": 60,
			"style": "Melee",
			"flavor": "User rolls out, spinning and burning.",
			"effect": "Deal 50 damage to all adjacent targets.",
			"critical": "Targets takes 15 repeating damage.",
		},
		"Flamethrower": 
		{
			"power": 60,
			"style": "Ranged",
			"flavor": "User spews a plume of fire.",
			"effect": "This deals 40 damage to all targets along a line.",
			"critical": "+30 damage.",
		},
		"Flame_Burst": 
		{
			"power": 60,
			"style": "Ranged",
			"flavor": "User shoots an exploding ball of fire.",
			"effect": "This deals 50 damage to the target and all adjacent targets, friend or foe.",
			"critical": "15 repeating damage.",
		},
		"Hazard_Flame": 
		{
			"power": 60,
			"style": "Ranged",
			"flavor": "The user builds up fire until the last second and then shoots it.",
			"effect": "This deals 90 damage to the target and crits on any doubles.",
			"critical": "User takes 90 automatic damage.",
		},
		"Heat_Crash": 
		{
			"power": 60,
			"style": "Melee",
			"flavor": "User crashes into the target while burning.",
			"effect": "This deals the user’s strength in damage.",
			"critical": "Target is stunned.",
		},
		"Heat_Wave": 
		{
			"power": 70,
			"style": "Ranged",
			"flavor": "User burns brightly, scorching everyone in range.",
			"effect": "This deals 60 damage to everyone in range, friend or foe.",
			"critical": "Burn out all the targets’ difficult moves.",
		},
		"Incinerate": 
		{
			"power": 50,
			"style": "Ranged",
			"flavor": "User burns the target and its held item.",
			"effect": "This deals 50 damage and if the target is holding a berry it destroys the berry.",
			"critical": "+20 damage.",
		},
		"Immolate": 
		{
			"power": 70,
			"style": "Melee",
			"flavor": "User bursts into flames and goes straight towards the enemies.",
			"effect": "User takes 60 damage and deals 120 damage to all adjacent targets, friend or foe.",
			"critical": "+30 damage taken, +60 damage dealt.",
			"mark": "Designer's Choice",
		},
		"Lava_Plume": 
		{
			"power": 60,
			"style": "Melee",
			"flavor": "User rides a wave of lava.",
			"effect": "User moves an extra space and deals 40 damage to all adjacent targets, friend or foe.",
			"critical": "+30 damage.",
		},
		"Overheat": 
		{
			"power": 70,
			"style": "Melee",
			"flavor": "User attacks with burning intensity and suffers the consequences.",
			"effect": "This deals 90 damage and the user must burn out one of its difficult moves.",
			"critical": "Burnout is avoided.",
		},
		"Napalm": 
		{
			"power": 60,
			"style": "Ranged",
			"flavor": "User breathes sticky, flaming goo onto the target.",
			"effect": "This deals 40 repeating damage to the target.",
			"critical": "Repeating damage is harsh.",
		},
		"Pyre": 
		{
			"power": 60,
			"style": "Melee",
			"flavor": "User catches on fire and deals extra damage to its foe.",
			"effect": "This deals 100 damage to the target and the user takes 40 automatic damage.",
			"critical": "+30 damage.",
			"mark": "Designer's Choice",
		},
		"Searing_Shot": 
		{
			"power": 50,
			"style": "Ranged",
			"flavor": "User burns everything around the target.",
			"effect": "This deals 40 damage to the target and everything adjacent to the target, friend or foe.",
			"critical": "+30 damage dealt.",
		},
		"Combustion": 
		{
			"power": 50,
			"style": "Ranged",
			"flavor": "User explodes in fiery devastation.",
			"effect": "This deals 100 damage to everyone in range, friend or foe, and the user takes 50 damage.",
			"critical": "+50 damage dealt and +20 damage self-inflicted.",
		},
		"Blastburn": 
		{
			"power": 90,
			"style": "Ranged",
			"flavor": "User hits with all its power.",
			"effect": "This deals 120 damage, but the user must be encouraged before it can use any moves afterward.",
			"critical": "Target takes 15 repeating damage.",
		},
		"Blue_Flare": 
		{
			"power": 80,
			"style": "Ranged",
			"flavor": "User burns an area with glowing blue flame.",
			"effect": "This deals 70 damage to the target and all adjacent targets, friend or foe.",
			"critical": "+30 damage.",
		},
		"Eruption": 
		{
			"power": 80,
			"style": "Ranged",
			"flavor": "User calls up a volcanic explosion.",
			"effect": "The target and all adjacent targets have their HP halved, rounded up. This affects friend and foe.",
			"critical": "",
		},
		"Fire_Blast": 
		{
			"power": 100,
			"style": "Ranged",
			"flavor": "User creates an explosion of fire that bursts out in 5 directions.",
			"effect": "Draw 5 lines going out from the user, going east, north, west, southeast, and southwest (or that same figure rotated by increments of 45 degrees). Every enemy along those lines takes 90 damage.",
			"critical": "Crit: +50 damage.",
		},
		"Firespin": 
		{
			"power": 90,
			"style": "Ranged",
			"flavor": "User shoots a flaming tornado at the target.",
			"effect": "This deals 30 repeating damage and the target is trapped.",
			"critical": "+30 damage.",
		},
		"Firestorm": 
		{
			"power": 100,
			"style": "Ranged",
			"flavor": "User calls down fire from the sky.",
			"effect": "This deals 90 damage to all targets in range.",
			"critical": "15 repeating damage.",
		},
		"Flare_Blitz": 
		{
			"power": 90,
			"style": "Melee",
			"flavor": "User rushes the target and attack.",
			"effect": "Move up to 2 extra spaces and deal 70 damage.",
			"critical": "+30 damage.",
		},
		"Inferno": 
		{
			"power": 100,
			"style": "Ranged",
			"flavor": "User unleashes a massive blast of fiery devastation.",
			"effect": "The target takes 40 damage and 30 repeating damage.",
			"critical": "+30 damage.",
		},
		"Phoenix_Force": 
		{
			"power": 100,
			"style": "Ranged",
			"flavor": "The user bursts into flames, fainting to bring an ally back to fighting fitness.",
			"effect": "Choose a fainted ally in range. Restore that ally to half health. This KO's the user.",
			"critical": "",
		},
		"Sunny_Day": 
		{
			"power": 100,
			"style": "Weather",
			"flavor": "The sun shines down on everyone.",
			"effect": "The heat makes all fire type moves natural except for sunny day itself. All Pokémon lose their weaknesses to water and ice from the heat.",
			"critical": "",
		},
	},
	"Flying":
	{
		"Defog": 
		{
			"power": 40,
			"style": "Weather",
			"flavor": "A strong wind clears away battlefield hazards.",
			"effect": "This clears away all fog in the region. Additionally, it nullifies the effects of attacks that hang in the air, such as stun spore, smokescreen, sand attack, or mist, if they were used since your last turn.",
			"critical": "",
		},
		"Feather_Dance": 
		{
			"power": 20,
			"style": "Melee",
			"flavor": "User coats the target in feathers, softening its blows.",
			"effect": "The target’s next attack deals half damage.",
			"critical": "The status is harsh, meaning it remains until the end of combat. Perhaps this involves tar and feathers.",
		},
		"Gust": 
		{
			"power": 30,
			"style": "Ranged",
			"flavor": "By whipping its wings, the user causes a gust to blow the target over.",
			"effect": "This deals 20 damage and moves the target one space in any direction.",
			"critical": "The target is moved 3 spaces in any direction you wish.",
		},
		"Mirror_Move": 
		{
			"power": 40,
			"style": "Ranged",
			"flavor": "The user observes the target and copies its move.",
			"effect": "Pick any target on the map. Use the last move that it did against it. You cannot use this move and not target the one you were observing unless you are mimicking a self-style move.",
			"critical": "This copies the move, so the crit will be determind by that move.",
		},
		"Peck": 
		{
			"power": 30,
			"style": "Melee",
			"flavor": "A sharp rap from the beak.",
			"effect": "This deals 30 damage.",
			"critical": "+30 damage.",
		},
		"Acrobatics": 
		{
			"power": 50,
			"style": "Melee",
			"flavor": "The user nimbly swoops through the air to make an attack.",
			"effect": "This does 40 damage, 80 if the user isn’t carrying an item.",
			"critical": "+30 damage",
		},
		"Aerial_Ace": 
		{
			"power": 60,
			"style": "Melee",
			"flavor": "By flying with incredible speed, the user hits without fail.",
			"effect": "This does 40 damage and does not miss.",
			"critical": "",
		},
		"Air_Cutter": 
		{
			"power": 50,
			"style": "Ranged",
			"flavor": "The user launches razor-like wind to slash the opponents.",
			"effect": "This deals 30 damage to the target and all adjacent targets.",
			"critical": "+30 damage",
		},
		"Air_Slash": 
		{
			"power": 60,
			"style": "Ranged",
			"flavor": "The user attacks with a slicing blade of air.",
			"effect": "This deals 60 damage.",
			"critical": "Target is stunned",
		},
		"Bounce": 
		{
			"power": 70,
			"style": "Melee",
			"flavor": "The user makes a long, high series of bouncing jumps, soaring over the terrain.",
			"effect": "This move takes two turns. While in use the user is its dash in spaces above the battlefield, ignoring terrain hazards. On the second turn, this deals 120 damage.",
			"critical": "Target is stunned.",
		},
		"Brave_Bird": 
		{
			"power": 70,
			"style": "Melee",
			"flavor": "The user dive-bombs an enemy, doing extreme damage at the cost of its own health.",
			"effect": "This deals 120 damage to the target and the user takes 40 damage even on a miss.",
			"critical": "This deals an extra 60 damage and the user takes 30 more.",
		},
		"Falcon_Punch": 
		{
			"power": 60,
			"style": "Melee",
			"flavor": "User punch the target with avian swiftness.",
			"effect": "This deals the user’s speed in damage.",
			"critical": "+1d60 damage.",
		},
		"Fly": 
		{
			"power": 50,
			"style": "Melee",
			"flavor": "The user soars above the battlefield to swoop down and strike later.",
			"effect": "This allows the user to fly its dash in spaces above the battlefield on the first turn. On the second, it may dash again on its standard action to deal 80 damage. With a proper license, this allows the trainer to fly around the map to places they know already and can navigate to.",
			"critical": "",
		},
		"Flyby": 
		{
			"power": 70,
			"style": "Melee",
			"flavor": "User swoop down, scratches the target with its talons, and keep on going.",
			"effect": "This is move that lets flying pokémon hit and keep moving. They move their dash distance +2, do 40 damage, and then can continue to move any distance they have left to take.",
			"critical": "+30 damage.",
			"mark": "Designer's Choice",
		},
		"Pluck": 
		{
			"power": 50,
			"style": "Melee",
			"flavor": "A quick jab with the beak to mug the target.",
			"effect": "This deals 40 damage and if the target is holding a berry the user immediately eats it and gain the effect.",
			"critical": "+20 damage and the user steals the target’s item regardless of what it is. Any consumables are eaten.",
		},
		"Sky_Drop": 
		{
			"power": 70,
			"style": "Melee",
			"flavor": "The user picks up the target and drops it from the heights.",
			"effect": "On the first turn the user grabs the target. The target is pinned for no damage. While this move is in use the user is flying a number of spaces above the battlefield equal to its dash distance. The user may release the target on any turn after the first. It takes damage equal to the user’s speed.",
			"critical": "+30 damage.",
		},
		"Tailwind": 
		{
			"power": 50,
			"style": "Self",
			"flavor": "The user calls up a beneficial wind to move everyone along.",
			"effect": "User and all adjacent allies get to immediately make a dash. This means an extra dash for the user, since self attacks allow one dash to begin with.",
			"critical": "",
		},
		"Wing_Attack": 
		{
			"power": 50,
			"style": "Melee",
			"flavor": "A strike with imposing wings.",
			"effect": "This deals 50 damage. ",
			"critical": "+30 damage",
		},
		"Aeroblast": 
		{
			"power": 80,
			"style": "Ranged",
			"flavor": "A vortex of air is shot at the target.",
			"effect": "This deals 80 damage.",
			"critical": "User crits on any doubles for the remainder of combat.",
		},
		"Dragon_Ascent": 
		{
			"power": 100,
			"style": "Self",
			"flavor": "User mega evolves without needing to draw power from any stone.",
			"effect": "This move causes the user to mega evolve and immediately be able to take another standard action.",
			"critical": "",
			"opinion": "It is our opinion that this move should be dragon type.",
		},
		"Drill_Peck": 
		{
			"power": 90,
			"style": "Melee",
			"flavor": "The user drills into the target with a sharp beak, as it would to fish insects out of a dense log.",
			"effect": "This deals 90 damage.",
			"critical": "+30 damage.",
		},
		"Hawkeye": 
		{
			"power": 90,
			"style": "Self",
			"flavor": "The user’s perfect eyesight pierces all illusions, sees across all distances, and stares into the very soul of the target.",
			"effect": "Identify any target on the map. If the user is blinded, the target is no longer identified.",
			"critical": "The target is harshly identified.",
		},
		"Hurricane": 
		{
			"power": 100,
			"style": "Ranged",
			"flavor": "Massive winds blow everyone in dizzying circles.",
			"effect": "This deals 90 damage to everyone within range, friend or foe.",
			"critical": "The targets have a compulsion to confusion.",
		},
		"Oblivion_Wing": 
		{
			"power": 90,
			"style": "Melee",
			"flavor": "A wing like the angel of death strikes the opponent.",
			"effect": "This deals 60 damage and on a hit restores half the damage dealt as health to the user.",
			"critical": "+20 damage, with a corresponding increase in healing.",
		},
		"Roost": 
		{
			"power": 80,
			"style": "Self",
			"flavor": "User rests on the ground, restoring its strength.",
			"effect": "This restores 60 health. While on the ground, the user not considered a flying type. User does not get to dash on its next turn.",
			"critical": "",
		},
		"Sky_Attack": 
		{
			"power": 90,
			"style": "Melee",
			"flavor": "User builds up power and dash through the air.",
			"effect": "This deals 140 damage but the user must be encouraged one the previous turn before it can use the move.",
			"critical": "Target is stunned.",
		},
		"Sonic_Wake": 
		{
			"power": 100,
			"style": "Melee",
			"flavor": "The user breaks the sound barrier and leaves an injurous trail of sonic blasts.",
			"effect": "The user must draw a straight line that passes through no fewer than 10 spaces and no more than 10 plus the user’s dash distance. All Pokémon along this path take 20 damage unless they can pass a speed save. If the user’s path runs through terrain it cannot pass through before the first 10 spaces are up, it takes 100 damage from plowing straight into something.",
			"critical": "",
		},
		"Bombing_Run": 
		{
			"power": 100,
			"style": "Ranged",
			"flavor": "The user flies over the battlefield, shooting balls of elemental energy at its foes.",
			"effect": "This move can only be learned by Pokémon who have a type besides flying, and treat this move as if it is that type. Once learned, classify it is a move of whatever type the Pokémon has that isn’t flying. For example, a fire/flying type once it learns this move treats it as a fire move. Move twice the user’s dash distance, flying over any Pokémon in the way. Every Pokémon along the path takes 30 damage of this move’s new type. Yes, even though this is classified as a ranged move, the user can only target enemies directly below it and and it changes locations while using it.",
			"critical": "",
		},
		"Gale_Force": 
		{
			"power": 100,
			"style": "Weather",
			"flavor": "User changes the weather to overpowering, shifting winds.",
			"effect": "Every time your turn comes up, choose a wind direction. Everyone on the map is moved the user's dash in spaces.",
			"critical": "",
		},
	},
	"Ghost":
	{
		"Astonish": 
		{
			"power": 30,
			"style": "Melee",
			"flavor": "User sneaks up and spooks the target.",
			"effect": "This deals 30 damage.",
			"critical": "Target moves 3 spaces in whatever direction the user wishes.",
		},
		"Confuse Ray": 
		{
			"power": 30,
			"style": "Ranged",
			"flavor": "The user terrifies the target with pure fear.",
			"effect": "This causes a compulsion to panic in the target.",
			"critical": "The compulsion is harsh.",
		},
		"Ethereal_Body": 
		{
			"power": 40,
			"style": "Self",
			"flavor": "User moves across the battlefield, straight through solid objects.",
			"effect": "Move 1 extra space this turn, and ignore any terrain you wish to avoid, with the exception of ghostly terrain. This move can be used if the target is pinned or trapped, and it automatically escapes such problems.",
			"critical": "",
		},
		"Ghost_Hand": 
		{
			"power": 40,
			"style": "Melee",
			"flavor": "The user passes its hand right through the target, damaging it from within.",
			"effect": "This deals 50 damage without regard to type multipliers or damage modifiers.",
			"critical": "",
		},
		"Invisibility": 
		{
			"power": 30,
			"style": "Self",
			"flavor": "The user turns transparent.",
			"effect": "The user is now sneaking.",
			"critical": "",
		},
		"Lick": 
		{
			"power": 40,
			"style": "Melee",
			"flavor": "The user creeps the enemy out by licking it suddenly.",
			"effect": "This stuns the target and deals 10 damage.",
			"critical": "The stun is harsh.",
		},
		"Losers_Pain": 
		{
			"power": 30,
			"style": "Ranged",
			"flavor": "The user calls up the energy of the defeated and hurls it at a target.",
			"effect": "This deals damage equal to 10 times the number of Pokémon fainted this fight.",
			"critical": "The target loses 30 mind. ",
		},
		"Spite": 
		{
			"power": 20,
			"style": "Ranged",
			"flavor": "Ghostly anger prevents a foe from using an attack.",
			"effect": "Burn out one of the target's moves of your choice.",
			"critical": "",
		},
		"Trick-or-Treat": 
		{
			"power": 30,
			"style": "Melee",
			"flavor": "The user decides to celebrate Halloween early.",
			"effect": "The target’s second type is changed to ghost, and if it is holding a berry it gives it to the user.",
			"critical": "Trick! Move the target 3 spaces in any direction you wish. If it is actually Halloween, this move automatically crits.",
		},
		"Destiny_Bond": 
		{
			"power": 60,
			"style": "Ranged",
			"flavor": "User tethers its spirit to the target’s.",
			"effect": "If the user faints before the start of its next turn, so does the target, and vice versa.",
			"critical": "The user will not faint if the target does.",
		},
		"Hex": 
		{
			"power": 50,
			"style": "Ranged",
			"flavor": "User takes advantage of its target’s misfortune.",
			"effect": "This deals 30 damage, with 20 additional damage for each negative status effect the target has. ",
			"critical": "All the target’s status effects become harsh.",
		},
		"Light_Spirit": 
		{
			"power": 50,
			"style": "Self",
			"flavor": "User frees itself from the concerns of this world.",
			"effect": "For the remainder of combat, increase the user’s dash by 2. It is never too heavy to ride a Pokémon.",
			"critical": "",
		},
		"Memories of the Departed": 
		{
			"power": 70,
			"style": "Self",
			"flavor": "The user picks up some of the experiences of the fainted.",
			"effect": "If a target fainted since the user’s last turn, the user trains its mind stat.",
			"critical": "",
			"out_of_battle": "This move allows the user and trainer to have recollections of what happened in the past, usually used on an item or location.",
		},
		"Night_Shade": 
		{
			"power": 60,
			"style": "Melee",
			"flavor": "The target sees terrifying visions and begins to hurt itself in blind panic.",
			"effect": "The target takes automatic damage equal to its strength, unchanged by type differences or damage modifiers. ",
			"critical": "The target takes a compulsion to confusion.",
		},
		"Nightmare": 
		{
			"power": 50,
			"style": "Ranged",
			"flavor": "The user reaches into the target’s dreams and turns them to horrors.",
			"effect": "The target takes 50 repeating damage until it is awake, and this repeating damage won't help the user wake up. Using Dream Eater on the target transfers the effect to the one who ate the poisoned dream.",
			"critical": "+30 immediate damage.",
		},
		"Overshadow": 
		{
			"power": 60,
			"style": "Melee",
			"flavor": "The spirit tries to wrest control of the target’s body.",
			"effect": "The target is pinned for 60 damage.",
			"critical": "+30 immediate damage. If used against a psychic Pokemon it instead is possessed and has a compulsion to obey your every command.",
		},
		"Phantasm": 
		{
			"power": 60,
			"style": "Ranged",
			"flavor": "User creates illusions and disappears in them.",
			"effect": "The user is sneaking and all targets in range take a compulsion to insanity.",
			"critical": "Allies avoid the compulsion.",
		},
		"Phantom_Force": 
		{
			"power": 70,
			"style": "Melee",
			"flavor": "User turns invisible and reappears to strike an unblockable attack.",
			"effect": "On the first turn, the user is sneaking. On the second turn, it reappears and deals 100 damage. This move does not miss.",
			"critical": "",
		},
		"Shadow_Ball": 
		{
			"power": 60,
			"style": "Ranged",
			"flavor": "User shoots a ball of ghostly energy at the target.",
			"effect": "This deals 50 damage to the target and all adjacent targets.",
			"critical": "+30 damage.",
		},
		"Shadow_Claw": 
		{
			"power": 70,
			"style": "Melee",
			"flavor": "User strikes with ghostly fingers.",
			"effect": "This deals 50 damage and crits on any doubles.",
			"critical": "+30 damage. ",
		},
		"Shadow_Punch": 
		{
			"power": 60,
			"style": "Melee",
			"flavor": "You can't block a ghostly hand.",
			"effect": "This deals 40 damage and does not miss.",
			"critical": "",
		},
		"Shadow_Sneak": 
		{
			"power": 70,
			"style": "Ranged",
			"flavor": "The user projects its shadow right behind the target and attacks it from behind.",
			"effect": "This deals 30 damage, and has a range of 3 extra spaces. It does not miss.",
			"critical": "",
		},
		"Haunt": 
		{
			"power": 90,
			"style": "Ranged",
			"flavor": "The user’s revenge lingers even after the user is gone.",
			"effect": "If the user knows this move, it may use it on the turn after it is fainted. Choose a target in range of where the user was fainted. This deals 50 damage.",
			"critical": "The target takes 10 repeating damage which only ends if the user is revived. ",
		},
		"Ominous_Wind": 
		{
			"power": 100,
			"style": "Weather",
			"flavor": "A dark, foreboding wind sweeps dense miasma across the land.",
			"effect": "All ghost and dark Pokemon are sneaking, and all pysychic Pokemon take a compulsion to insanity from the horrible aura.",
			"critical": "This move does 30 ghost damage to all Pokemon.",
		},
		"Reaper_Scythe": 
		{
			"power": 100,
			"style": "Melee",
			"flavor": "The user channels a bit of the defeated spirit of every Pokémon it’s taken down into one attack.",
			"effect": "This deals 20 damage for every Pokémon the user has fainted since it learned the attack, but never more than the combined strength and mind scores of the user.",
			"critical": "The target is KO’d instantly.",
		},
		"Shadow_Devastation": 
		{
			"power": 90,
			"style": "Ranged",
			"flavor": "The user unleashes its ghostly wrath.",
			"effect": "This deals 90 damage.",
			"critical": "The target cannot crit for the remainder of combat.",
		},
		"Shadow_Force": 
		{
			"power": 100,
			"style": "Melee",
			"flavor": "User turns into shadow and then disappear, reappearing from thin air to strike. ",
			"effect": "On the first turn, the user is sneaking. On the second turn, the user deals 130 damage. This move does not miss or crit. ",
			"critical": "",
		},
		"Unhallowed_Ground": 
		{
			"power": 90,
			"style": "Ranged",
			"flavor": "User calls forth ghostly allies from those that have died nearby.",
			"effect": "This deals 90 damage to all targets in range, friend or foe. It does not affect flying types.",
			"critical": "Targets are moved 3 spaces in blind panic.",
		},
		"Vengeful_Spirits": 
		{
			"power": 100,
			"style": "Ranged",
			"flavor": "The user calls up the spirits of the defeated to avenge themselves.",
			"effect": "Choose a target in range. Every fainted allied Pokemon gets to make a natural attack against the target as if the fainted Pokémon were still active on the field. This attack has no chance to miss or crit, but the attacks of the fainted roll individually for that.",
			"critical": "",
		},
	},
	"Grass":
	{
		"Absorb": 
		{
			"power": 30,
			"style": "Melee",
			"flavor": "User sucks nutrients from the target.",
			"effect": "This deals 20 damage, and if it hits the user heals half the damage dealt.",
			"critical": "+20 damage with increased healing. ",
		},
		"Forest_Curse": 
		{
			"power": 30,
			"style": "Ranged",
			"flavor": "User turns the target’s flesh into dry twigs.",
			"effect": "The target is now weak against fire.",
			"critical": "Target is stunned.",
		},
		"Graft": 
		{
			"power": 30,
			"style": "Self",
			"flavor": "The user plucks a berry from its branches to eat.",
			"effect": "This move causes the user to ripen an otherwise inedible berry on its branches, for it or an adjacent ally to eat as a free action.",
			"critical": "",
			"out_of_battle": "Once per session do one of two things. 1) You may graft a berry branch onto the Pokémon. 2) If you don’t do #1, you may instead pick one berry from the Pokémon.",
		},
		"Grass_Whistle": 
		{
			"power": 30,
			"style": "Ranged",
			"flavor": "User blows rhythmically on a grass flute, lulling a target to sleep.",
			"effect": "This inflicts sleep.",
			"critical": "Sleep is harsh.",
		},
		"Ingrain": 
		{
			"power": 40,
			"style": "Self",
			"flavor": "User roots itself to the ground.",
			"effect": "The user is trapped, but instead of rolling to save, it ends the effect at the end of its turn when it wishes. As long as the user is trapped, it has double range and regenerates 20 health per turn.",
			"critical": "",
		},
		"Herbal_Remedy": 
		{
			"power": 20,
			"style": "Melee",
			"flavor": "The user provides an ally with an herb that cures all maladies.",
			"effect": "An ally has all negative statuses cured, though it loses a friendship point.",
			"critical": "",
			"out_of_battle": "Once per session you may pick and preserve an herbal remedy that has the same effect.",		
		},
		"Stun_Spore": 
		{
			"power": 40,
			"style": "Ranged",
			"flavor": "User release a cloud of paralyzing spores.",
			"effect": "Inflicts stun on every target in range, friend or foe.",
			"critical": "Stun is harsh.",
		},
		"Uproot": 
		{
			"power": 30,
			"style": "Self",
			"flavor": "User picks up its roots, moving quicker but cutting itself off from nutrients.",
			"effect": "The user takes an extra dash action each turn, but takes 10 repeating damage.",
			"critical": "",
		},
		"Worry_Seed": 
		{
			"power": 20,
			"style": "Ranged",
			"flavor": "User plants a seed on an ally, bugging it a bit.",
			"effect": "The target is immune to sleep for the remainder of combat.",
			"critical": "",
		},
		"Aromatherapy": 
		{
			"power": 40,
			"style": "Ranged",
			"flavor": "User releases pleasant smells into the area.",
			"effect": "This cures all negative status effects on the user and all Pokémon in range, friend or foe.",
			"critical": "",
		},
		"Bullet_Seed": 
		{
			"power": 60,
			"style": "Ranged",
			"flavor": "User fires a stream of seed bullets.",
			"effect": "This deals 2d60 of damage.",
			"critical": "+1d60 damage.",
		},
		"Coffee_Seed": 
		{
			"power": 50,
			"style": "Melee",
			"flavor": "The user gives an ally one of its seeds, containing high amounts of caffeine.",
			"effect": "The target gets an extra dash action each turn.",
			"critical": "",
		},
		"Cotton_Guard": 
		{
			"power": 60,
			"style": "Self",
			"flavor": "User wraps itself in protective cotton.",
			"effect": "The user takes 30 less damage from all attacks.",
			"critical": "",
		},
		"Energy_Ball": 
		{
			"power": 70,
			"style": "Ranged",
			"flavor": "User absorbs nature’s energy and fires it at the target.",
			"effect": "The target and all adjacent targets take 60 damage.",
			"critical": "All targets are forced to burn out a move of their choice that isn't already burnt out.",
		},
		"Grass_Knot": 
		{
			"power": 50,
			"style": "Ranged",
			"flavor": "User grows grass to trip the target and make it fall.",
			"effect": "This deals the target’s strength in damage.",
			"critical": "Target is trapped.",
		},
		"Healing_Herb": 
		{
			"power": 70,
			"style": "Melee",
			"flavor": "The user allows an ally to munch on one of its healing herb tendrils.",
			"effect": "The user takes 20 damage and the ally heals 70 health. The bitter taste costs the ally a friendship point.",
			"critical": "",
			"out_of_battle": "Once per session you may pick and preserve an herb that heals 70 health and costs the eater a friendship point."
		},
		"Leaf_Blade": 
		{
			"power": 60,
			"style": "Melee",
			"flavor": "User slashes an enemy with a razor-sharp leaf.",
			"effect": "This deals 40 damage and crits on any doubles.",
			"critical": "+30 damage.",
		},
		"Leaf_Storm": 
		{
			"power": 70,
			"style": "Ranged",
			"flavor": "User fires leaves in every direction until its willpower is spent.",
			"effect": "This deals 120 damage but burns out all the user’s difficult moves.",
			"critical": "+30 damage.",
		},
		"Leaf_Tornado": 
		{
			"power": 60,
			"style": "Ranged",
			"flavor": "User binds the target in a storm of razor-sharp leaves.",
			"effect": "This deals 60 damage.",
			"critical": "Target is trapped.",
		},
		"Leech_Seed": 
		{
			"power": 60,
			"style": "Ranged",
			"flavor": "User plants seedlings on the target that siphon health for it.",
			"effect": "The target takes 20 repeating damage and user immediately recovers all damage inflicted as health.",
			"critical": "Repeating damage is harsh.",
		},
		"Magical_Leaf": 
		{
			"power": 60,
			"style": "Ranged",
			"flavor": "User shoots a leaf on enchanted winds, going straight toward the target.",
			"effect": "The targets takes 40 damage. This attack does not miss.",
			"critical": "",
		},
		"Mega_Drain": 
		{
			"power": 60,
			"style": "Melee",
			"flavor": "User sucks nutrients from the target.",
			"effect": "This deals 40 damage, and if it hits the user heals half the damage dealt.",
			"critical": "+20 damage with extra healing.",
		},
		"Needle Arm": 
		{
			"power": 60,
			"style": "Melee",
			"flavor": "User wraps the target in thorny arms.",
			"effect": "This pins the target for 60 damage.",
			"critical": "The pin is harsh.",
		},
		"Overgrowth": 
		{
			"power": 40,
			"style": "Ranged",
			"flavor": "The user changes the plants in the area.",
			"effect": "Mark 6 spaces on the map with the same type of plant. These spaces are hazardous grass terrain which deals 20 repeating damage or 1d60 grass damage, chosen when you grow the plants. This move fails on places where plants cannot grow, such as indoors on a steel floor.",
			"critical": "+3 spaces of growth.",
			"out_of_battle": "This can cause the local vegetation to grow much more quickly or produce fruit/flowers/seeds out of season.",
		},
		"Poison_Thorns": 
		{
			"power": 70,
			"style": "Melee",
			"flavor": "User smacks the target with poisonous thorns.",
			"effect": "The target takes 30 damage and 20 repeating damage.",
			"critical": "+30 damage.",
		},
		"Razor_Leaf": 
		{
			"power": 60,
			"style": "Ranged",
			"flavor": "User shoots sharpened leaves that tear up a foe.",
			"effect": "The target takes 60 damage.",
			"critical": "+30 damage.",
		},
		"Seed_Bomb": 
		{
			"power": 70,
			"style": "Ranged",
			"flavor": "User drops an exploding seed on its target.",
			"effect": "This deals 60 damage to the target and all adjacent targets.",
			"critical": "Move the targets 3 spaces in a direction of your choice.",
		},
		"Spiky_Shield": 
		{
			"power": 60,
			"style": "Self",
			"flavor": "User surrounds itself in thick, tough thorns.",
			"effect": "Anyone who hits the user with a melee attack takes 30 damage. This lasts the remainder of combat.",
			"critical": "",
		},
		"Sleep_Powder": 
		{
			"power": 60,
			"style": "Ranged",
			"flavor": "User releases a narcotic powder that causes others to fall asleep.",
			"effect": "Inflicts sleep on every target in range, friend or foe. This move does not miss.",
			"critical": "",
		},
		"Spore": 
		{
			"power": 60,
			"style": "Ranged",
			"flavor": "User releases a barrage of spores that paralyze the targets.",
			"effect": "This inflicts stun on the target and all adjacent targets. This move does not miss.",
			"critical": "",
		},
		"Vine_Whip": 
		{
			"power": 70,
			"style": "Ranged",
			"flavor": "User whips the target with vines.",
			"effect": "The target takes 70 damage.",
			"critical": "Target is trapped.",
		},
		"Frenzy_Plant": 
		{
			"power": 90,
			"style": "Melee",
			"flavor": "User knocks a tree onto the target.",
			"effect": "This deals 120 damage. The user cannot make use of any moves until it is encouraged.",
			"critical": "Stun is harsh.",
		},
		"Giga_Drain": 
		{
			"power": 90,
			"style": "Melee",
			"flavor": "User sucks great amounts of nutrients from the target.",
			"effect": "This deals 60 damage and if it hits the user regains half the damage dealt as HP.",
			"critical": "+20 damage with more healing.",
		},
		"Petal_Dance": 
		{
			"power": 80,
			"style": "Ranged",
			"flavor": "User surrounds itself with 10,000 cherry blossoms.",
			"effect": "This deals 40 damage to every target in range and blinds them.",
			"critical": "+30 damage.",
		},
		"Power_Whip": 
		{
			"power": 90,
			"style": "Ranged",
			"flavor": "User harshly beats the target with vines.",
			"effect": "This deals 90 damage to the target.",
			"critical": "Target is trapped.",
		},
		"Seed_Flare": 
		{
			"power": 100,
			"style": "Ranged",
			"flavor": "User shoots a seed that explodes with power and blinding light.",
			"effect": "This deals 60 damage to the target and all adjacent target, and they are blinded.",
			"critical": "+30 damage.",
		},
		"Solar_Beam": 
		{
			"power": 100,
			"style": "Ranged",
			"flavor": "User absorbs sunlight and fires it with horrific power.",
			"effect": "This deals 100 damage to every target along a line. It requires the user to be encouraged before use. Additionally, the power is affected by the weather conditions: Normal Day: no change Night: -30 damage Bad Weather: -30 damage (stacks with nighttime) Sunny Day: +60 damage",
			"critical": "+30 damage.",
		},
		"Synthesis": 
		{
			"power": 90,
			"style": "Self",
			"flavor": "User absorbs sunlight to heal.",
			"effect": "Restore 60 health.",
			"critical": "",
		},
		"Wood_Hammer": 
		{
			"power": 80,
			"style": "Melee",
			"flavor": "User slams its target with oaken might.",
			"effect": "This deals 120 damage, but the user takes 40 damage.",
			"critical": "Target is stunned.",
		},
	},
	"Ground":
	{
		"Dig_Grave": 
		{
			"power": 30,
			"style": "Ranged",
			"flavor": "User digs a grave and points meaningfully at the target.",
			"effect": "The target is now weak against ghost moves.",
			"critical": "Target takes a compulsion to overwhelming fear.",
		},
		"Dirt_Clod": 
		{
			"power": 20,
			"style": "Ranged",
			"flavor": "User throws a chunk of dirt.",
			"effect": "This deals 20 damage.",
			"critical": "Target is blinded.",
		},
		"Dust_Cloud": 
		{
			"power": 40,
			"style": "Ranged",
			"flavor": "User kicks up dust into the air.",
			"effect": "All adjacent targets, friend or foe, are blinded.",
			"critical": "Blinding is harsh.",
		},
		"Magnitude": 
		{
			"power": 40,
			"style": "Ranged",
			"flavor": "An upredictable quake.",
			"effect": "This deals 1d60 damage to all targets in range.",
			"critical": "+1d60 damage. ",
		},
		"Sand_Attack": 
		{
			"power": 30,
			"style": "Ranged",
			"flavor": "User sprays dirt in the target’s face.",
			"effect": "The target is blinded.",
			"critical": "The blinding is harsh.",
		},
		"Quicksand": 
		{
			"power": 40,
			"style": "Ranged",
			"flavor": "The ground nearby is turned soft and mushy.",
			"effect": "This causes everyone on the ground and within range, friend or foe, to be trapped. Foes in water or the air are unaffected.",
			"critical": "The trap is harsh.",
		},
		"Bone_Club": 
		{
			"power": 60,
			"style": "Melee",
			"flavor": "User whacks the target with a femur.",
			"effect": "This deals 60 damage.",
			"critical": "Target is stunned.",
		},
		"Bonemerang": 
		{
			"power": 60,
			"style": "Ranged",
			"flavor": "Users throw a bone at a foe.",
			"effect": "This deals 40 damage on this turn, and to a target within range next turn. User can’t use a bone-related attack until the projectile returns.",
			"critical": "Roll a crit for both attacks. Each crit does +30 damage. ",
		},
		"Dig": 
		{
			"power": 50,
			"style": "Melee",
			"flavor": "The Pokémon burrows underground and then comes up for a surprise attack.",
			"effect": "This takes 2 turns. On the first turn, the Pokémon goes underground, and cannot be hit except by ranged ground moves and anyone else underground using dig. On the second turn, this does 100 damage.",
			"critical": "Target is trapped.",
		},
		"Entrench": 
		{
			"power": 70,
			"style": "Self",
			"flavor": "User burrows into the ground for protection.",
			"effect": "The user is trapped and instead of rolling a save, may end the trap at will, losing all benefits of this move at that time. Until such time, the user takes half damage from all attacks.",
			"critical": "",
		},
		"Mud_Bomb": 
		{
			"power": 60,
			"style": "Ranged",
			"flavor": "User throws a lump of mud at the target.",
			"effect": "This deals 50 damage to the target and all adjacent targets, friend or foe.",
			"critical": "Targets are blinded.",
		},
		"Mud_Shot": 
		{
			"power": 50,
			"style": "Ranged",
			"flavor": "User covers the target in heavy mud.",
			"effect": "This deals 30 damage to the target and it loses its next dash action.",
			"critical": "+30 damage.",
		},
		"Mudslide": 
		{
			"power": 70,
			"style": "Self",
			"flavor": "The earth beneath the user begins to flow, moving it forward.",
			"effect": "This deals 40 damage to all adjacent targets and the user moves 2 extra spaces.",
			"critical": "Targets are trapped.",
		},
		"Sand_Tomb": 
		{
			"power": 60,
			"style": "Ranged",
			"flavor": "User trap the target in a whirling dust devil.",
			"effect": "The target takes 20 repeating damage and is trapped. Getting free of the trap gets rid of the repeating damage.",
			"critical": "Trap and repeating damage are both harsh.",
		},
		"Sinkhole": 
		{
			"power": 60,
			"style": "Ranged",
			"flavor": "User traps the target in a pit that suddenly collapses.",
			"effect": "The target takes 30 damage and is trapped.",
			"critical": "+30 damage.",
		},
		"Spikes": 
		{
			"power": 60,
			"style": "Ranged",
			"flavor": "User pushes spiky protrusions out of the ground.",
			"effect": "Mark all spaces in range that have no obstacles already as having spikes on them. Any Pokémon that steps on those spaces takes 30 ground damage for each space they step on.",
			"critical": "This move does not crit.",
		},
		"Bone_Rush": 
		{
			"power": 90,
			"style": "Melee",
			"flavor": "User runs up the target and whacks it repeatedly with a femur.",
			"effect": "This deals 3d60 damage.",
			"critical": "+1d60 damage.",
		},
		"Bulldoze": 
		{
			"power": 80,
			"style": "Melee",
			"flavor": "The user grinds everything in its path into the dirt.",
			"effect": "As the user dashes, it ignores any terrain, moving even over enemy Pokémon. This leaves a trail of ordinary terrain, that no Pokémon has difficulty crossing. Every Pokémon in the user’s path takes 30 damage. This effect can be incorporated into the user’s dash action as well as its standard action to create even more terrain transformation. And yes, the user can bulldoze straight through water to create a dike on both sides.",
			"critical": "+3 spaces of movement.",
		},
		"Drill_Run": 
		{
			"power": 90,
			"style": "Melee",
			"flavor": "User drill into an opponent.",
			"effect": "This deals 70 damage and crits on any doubles.",
			"critical": "+30 damage.",
		},
		"Earth_Power": 
		{
			"power": 90,
			"style": "Melee",
			"flavor": "User ruptures the nearby earth.",
			"effect": "Every adjacent target, friend or foe, takes 80 damage.",
			"critical": "+30 damage.",
		},
		"Earthquake": 
		{
			"power": 100,
			"style": "Ranged",
			"flavor": "The ground shatters as shockwaves course in all directions.",
			"effect": "Every target in range, friend or foe, takes 90 damage.",
			"critical": "Targets are trapped.",
		},
		"Fissure": 
		{
			"power": 100,
			"style": "Ranged",
			"flavor": "A crack opens up in the ground to swallow the target whole.",
			"effect": "The target gets to make 2 saves against this attack. If it fails both, it is KO’d.",
			"critical": "Target only gets one chance to save.",
		},
		"Thousand_Arrows": 
		{
			"power": 80,
			"style": "Ranged",
			"flavor": "User channel the power of the earth into bolts of dirt.",
			"effect": "This deals 60 damage and hits flying Pokémon for full damage, and also leaves them trapped on the ground.",
			"critical": "+30 damage.",
		},
	},
	"Ice":
	{
		"Haze": 
		{
			"power": 30,
			"style": "Ranged",
			"flavor": "User calls up a haze that puts everyone on an equal footing.",
			"effect": "All Pokémon in range have all statuses removed, whether beneficial or harmful.",
			"critical": "Your allies an choose not to lose certain statuses.",
		},
		"Icy_Grip": 
		{
			"power": 30,
			"style": "Melee",
			"flavor": "User latches on with frozen hands.",
			"effect": "This pins the target for 30 damage.",
			"critical": "+30 immediate damage.",
		},
		"Mist": 
		{
			"power": 40,
			"style": "Melee",
			"flavor": "User conjures protective mist to keep it healthy.",
			"effect": "User and all adjacent allies are immune to the next status effect that hits each.",
			"critical": "",
		},
		"Powder_Snow": 
		{
			"power": 20,
			"style": "Ranged",
			"flavor": "User throws snow over the target.",
			"effect": "This deals 20 damage.",
			"critical": "Stun the target.",
		},
		"Snowball": 
		{
			"power": 30,
			"style": "Ranged",
			"flavor": "User throws some snow at the target.",
			"effect": "This deals 30 damage.",
			"critical": "Crit: +30 damage.",
		},
		"Aurora_Beam": 
		{
			"power": 60,
			"style": "Ranged",
			"flavor": "User fires a colorful blast that chills the target.",
			"effect": "This deals 40 damage to all targets along a line.",
			"critical": "The targets have all difficult moves burnt out.",
		},
		"Avalanche": 
		{
			"power": 60,
			"style": "Melee",
			"flavor": "User rides a wave of frozen debris.",
			"effect": "This deals 50 damage to all adjacent targets, friend or foe.",
			"critical": "Targets are trapped.",
		},
		"Freeze_Dry": 
		{
			"power": 60,
			"style": "Ranged",
			"flavor": "User freezes the target and saps the moisture from it.",
			"effect": "This deals 50 damage and is super effective against water types.",
			"critical": "+30 damage.",
		},
		"Frost_Breath": 
		{
			"power": 50,
			"style": "Ranged",
			"flavor": "User breathes out frigid air from its lungs.",
			"effect": "This deals 70 damage and does not crit.",
			"critical": "",
		},
		"Frozen_Armor": 
		{
			"power": 70,
			"style": "Self",
			"flavor": "The user coats itself in layers of ice that protect against damage.",
			"effect": "The user gains 30 HP, even if this puts it above its max HP. While this extra HP is in place, the user is immune to status effects.",
			"critical": "",
		},
		"Ice_Punch": 
		{
			"power": 60,
			"style": "Melee",
			"flavor": "User pummels the target with frozen energy.",
			"effect": "This deals 60 damage.",
			"critical": "Target is trapped.",
		},
		"Ice_Fang": 
		{
			"power": 60,
			"style": "Melee",
			"flavor": "User bites the target with frigid fangs.",
			"effect": "This deals 30 damage and stuns the target.",
			"critical": "+30 damage.",
		},
		"Ice_Shard": 
		{
			"power": 60,
			"style": "Ranged",
			"flavor": "User chucks a fragment of ice as far as it can.",
			"effect": "This deals 30 damage and has +3 range.",
			"critical": "+30 damage.",
		},
		"Icicle_Spear": 
		{
			"power": 60,
			"style": "Ranged",
			"flavor": "User throws an icicle that splits into jagged shards.",
			"effect": "This deals 2d60 damage.",
			"critical": "+1d60 damage.",
		},
		"Blizzard": 
		{
			"power": 100,
			"style": "Ranged",
			"flavor": "User coats the area in a devastating snowstorm.",
			"effect": "This deals 90 damage to all targets within range, friend or foe.",
			"critical": "The targets are trapped.",
		},
		"Freeze_Shock": 
		{
			"power": 100,
			"style": "Ranged",
			"flavor": "User charges up and unleash wintry doom.",
			"effect": "This deals 150 damage, but the user needs to be encouraged before using it.",
			"critical": "+30 damage.",
		},
		"Glaciate": 
		{
			"power": 90,
			"style": "Ranged",
			"flavor": "User creates a glacier that binds ice around the target.",
			"effect": "This deals 50 damage to the target and all adjacent targets and traps them.",
			"critical": "+30 damage. ",
		},
		"Hail": 
		{
			"power": 100,
			"style": "Weather",
			"flavor": "Shards of ice fall from the sky.",
			"effect": "This deals 1d60 damage to all targets on the field except those that resist ice damage.",
			"critical": "",
		},
		"Ice_Beam": 
		{
			"power": 90,
			"style": "Ranged",
			"flavor": "User strikes the target with a beam that saps its heat.",
			"effect": "This deals 60 damage to every target along a line.",
			"critical": "Target is trapped.",
		},
		"Ice_Burn": 
		{
			"power": 80,
			"style": "Ranged",
			"flavor": "User leaves the target with frostbite.",
			"effect": "This deals 80 damage.",
			"critical": "Target takes 15 repeating damage.",
		},
		"Let_It_Go": 
		{
			"power": 100,
			"style": "Self",
			"flavor": "User cools its body and give in to its desires, growing in power.",
			"effect": "The user restores the use of all its burnt out moves except this one and its next attack does double damage.",
			"critical": "",
		},
		"Sheer_Cold": 
		{
			"power": 100,
			"style": "Ranged",
			"flavor": "User reduces the target’s temperature to absolute 0.",
			"effect": "The target gets 2 speed saves against this. If it fails both, it is instantly KO’d. ",
			"critical": "The target only gets one save.",
		},
	},
	"Normal":
	{
		"Acupressure": 
		{
			"power": 50,
			"style": "Melee",
			"flavor": "User presses on an ally's pressure points to increase its vitality.",
			"effect": "The target's next attack does 60 extra damage.",
			"critical": "",
		},
		"Attract": 
		{
			"power": 40,
			"style": "Ranged",
			"flavor": "Romantic savvy charms the target.",
			"effect": "This causes a compulsion to charm the target into helping the user and attacking anyone who is a threat to it. This only affects opposite-gendered Pokémon, but if the target is in the same egg group as the user, the effect is harsh even if the target would be resistant or immune to normal attacks. A Pokémon that knows this move rolls an extra die to determine if breeding is successful, taking the highest die.",
			"critical": "The effect is harsh if used on opposite-gendered Pokémon and will now affect a same-gendered Pokemon.",
		},
		"Bind":
		{
			"power": 30,
			"style": "Melee",
			"flavor": "User wraps itself around the target and starts squeezing.",
			"effect": "Pin the target for 30 damage.",
			"critical": "The pin is harsh.",
		},
		"Copycat":
		{
			"power": 30,
			"style": "Self",
			"flavor": "User replicates a move.",
			"effect": "Use the same move as the last Pokemon did.",
			"critical": "",
		},
		"Defense_Curl":
		{
			"power": 40,
			"style": "Self",
			"flavor": "The user rolls up into a ball for protection.",
			"effect": "The user takes 20 less damage from all attacks for the remainder of combat.",
			"critical": "",
		},
		"Disable":
		{
			"power": 20,
			"style": "Ranged",
			"flavor": "The user hexes a target into temporary forgetfulness.",
			"effect": "This burns out a move you know the target has, perhaps one it has already used.",
			"critical": "Target is stunned.",
		},
		"Encode":
		{
			"power": 60,
			"style": "Self",
			"flavor": "The user erects a barrier that reduces moves to their constituent code.",
			"effect": "Until the beginning of the user's next turn, if it is hit by a move it can make a mind save instead of the usual save to dodge attacks. If it succeeds, it creates a disk with the move's data on it.",
			"critical": "",
		},
		"Encore":
		{
			"power": 30,
			"style": "Ranged",
			"flavor": "The user claps and applauds, compelling its target to keep using the same move.",
			"effect": "This acts as a compulsion for the target to repeat the same move every turn. If the move was a difficult one for the Pokémon, it takes 30 damage every time it uses that move.",
			"critical": "The status is harsh.",
		},
		"Endure":
		{
			"power": 40,
			"style": "Self",
			"flavor": "I will survive. I will survive!",
			"effect": "If the user is KO'd, its remains on the field with 10 HP left. The user cannot use this two turns in a row.",
			"critical": "",
		},
		"Flail": 
		{
			"power": 40,
			"style": "Ranged",
			"flavor": "User thrashes about aimlessly in its pain.",
			"effect": "This deals damage equal to half the HP the user has lost.",
			"critical": "Now deals damage equal to total HP the user has lost.",
		},
		"Flash": 
		{
			"power": 40,
			"style": "Ranged",
			"flavor": "The Pokemon blinds everyone nearby with blinding light.",
			"effect": "Everyone in range is blinded.",
			"critical": "Blindness is harsh",
			"out_of_battle": "This lights up the area and causes the Pokemon to glow for an hour or so."
		},
		"Focus_Energy": 
		{
			"power": 30,
			"style": "Self",
			"flavor": "User concentrates its power.",
			"effect": "For the remainder of the fight the user crits on any doubles.",
			"critical": "",
		},
		"Fury_Attack": 
		{
			"power": 30,
			"style": "Melee",
			"flavor": "The user attacks with uncontrolled rage.",
			"effect": "This deals 1d60 damage.",
			"critical": "Deals an extra 1d60 damage.",
		},
		"Growl": 
		{
			"power": 20,
			"style": "Ranged",
			"flavor": "A sharp growl causes the target to jump back.",
			"effect": "Move the target 2 spaces.",
			"critical": "The target takes a compulsion to stay away from the user.",
		},
		"Harden": 
		{
			"power": 20,
			"style": "Self",
			"flavor": "User hardens its protective coating.",
			"effect": "This allows the user to use strength saves when dodging.",
			"critical": "",
		},
		"Lock_On": 
		{
			"power": 30,
			"style": "Ranged",
			"flavor": "User focuses on the target.",
			"effect": "The user's next attack against the target will not miss, regardless of circumstances, even if it is out of range.",
			"critical": "The user's next attack against the target automatically crits.",
		},	
		"Scratch": 
		{
			"power": 20,
			"style": "Melee",
			"flavor": "A light attack with claws.",
			"effect": "This deals 20 damage.",
			"critical": "15 repeating damage.",
		},
		"Sentry": 
		{
			"power": 40,
			"style": "Self",
			"flavor": "The user prepares to attack unwary foes.",
			"effect": "The user gains the vigilant ability.",
			"critical": "",
			"mark": "Designer's Choice."
		},
		"Sharpen": 
		{
			"power": 30,
			"style": "Self",
			"flavor": "The user gets sharper while making that “shwing” sound.",
			"effect": "The user’s next attack does 30 extra damage.",
			"critical": "",
		},
		"Sing": 
		{
			"power": 40,
			"style": "Ranged",
			"flavor": "The hypnotic song lulls everyone nearby into a slumber.",
			"effect": "This inflicts sleep on everyone in range, friend or foe.",
			"critical": "Sleep is harsh.",
		},
		"Sleep_Talk": 
		{
			"power": 20,
			"style": "?",
			"flavor": "User talks in its sleep and then suddenly use a move at random.",
			"effect": "Roll a d6. On a 1, the Pokemon uses its first move, on a 2 the second, and so on. If sleep talk itself is picked, choose another move of your choice.",
			"critical": "Only roll for a crit on the chosen move.",
		},
		"Sleepwalk": 
		{
			"power": 30,
			"style": "Melee",
			"flavor": "The user moves about in its sleep, fighting its enemies in dream and reality.",
			"effect": "This move deals 50 damage. It can only be used while asleep.",
			"critical": "+30 damage",
		},
		"Snore": 
		{
			"power": 40,
			"style": "Ranged",
			"flavor": "The user snores so loudly that it distracts and damages its foes.",
			"effect": "This deals 60 damage. It can only be used while asleep.",
			"critical": "+30 damage.",
		},
		"Sonic_Boom": 
		{
			"power": 20,
			"style": "Ranged",
			"flavor": "The target is hit with precise waves of sound.",
			"effect": "The target takes 30 damage regardless of multipliers, type effectivness, or other factors.",
			"critical": "",
		},
		"Spike_Cannon": 
		{
			"power": 30,
			"style": "Ranged",
			"flavor": "The target is hit with a volley of spikes.",
			"effect": "The target takes 1d60 damage.",
			"critical": "+1d60 damage.",
		},
		"Squeak": 
		{
			"power": 30,
			"style": "Ranged",
			"flavor": "High-pitched chatter causes hearing loss, annoyance, and distraction.",
			"effect": "No one in range can crit or dodge on their next turn.",
			"critical": "Crit: +30 damage.",
			"mark": "Designer's Choice"
		},
		"Rapid_Spin": 
		{
			"power": 50,
			"style": "Melee",
			"flavor": "The user spins rapidly, freeing itself from constraints.",
			"effect": "This deals 30 damage to all adjacent targets and can be used even if trapped or pinned. It removes trapped, pinned, and leech seed.",
			"critical": "+30 damage",
		},
		"Struggle": 
		{
			"power": 10,
			"style": "Melee",
			"flavor": "A desperate attempt to hurt the enemy.",
			"effect": "This 20 damage and the user takes 10 damage.",
			"critical": "+40 damage dealt, +20 damage self-inflicted.",
			"special": "Any Pokemon may learn this as a free action."
		},
		"Sweet_Scent": 
		{
			"power": 20,
			"style": "Ranged",
			"flavor": "A variety of aromas and pheromones draw in nearby Pokémon.",
			"effect": "All Pokémon in range, friend or foe, are compelled to come as close as possible to the user.",
			"critical": "The compulsion is harsh",
			"out_of_battle": "Once per session this move can be used to initiate an encounter with local Pokemon.",
		},
		"Tackle": 
		{
			"power": 20,
			"style": "Melee",
			"flavor": "The user body-checks its opponent.",
			"effect": "This deals 20 damage.",
			"critical": "Crit: +30 damage.",
		},
		"Tail_Wag": 
		{
			"power": 30,
			"style": "Ranged",
			"flavor": "User wags its tail, distracting a foe.",
			"effect": "An enemy in range cannot crit or dodge until the user’s next turn.",
			"critical": "This status becomes harsh, meaning is lasts the rest of combat.",
		},
		"Odor_Sleuth": 
		{
			"power": 40,
			"style": "Ranged",
			"flavor": "The user’s sense of smell allows it to locate the enemy with ease, no matter the distance.",
			"effect": "The target is identified.",
			"critical": "The target is harshly identified.",
			"out_of_battle": "Once per encounter, when a wild Pokémon escapes, if you have a Pokémon with this move handling roundup, you may have it make a sense save. If it passes, it tracks down the fleeing Pokémon giving you a second shot at catching it. You may use this immediately after the first encounter has ended. Tracking down the fleeing Pokémon to catch it counts as a new encounter, so if it flees again you can make a new sense save to track it again.",
		},
		"Transform": 
		{
			"power": 20,
			"style": "Self",
			"flavor": "The user copies another Pokémon on a cellular level.",
			"effect": "Choose a Pokemon on the map. The user now have the same typing and know all the same attacks as the target Pokémon, as well as taking on its appearance and abilities. This does not copy the target’s stats or personality. The user may revert to its original form as a free action.",
			"critical": "",
		},
		"Quick_Attack": 
		{
			"power": 40,
			"style": "Melee",
			"flavor": "User quickly strikes its opponent.",
			"effect": "User moves 2 extra spaces and deal half its agility in damage.",
			"critical": "User may make a dash after using this attac.",
		},
		"Yawn": 
		{
			"power": 30,
			"style": "Ranged",
			"flavor": "Stop yawning. That’s contagio-",
			"effect": "Causes a compulsion on the target for it to fall asleep. The sleep is harsh but once the target falls asleep the compulsion ends. If the user woke up last turn, it automatically crits.",
			"critical": "The target falls asleep immedaitely.",
		},
		"Agility": 
		{
			"power": 50,
			"style": "Self",
			"flavor": "A quick warmup increases the user’s speed.",
			"effect": "For the remainder of combat, the user takes an extra dash action each turn.",
			"critical": "",
		},
		"Barrage": 
		{
			"power": 60,
			"style": "Ranged",
			"flavor": "The user fires a stream of projectiles at the target.",
			"effect": "This deals 2d60 damage.",
			"critical": "Crit: +1d60 damage.",
		},
		"Baton_Pass": 
		{
			"power": 50,
			"style": "Self",
			"flavor": "User passes on its boosts to an ally.",
			"effect": "This causes the Pokemon to retreat and forces the trainer to make a switch. Any status effects this Pokémon has are transferred to the next one. ",
			"critical": "",
		},
		"Belly_Drum": 
		{
			"power": 50,
			"style": "Self",
			"flavor": "User drums harshly on its stomach, becoming stronger.",
			"effect": "User deals 50 damage to itself, but all its attacks for the rest of the fight do double damage.",
			"critical": "",
		},
		"Bide": 
		{
			"power": 50,
			"style": "Ranged",
			"flavor": "User absorbs energy and supercharges it.",
			"effect": "Once used, keep track all damage dealt to the user. On the user’s next turn, as its standard action, deal double that damage to a Pokémon in range. This attack does not miss.",
			"critical": "",
		},
		"Bullrush": 
		{
			"power": 70,
			"style": "Melee",
			"flavor": "User charges recklessly across the field.",
			"effect": "This deals 50 damage, and while using it the user can cross any terrain but water without terrain problems. If it is a water type, it can also cross water hazards without a problem.",
			"critical": "+30 damage.",
		},
		"Claw": 
		{
			"power": 70,
			"style": "Melee",
			"flavor": "User snips the target with its claws.",
			"effect": "This deals 50 damage and the target cannot take a dash action next turn.",
			"critical": "+30 damage.",
		},
		"Comet_Punch": 
		{
			"power": 60,
			"style": "Melee",
			"flavor": "User punches the target repeatedly.",
			"effect": "This deals 2d60 damage.",
			"critical": "Crit: +1d60 damage.",
		},
		"Constrict": 
		{
			"power": 50,
			"style": "Melee",
			"flavor": "User wraps itself around the target and starts squeezing.",
			"effect": "Pin the target for 50 damage.",
			"critical": "The pin is harsh.",
		},
		"Conversion": 
		{
			"power": 50,
			"style": "Self",
			"flavor": "A change in type.",
			"effect": "Pick a type. The user is now that type.",
			"critical": "",
		},
		"Crush_Claw": 
		{
			"power": 60,
			"style": "Melee",
			"flavor": "A strong claw can break an enemy’s defense.",
			"effect": "This deals 40 damage. Flip a coin. On heads, the target takes double damage from the next attack to hit it.",
			"critical": "+20 damage and there is no need to flip a coin, the target will take the double damage from the next attack.",
		},
		"Double_Slap": 
		{
			"power": 50,
			"style": "Melee",
			"flavor": "User smacks the target twice.",
			"effect": "Make 2 attacks. Both do 20 damage.",
			"critical": "Each attack does +20 damage on a crit.",
		},
		"Double_Team": 
		{
			"power": 60,
			"style": "Self",
			"flavor": "User moves so quickly that its opponents see 2 of it.",
			"effect": "Place a second marker for your Pokémon on the field. Move both individually. One of those markers is the real pokemon, one is a fake. Whenever the user performs an action that affects another Pokémon, or one of the markers is attacked with a move, choose which one is the real one at that point.",
			"critical": "",
		},
		"Double_Whip": 
		{
			"power": 70,
			"style": "Ranged",
			"flavor": "User whips the target twice.",
			"effect": "Make 2 attacks. Both do 30 damage.",
			"critical": "Roll independently for each hit. On a crit, +20 damage.",
		},
		"Follow_Me": 
		{
			"power": 60,
			"style": "Ranged",
			"flavor": "User draw attention to itself.",
			"effect": "This places a harsh compulsion on all enemies in range to attack only the user.",
			"critical": "",
		},
		"Foresight": 
		{
			"power": 70,
			"style": "Ranged",
			"flavor": "The user sees just into the future, spotting a target without fail.",
			"effect": "This harshly identifies a target. Ghost Pokémon take 1x damage from normal and fighting type moves.",
			"critical": "Target is stunned.",
		},
		"Frustration": 
		{
			"power": 70,
			"style": "Melee",
			"flavor": "The user pours out its frustrations with its trainer on a foe.",
			"effect": "This deals damage equal to 30 plus ten times all the friendship points the user is currently missing.",
			"critical": "+50 damage and the user loses an FP.",
		},
		"Fury_Swipes": 
		{
			"power": 60,
			"style": "Melee",
			"flavor": "User slashes the target in a rage.",
			"effect": "This deals 2d60 damage.",
			"critical": "Crit: +1d60 damage.",
		},
		"Glare": 
		{
			"power": 60,
			"style": "Ranged",
			"flavor": "A paralyzing stare.",
			"effect": "The target is harshly stunned.",
			"critical": "The target also has a compulsion to flee from the user.",
		},
		"Headbutt": 
		{
			"power": 70,
			"style": "Melee",
			"flavor": "The Pokémon rams the other with its thick head.",
			"effect": "This deals 70 damage.",
			"critical": "+30 damage.",
		},
		"Head_Charge": 
		{
			"power": 70,
			"style": "Melee",
			"flavor": "User charges the target head-on.",
			"effect": "Target takes 90 damage and the user takes 20 damage.",
			"critical": "+40 damage dealt and user takes an extra 10.",
		},
		"Heal_Bell": 
		{
			"power": 50,
			"style": "Ranged",
			"flavor": "The user rings a curative bell.",
			"effect": "Cure all statuses of everyone within range.",
			"critical": "",
		},
		"Hold_Hands": 
		{
			"power": 50,
			"style": "Melee",
			"flavor": "Hand in hand two friends share an adventure.",
			"effect": "Choose an adjacent ally. Both user and ally automatically move together. Both lose their dash actions, but as long as they choose to continue to hold hands, both of gain a friendship point each turn.",
			"critical": "",
		},
		"Herd": 
		{
			"power": 60,
			"style": "Ranged",
			"flavor": "The user gathers together several enemies into one location.",
			"effect": "All enemies in range have a compulsion to move to a spot of your choosing.",
			"critical": "The compulsion is harsh, and you may change the spot by having the same Pokémon use this move again, with automatic success against anyone under the compulsion.",
			"mark": "Designer's Choice.",
		},
		"Horn_Attack": 
		{
			"power": 60,
			"style": "Melee",
			"flavor": "When in doubt, gore someone.",
			"effect": "This deals 60 damage.",
			"critical": "+30 damage.",
		},
		"Hyper_Fang": 
		{
			"power": 70,
			"style": "Melee",
			"flavor": "The user bites down hard on a foe.",
			"effect": "This deals 70 damage.",
			"critical": "Target is pinned for 30 damage.",
		},
		"Payday": 
		{
			"power": 60,
			"style": "Ranged",
			"flavor": "User throws coins at the target.",
			"effect": "This deals 20 damage. It drops pokedollars on the battlefield equal to 10 times the user’s speed stat.",
			"critical": "+20 damage and 5 times the pokedollars dropped.",
			"out_of_battle": "You can use a downtime action with this Pokémon to drop 50 times its speed stat in Pokedollars. Additionally, once per scene when you make a financial transaction, you can decrease the total amount owed by that amount.",
			"opinion": "This move should be steel-typed, due to metal coins.",
		},
		"Perish_Song": 
		{
			"power": 50,
			"style": "Ranged",
			"flavor": "User sings a dirge that dooms everyone around it.",
			"effect": "Every Pokemon in range will faint at the end of its second turn.",
			"critical": "All affected have one turn left.",
		},
		"Power_Nap": 
		{
			"power": 60,
			"style": "Self",
			"flavor": "In the midst of a fight, when everything's on the line, few have the courage to sleep.",
			"effect": "This heals 60 damage. And then the user falls asleep.",
			"critical": "",
		},
		"Pound": 
		{
			"power": 70,
			"style": "Melee",
			"flavor": "User smashes the target with all its might.",
			"effect": "This deals 70 damage.",
			"critical": "+30 damage.",
		},
		"Present": 
		{
			"power": 60,
			"style": "Melee",
			"flavor": "User give the target a present with a mystery gift.",
			"effect": "Choose a target in range and announce your choice. This deals 3d60 damage, but if the dice come up triples it heals the target by the amount listed.",
			"critical": "",
			"out_of_battle": "once per session you may use a downtime action on a Pokémon with this move to have it give you a present. You get an item chosen by the GM, which will probably be good but maybe not.",
		},
		"Protect": 
		{
			"power": 60,
			"style": "Self",
			"flavor": "User protects itself at all cost.",
			"effect": "User automatically passes all dodge rolls for one turn, except crits.",
			"critical": "",
		},
		"Rage": 
		{
			"power": 60,
			"style": "Melee",
			"flavor": "User focus its anger into a berserk attack.",
			"effect": "This deals 80 damage. It is under a compulsion to continue to use rage as long as it is possible to use it on an enemy.",
			"critical": "+20 damage on this and all further uses of rage until another move is used.",
		},
		"Retaliate": 
		{
			"power": 70,
			"style": "Melee",
			"flavor": "A strike driven by the need to avenge a fallen comrade.",
			"effect": "This deals 100 damage if an ally fainted since the user’s last turn. Otherwise, 40.",
			"critical": "+30 damage for each ally that has fainted since the user’s last turn.",
		},
		"Roar": 
		{
			"power": 50,
			"style": "Ranged",
			"flavor": "A fearsome roar causes the target to take leave of its senses.",
			"effect": "This causes a compulsion to flee the area and does not miss. The compulsion ends if the Pokémon is not returned.",
			"critical": "The compulsion is harsh.",
		},
		"Rock_Ballad": 
		{
			"power": 70,
			"style": "Ranged",
			"flavor": "A move that inspires allies by rocking out. Yeeaaaaahhhhhh!!!!! ",
			"effect": "The user and every ally in range does 30 extra damage on their next attacks.",
			"critical": "",
			"mark": "Designer's Choice",
		},
		"Scary_Face": 
		{
			"power": 50,
			"style": "Ranged",
			"flavor": "A move that paralyzes the target with fear. ",
			"effect": "The target is trapped.",
			"critical": "The trap is harsh",
		},
		"Screech": 
		{
			"power": 60,
			"style": "Ranged",
			"flavor": "A sharp cry distracts enemies.",
			"effect": "Everyone in range loses its dash action next turn and deals half damage on its next attack, whether friend or foe.",
			"critical": "All targets are also stunned.",
		},
		"Secret_Power": 
		{
			"power": 50,
			"style": "Self",
			"flavor": "The Pokémon turns nearby terrain into a secret base.",
			"effect": "The Pokémon cannot move on the turn it uses this. Mark the area it’s standing on as containing a base. Any Pokémon in that base takes half damage from all attacks and has 2 extra spaces of range.",
			"critical": "",
			"out_of_battle": "This creates a secret base in a tree, cave, or something else that allows the players some downtime even in a somewhat hostile environment. The secret base can be decorated, furnished, and even used as a home for a long time to come, or it can simply be used as a temporary camp. Wild Pokémon and trainers will have a hard time finding, let alone entering the secret base. This is a great way to get some downtime. ",
		},
		"Self_Destruct": 
		{
			"power": 70,
			"style": "Melee",
			"flavor": "The user explodes into fragments, fainting from the damage. It will get better at some point.",
			"effect": "This deals 150 damage to all adjacent targets, friend or foe. The user is KO'd.",
			"critical": "+30 damage.",
		},
		"Shell_Smash": 
		{
			"power": 70,
			"style": "Self",
			"flavor": "The user cracks its shell, reducing defense but increasing offense.",
			"effect": "This move can only be used if the user has the shell special. It loses that special but for the rest of combat it takes an extra dash action and it does 30 extra damage on each attack.",
			"critical": "",
		},
		"Slash": 
		{
			"power": 60,
			"style": "Melee",
			"flavor": "A sharp cut that can leave a bleeding wound.",
			"effect": "This deals 60 damage.",
			"critical": "Also deals 15 repeating damage.",
		},
		"Strength": 
		{
			"power": 70,
			"style": "Melee",
			"flavor": "User wrestles the target with raw strength.",
			"effect": "This deals the user’s strength in damage and moves it one space.",
			"critical": "+20 damage or +2 spaces of movement, your choice.",
		},
		"Sonar": 
		{
			"power": 50,
			"style": "Self",
			"flavor": "By projecting sound waves and listening to the echoes, the user can see even in pitch black.",
			"effect": "Identify a target.",
			"critical": "The target is harshly identified.",
		},
		"Stomp": 
		{
			"power": 70,
			"style": "Melee",
			"flavor": "User steps on a smaller enemy.",
			"effect": "Deal the user’s strength + 20 damage. This only affects enemies that are lower in strength (though a gargantuan Pokémon may use this on any non-gargantuan Pokémon).",
			"critical": "Target is stunned.",
		},
		"Substitute": 
		{
			"power": 60,
			"style": "Self",
			"flavor": "User creates a small golem to take damage for it.",
			"effect": "User takes its strength in damage. This creates a substitute that will absorb that much damage before breaking. While a substitute in play, the user may carry as if it were riding the user, and it takes all damage that would go to the user, and any negative status effects that aren’t self-inflicted. If the substitute takes more damage than would be required to break it, the damage does not roll over onto the user. ",
			"critical": "",
		},
		"Swift": 
		{
			"power": 70,
			"style": "Ranged",
			"flavor": "User shoots a rain of stars at its foe.",
			"effect": "This deals the user’s speed in damage and does not miss.",
			"critical": "",
		},
		"Swords_Dance": 
		{
			"power": 70,
			"style": "Self",
			"flavor": "An elegant dance to prepare for an all-out assault.",
			"effect": "On the user’s next turn,  it takes an extra dash action and deals double damage.",
			"critical": "",
		},
		"Takedown": 
		{
			"power": 50,
			"style": "Melee",
			"flavor": "The user recklessly charges the target.",
			"effect": "This deals 80 damage. The user takes 30 damage.",
			"critical": "Target is stunned",
		},
		"Thrash": 
		{
			"power": 60,
			"style": "Melee",
			"flavor": "The user recklessly attacks everyone in the area.",
			"effect": "This deals 90 damage. However, flip a coin. On heads, it uses this move next turn. On tails it takes a compulsion to insanity.",
			"critical": "",
		},
		"Whirlwind": 
		{
			"power": 60,
			"style": "Ranged",
			"flavor": "A tornado blows the target around the battlefield.",
			"effect": "This moves the target 6 spaces.",
			"critical": "+3 spaces.",
		},
		"Body_Slam": 
		{
			"power": 100,
			"style": "Melee",
			"flavor": "The user crushes a foe beneath its bulk.",
			"effect": "This deals twice strength +50 in damage the target.",
			"critical": "The target is stunned.",
		},
		"Boomburst": 
		{
			"power": 100,
			"style": "Ranged",
			"flavor": "The user releases a devastating sonic wave.",
			"effect": "This deals 90 damage to everything in range.",
			"critical": "",
		},
		"Crush_Grip": 
		{
			"power": 80,
			"style": "Melee",
			"flavor": "User crushes the target in a massive grip. The bigger they are, the harder they fall.",
			"effect": "This deals damage equal to half the target's current HP, rounded down.",
			"critical": "",
		},
		"Double_Edge": 
		{
			"power": 90,
			"style": "Melee",
			"flavor": "The user recklessly swipes at the target.",
			"effect": "This deals 150 damage, but the user takes 60 damage.",
			"critical": "+50 damage dealt, and the user takes an extra 20 damage.",
		},
		"Egg_Bomb": 
		{
			"power": 80,
			"style": "Ranged ",
			"flavor": "The user launches an exploding egg.",
			"effect": "This deals 70 damage to the target and all adjacent targets.",
			"critical": "+30 damage.",
		},
		"Explosion": 
		{
			"power": 100,
			"style": "Ranged",
			"flavor": "The user self-destructs, taking everyone nearby with it.",
			"effect": "This deals 180 damage to all targets in range. The user is KO'd.",
			"critical": "+30 damage.",
		},
		"Extreme_Speed": 
		{
			"power": 90,
			"style": "Melee",
			"flavor": "User charges speedily across the battlefield.",
			"effect": "This deals the user’s speed in damage to the target, and it gets to move 4 extra spaces.",
			"critical": "+30 damage.",
		},
		"Giga_Impact": 
		{
			"power": 90,
			"style": "Melee",
			"flavor": "The user wears itself out attacking.",
			"effect": "This deals 130 damage. The user may not use difficult moves next turn.",
			"critical": "Target is stunned.",
		},
		"Horn_Drill": 
		{
			"power": 100,
			"style": "Melee",
			"flavor": "The user charges the target with a vicious drill, not stopping until it faints.",
			"effect": "The target gets to save twice against this. If both saves fail, the target is KO'd.",
			"critical": "The target only gets one save.",
		},
		"Hyper_Beam": 
		{
			"power": 90,
			"style": "Ranged",
			"flavor": "The user fires an unstoppable beam of pure energy. ",
			"effect": "This deals 80 damage to every target along a line. User may not use any more moves until encouraged by its trainer.",
			"critical": "+30 damage.",
		},
		"Maximize": 
		{
			"power": 90,
			"style": "Self",
			"flavor": "The user grows to gargantuan size.",
			"effect": "The user adds the gargantuan ability to itself, but it does not get the stat boosts. However, the maximized Pokémon is not considered legendary. Minimize and maximize are opposites, and if one is used the other will cancel it out. ",
			"critical": "",
		},
		"Minimize": 
		{
			"power": 90,
			"style": "Self",
			"flavor": "The user gets smaller and faster.",
			"effect": "For the remainder of combat, the user takes an extra dash action and rolls twice on all saves.",
			"critical": "",
		},
		"Milk_Drink": 
		{
			"power": 90,
			"style": "Melee",
			"flavor": "Refreshing milk to heal the bones.",
			"effect": "The target is healed for 60 damage. ",
			"critical": "",
			"out_of_battle": "Out of Combat: As a downtime action, you can get one bottle of milk that heals 60 HP.",
		},
		"Noble_Roar": 
		{
			"power": 90,
			"style": "Ranged",
			"flavor": "The user roars an all enemies in range are shaken.",
			"effect": "All enemies in range, but not allies, take double damage from all attacks until the the end of the user’s next turn.",
			"critical": "Also causes a compulsion to stay as far away as possible from the user.",
		},
		"Pincer": 
		{
			"power": 90,
			"style": "Melee",
			"flavor": "The user catches the target in its claws.",
			"effect": "This pins the target for 90 damage.",
			"critical": "The pin is harsh.",
		},
		"Round": 
		{
			"power": 80,
			"style": "Ranged",
			"flavor": "The user and allies all sing together.",
			"effect": "This deals 30 damage plus another 30 for each ally in range. Damage is dealt to all enemies in range.",
			"critical": "+30 damage.",
		},
		"Skull_Bash": 
		{
			"power": 90,
			"style": "Melee",
			"flavor": "User charges and rams the target.",
			"effect": "On the first turn, the user tucks in its head. It takes half damage from all attacks until its next turn. On the second turn, it gets to dash and deal 120 damage.",
			"critical": "+30 damage.",
		},
		"Slam": 
		{
			"power": 90,
			"style": "Melee",
			"flavor": "The user whips the target hard with a tail, vines, or other such appendage.",
			"effect": "This deals 90 damage.",
			"critical": "+30 damage.",
		},
		"Razor_Wind": 
		{
			"power": 80,
			"style": "Ranged",
			"flavor": "The user calls forth a storm of blades.",
			"effect": "The user must be encouraged before using this attack. It deals 130 damage.",
			"critical": "+30 damage.",
		},
		"Soft_Boiled": 
		{
			"power": 90,
			"style": "Melee",
			"flavor": "User gives an ally a cooked, refreshing egg.",
			"effect": "This restores 60 HP to the target.",
			"critical": "",
			"out_of_battle": "This move can be used as a downtime action to cure 60 health.",
		},
		"Super_Fang": 
		{
			"power": 90,
			"style": "Melee",
			"flavor": "User bites down extremely hard on the target.",
			"effect": "This halves the target's current health, rounded up.",
			"critical": "+30 damage.",
		},	
	},
	"Poison":
	{
		"Knockout_Venom": 
		{
			"power": 30,
			"style": "Melee",
			"flavor": "A poisonous sting forces the target into a deep sleep.",
			"effect": "The target is asleep.",
			"critical": "Sleep is harsh.",
		},
		"Mark_Territory": 
		{
			"power": 40,
			"style": "Ranged",
			"flavor": "Pheromone markers signal others to back off while increasing the user’s territorial instincts.",
			"effect": "Designate every square on the map as the user’s territory. It is under a compulsion to remain in the territory and all enemies in it currently or who enter later must make a will save or be under the compulsion as well. Allies are considered part of the pack and may come and go, but if the user leaves, even against its will, the area is no longer considered the user’s territory and the effect ends. The user’s damaging attacks do 30 extra damage while on its territory.",
			"critical": "",
		},
		"Stench": 
		{
			"power": 40,
			"style": "Ranged",
			"flavor": "The user releases such a powerful odor that everyone must flee.",
			"effect": "Every target in range, friend or foe, is under a compulsion to stay out of the user’s range.",
			"critical": "The compulsion is harsh.",
		},
		"Paralyzing_Venom": 
		{
			"power": 30,
			"style": "Melee",
			"flavor": "User nips the target with its fangs, paralyzing it.",
			"effect": "Target is stunned.",
			"critical": "+30 damage.",
		},
		"Poison_Powder": 
		{
			"power": 40,
			"style": "Melee",
			"flavor": "User dumps toxic dust on its target.",
			"effect": "Target takes 20 repeating damage.",
			"critical": "Repeating damage is harsh.",
		},
		"Poison_Sting": 
		{
			"power": 30,
			"style": "Melee",
			"flavor": "User stings the target and release the contents of its venom sac.",
			"effect": "This deals 30 damage to the target.",
			"critical": "Crit: Target takes 15 repeating damage.",
		},
		"Poo_Fling": 
		{
			"power": 40,
			"style": "Ranged",
			"flavor": "When life gives you crap, make a crappapault.",
			"effect": "This deals 40 damage to the target.",
			"critical": "Target is blinded.",
		},
		"Smokescreen": 
		{
			"power": 40,
			"style": "Ranged",
			"flavor": "User belches out smoke until the area is covered in a dense, rolling cloud.",
			"effect": "Every target in range is blinded.",
			"critical": "Allies are not blinded.",
		},
		"Sticky_Glob": 
		{
			"power": 30,
			"style": "Ranged",
			"flavor": "User spits goo or sap onto the area that slows the target.",
			"effect": "The target is trapped.",
			"critical": "Trap is harsh.",
		},
		"Toxic_Gas": 
		{
			"power": 30,
			"style": "Ranged",
			"flavor": "User blasts toxic gas onto its foes.",
			"effect": "The target and all adjacent targets take 10 repeating damage.",
			"critical": "20 repeating damage instead.",
		},
		"Acid": 
		{
			"power": 50,
			"style": "Ranged",
			"flavor": "User shoots a glob of acid at the target.",
			"effect": "This deals 50 damage.",
			"critical": "Target takes 15 repeating damage.",
		},
		"Acid_Armor": 
		{
			"power": 60,
			"style": "Self",
			"flavor": "A protective layer of acidic slime keeps attacks at bay.",
			"effect": "From now on the user takes 30 less damage from all attacks.",
			"critical": "",
		},
		"Acidic_Cloud": 
		{
			"power": 70,
			"style": "Ranged",
			"flavor": "User belches out a cloud of damaging mist.",
			"effect": "This deals 60 damage to everyone in range, friend or foe.",
			"critical": "Crit: The target takes 30 repeating damage.",
		},
		"Berserker_Toxin": 
		{
			"power": 60,
			"style": "Ranged",
			"flavor": "User shoots a dart that causes the target to fly into uncontrollable rage.",
			"effect": "The target takes 30 damage and has a compulsion to attack the nearest Pokemon, be it friend or foe.",
			"critical": "+30 damage",
		},
		"Coil": 
		{
			"power": 30,
			"style": "Self",
			"flavor": "User coils up and prepares to strike, readying its venom glands.",
			"effect": "The user’s next poison attack automatically crits.",
			"critical": "",
		},
		"Cross_Poison": 
		{
			"power": 60,
			"style": "Melee",
			"flavor": "User slashes with a poisoned blade.",
			"effect": "This deals 60 damage.",
			"critical": "User burns out a difficult move.",
		},
		"Gastro_Acid": 
		{
			"power": 60,
			"style": "Melee",
			"flavor": "User belches the acidic content of its stomach onto the opponents.",
			"effect": "Target loses all abilities and its next attack deals half damage. If the user ate something last turn, this undoes the effect of that food, and the attack does +50 damage.",
			"critical": "+30 damage.",
		},
		"Infected_Bite": 
		{
			"power": 70,
			"style": "Melee",
			"flavor": "User bite the target with infected teeth.",
			"effect": "The user takes 40 damage and its next attack deals half damage.",
			"critical": "Target takes 10 harsh repeating damage.",
		},
		"Oil_Glob": 
		{
			"power": 60,
			"style": "Ranged",
			"flavor": "User spits a globule of oil that binds to the target.",
			"effect": "The target takes 30 damage and is now weak against fire.",
			"critical": "Target is trapped.",
		},
		"Oil_Spill": 
		{
			"power": 60,
			"style": "Ranged",
			"flavor": "User dumps oil all over the water.",
			"effect": "This affects every Pokemon in the same body of water the user is in. They take 10 repeating damage and are now weak against fire.",
			"critical": "+15 repeating damage.",
			"mark": "Designer's Choice",
			"note": "Oil spills could be vegetable/olive oil. Not necessarily petroleum.",
		},
		"Poison_Fang": 
		{
			"power": 70,
			"style": "Melee",
			"flavor": "User bites the target with venomous fangs.",
			"effect": "The target takes 70 damage.",
			"critical": "Target also takes 15 repeating damage.",
		},
		"Poison_Jab": 
		{
			"power": 60,
			"style": "Melee",
			"flavor": "User quickly stabs the target with poisoned stingers.",
			"effect": "Move 2 extra spaces, and the target takes 40 damage.",
			"critical": "Target takes 15 repeating damage.",
		},
		"Poison_Tail": 
		{
			"power": 50,
			"style": "Melee",
			"flavor": "User stings the target with the venom spike on its tail.",
			"effect": "This deals 40 damage and crits on any doubles.",
			"critical": "Target takes 10 harsh repeating damage.",
		},
		"Adrenaline_Shot": 
		{
			"power": 50,
			"style": "Melee",
			"flavor": "User injects pure adrenaline right into an ally.",
			"effect": "The target gets an extra dash action for the remainder of combat.",
			"critical": "",
		},
		"Sludge_Bomb": 
		{
			"power": 60,
			"style": "Ranged",
			"flavor": "User hurls a clump of gunk that explodes on impact.",
			"effect": "This deals 50 damage to the target and all adjacent targets, friend or foe.",
			"critical": "Targets take 15 repeating damage.",
		},
		"Toxic_Cloud": 
		{
			"power": 60,
			"style": "Ranged",
			"flavor": "User belches out a cloud of poisonous gas.",
			"effect": "This deals 30 repeating damage to everyone in range.",
			"critical": "The repeating damage is harsh.",
		},
		"Venom_Drench": 
		{
			"power": 50,
			"style": "Ranged",
			"flavor": "User covers its opponent in venom.",
			"effect": "All targets in range that are taking repeating damage have their repeating damage doubled. Additionally, this attack does not miss.",
			"critical": "",
		},
		"Acid_Rain": 
		{
			"power": 100,
			"style": "Weather",
			"flavor": "The rain begins to bring pollutants out of the atmosphere onto the battlefield.",
			"effect": "All Pokemon on the field take 1d60 poison damage if they don't resist poison. Those weak against it take increased damage as usual.",
			"critical": "",
		},
		"Acid_Spray": 
		{
			"power": 100,
			"style": "Ranged",
			"flavor": "User covers the target in acid that erodes the defenses.",
			"effect": "Target and all adjacent targets take 40 damage and double damage from the next attack.",
			"critical": "Targets are stunned.",
		},
		"Belch": 
		{
			"power": 90,
			"style": "Ranged",
			"flavor": "User eats a berry and burp out toxic gasses from its gut.",
			"effect": "This deals 120 damage, but the user must consume a berry to use it.",
			"critical": "Gain the effect of the berry again.",
		},
		"Digest": 
		{
			"power": 80,
			"style": "Melee",
			"flavor": "The user swallows an enemy whole. ",
			"effect": "This pins the target for 90 damage. The target of this move may not be hit by any other moves, being inside the user’s stomach and all.",
			"critical": "The pin is harsh.",
		},
		"Gunk_Shot": 
		{
			"power": 90,
			"style": "Ranged",
			"flavor": "User throws garbage or goo at the target.",
			"effect": "This deals 90 damage.",
			"critical": "Target takes 15 repeating damage.",
		},
		"Sludge_Wave": 
		{
			"power": 100,
			"style": "Ranged",
			"flavor": "User covers the area in dense sludge.",
			"effect": "This deals 90 damage to all targets in range, friend or foe.",
			"critical": "Targets take 10 harsh repeating damage.",
		},
		"Toxic": 
		{
			"power": 80,
			"style": "Ranged",
			"flavor": "User shoots a glob of toxic goo.",
			"effect": "Target takes 40 repeating damage.",
			"critical": "Repeating damage is harsh. ",
		},
		"Venoshock": 
		{
			"power": 90,
			"style": "Ranged",
			"flavor": "User initiates anaphylactic shock in the target.",
			"effect": "The target takes 60 damage, plus damage equal to twice the repeating damage it is currently taking.",
			"critical": "+30 damage.",
		}, 
	},
	"Psychic":
	{
		"Amnesia": 
		{
			"power": 20,
			"style": "Self",
			"flavor": "The user clears its mind to improve attack.",
			"effect": "Choose a move that is not burnt out. For the remainder of the fight the user forgets how to use that move. Deal extra damage on the user’s next attack equal to the power of that move, or twice the move’s power if that move was natural.",
			"critical": "",
		},
		"Berserk_Impulse": 
		{
			"power": 30,
			"style": "Ranged",
			"flavor": "The user implants senseless anger into the target's conscious stream.",
			"effect": "This cause a compulsion in the target to attack the nearest Pokemon, friend or foe.",
			"critical": "The status is harsh.",
		},
		"Charm_Impulse": 
		{
			"power": 30,
			"style": "Ranged",
			"flavor": "The user implants thoughts of friendliness into the target's conscious stream.",
			"effect": "This causes a compulsion in the target to regard the user as an ally any anyone who threatens it as a foe.",
			"critical": "The status is harsh.",
		},
		"Cosmic_Power": 
		{
			"power": 20,
			"style": "Self",
			"flavor": "The user is protected by phenomenal cosmic power, yet restricted to a smaller area.",
			"effect": "This allows the user to protect itself with psychic barriers. The user may use mind saves to dodge all attacks when desired for the remainder of combat.",
			"critical": "",
		},
		"ESP": 
		{
			"power": 20,
			"style": "Self",
			"flavor": "By expanding its sensory abilities, the user can see possibilities that would not otherwise exist.",
			"effect": "Normally, range is calculated as if diagonal spaces are two spaces away. Treat them as being one space away, turning the user’s range into a large square.",
			"critical": "",
		},
		"Heal_Block": 
		{
			"power": 20,
			"style": "Ranged",
			"flavor": "User prevents anyone from even thinking about healing.",
			"effect": "No target in range can be healed until the start of the user’s next turn.",
			"critical": "The status is harsh, meaning it lasts the rest of combat.",
		},
		"Hypnosis": 
		{
			"power": 30,
			"style": "Ranged",
			"flavor": "The user calms the target until it falls asleep, aided by psychic power.",
			"effect": "This causes the sleep status.",
			"critical": "The status is harsh.",
		},
		"Magic_Coat": 
		{
			"power": 20,
			"style": "Self",
			"flavor": "The user is protected by karma itself.",
			"effect": "Any time the user takes repeating damage, the damage is instead dealt to the target that hit the user.",
			"critical": "",
		},
		"Meditate": 
		{
			"power": 30,
			"style": "Self",
			"flavor": "Focusing one’s thoughts prepares one for the coming battle.",
			"effect": "The next attack the user makes does 30 extra damage.",
			"critical": "",
		},
		"Mind_Reading": 
		{
			"power": 40,
			"style": "Ranged",
			"flavor": "The user is able to read the target’s mind and act accordingly.",
			"effect": "For the rest of combat, the user can roll twice to crit or save against the target. This move has no effect against types that resist psychic.",
			"critical": "",
			"out_of_battle": "This move is great for getting into people’s heads, although it is resisted by the mysteries skill.",
		},
		"Mind_Worm": 
		{
			"power": 40,
			"style": "Ranged",
			"flavor": "This psychic attack puts a damaging meme in the target's head that keeps going.",
			"effect": "This deals 20 repeating damage.",
			"critical": "Repeating damage is harsh.",
		},
		"Paranoia": 
		{
			"power": 20,
			"style": "Ranged",
			"flavor": "The user implants dread and terror into the target’s mind, and it fears the undead.",
			"effect": "The target is weak against ghost attacks.",
			"critical": "The target has a compulsion to paranoia.",
		},
		"Precognition": 
		{
			"power": 70,
			"style": "Self",
			"flavor": "The user begins to react to things before they happen becoming much more accurate.",
			"effect": "For the remainder of combat, any time the user rolls dice for critting or dodging, roll twice and take the better result.",
			"critical": "",
		},
		"Push": 
		{
			"power": 20,
			"style": "Ranged",
			"flavor": "A telekinetic shove.",
			"effect": "Move the target 2 spaces.",
			"critical": "+3 spaces of movement.",
		},
		"Psychic_Touch": 
		{
			"power": 30,
			"style": "Melee",
			"flavor": "The user taps the target's head and sends psychic energy through skin contact.",
			"effect": "This deals 30 damage.",
			"critical": "The target takes a compulsion to insanity.",
		},
		"Retrocognition": 
		{
			"power": 40,
			"style": "Ranged",
			"flavor": "The user can see into the past, unlocking history and mystery.",
			"effect": "This allows the user to see the target’s complete character sheet. The GM may divulge hints at pertinent backstory.",
			"critical": "The user knows all the target’s tricks and gets to roll twice and take the better result any time it dodges the target.",
			"out_of_battle": "This move can show what happened with the item or in the area in the past.",
		},
		"Self_Levitation": 
		{
			"power": 30,
			"style": "Self",
			"flavor": "There must be 50 ways to learn to hover.",
			"effect": "This grants the user the levitate special. The usermay move over terrain without penalty.",
			"critical": "",
		},
		"Telekinesis": 
		{
			"power": 30,
			"style": "Ranged",
			"flavor": "User levitates the target into a fixed position in the air, keeping it from moving.",
			"effect": "The target is trapped.",
			"critical": "The target is harshly trapped.",
		},
		"Teleport": 
		{
			"power": 30,
			"style": "Self",
			"flavor": "The user vanishes and reappears elsewhere on the battlefield.",
			"effect": "Choose a space within range and immediately move there, bypassing the intervening spaces.",
			"critical": "The user can teleport itself and one other individual to any location the trainer marked with the gateway move.",
			"out_of_battle": "",
		},
		"Gateway": 
		{
			"power": 50,
			"style": "Ranged",
			"flavor": "The user creates a wormhole connecting two points on the battlefield.",
			"effect": "Choose a space within range and mark it with a gateway. All spaces on the battlefield so marked are considered adjacent to each other, even if made by different users. If there are no gateway spaces, when this move is used it creates an exra gateway space somewhere else in range if desired.",
			"critical": "",
		},
		"Barrier": 
		{
			"power": 60,
			"style": "Self",
			"flavor": "The user conjures a protective wall.",
			"effect": "Increase user’s HP by 30, even above its max health.",
			"critical": "",
		},
		"Brainstorm": 
		{
			"power": 60,
			"style": "Ranged",
			"flavor": "A wave of psychic energy empowers the user and its friends.",
			"effect": "The user and all allies in range are cleared of any compulsions and do +20 damage on their next attack.",
			"critical": "All enemies in range take a compulsion to confusion.",
			"out_of_battle": "Brainstorm is can grant the user access to new ideas, useful for assisting mental skills when no idea presents itself.",
		},
		"Calm_Mind": 
		{
			"power": 60,
			"style": "Self",
			"flavor": "The user forgets its fears and concerns and focuses on seeing far.",
			"effect": "Increase user’s range by 3 spaces for the duration of the fight.",
			"critical": "",
		},
		"Confusion": 
		{
			"power": 60,
			"style": "Ranged",
			"flavor": "The user bombards the target's mind with chaotic thoughts until it can take no more.",
			"effect": "This deals 30 damage and causes a compulsion to insanity.",
			"critical": "Target loses 30 mind.",
		},
		"Dream_Eater": 
		{
			"power": 50,
			"style": "Ranged",
			"flavor": "The user projects itself into the target’s mind and eat its dreams.",
			"effect": "This only affects sleeping targets, but it deals 60 damage and heals the user for half the damage dealt. It does not give the target a chance to wake up.",
			"critical": "+20 damage dealt, with increased healing.",
		},
		"Extrasensory": 
		{
			"power": 60,
			"style": "Ranged",
			"flavor": "User shoots a beam guided by its mystic senses.",
			"effect": "This deals 40 damage and does not miss.",
			"critical": "Target is stunned.",
		},
		"Future_Sight": 
		{
			"power": 50,
			"style": "Ranged",
			"flavor": "User foretells the target’s doom.",
			"effect": "This deals 120 damage to the target 2 turns after it is used.",
			"critical": "The damage happens on the user’s next turn.",
		},
		"Gravity": 
		{
			"power": 60,
			"style": "Ranged",
			"flavor": "An intense gravity well centers itself on the user.",
			"effect": "All targets in range lose their levitate and airborne abilities and flying type. They are also now weak against ground.",
			"critical": "Targets are trapped.",
		},
		"Hallucination_Aura": 
		{
			"power": 60,
			"style": "Self",
			"flavor": "The user surrounds itself with a psychic field that projects illusions into others’ visual cortices.",
			"effect": "The user begins sneaking and all units and every target in range takes a compulsion to insanity.",
			"critical": "Allies are not affected.",
		},
		"Levitate": 
		{
			"power": 70,
			"style": "Ranged",
			"flavor": "User moves a target slowly but surely across the field.",
			"effect": "Move the target from anywhere within range to anywhere within range.",
			"critical": "",
		},
		"Psybeam": 
		{
			"power": 70,
			"style": "Ranged",
			"flavor": "A beam of unbridled psychic energy.",
			"effect": "This deals 70 damage.",
			"critical": "The target also takes a compulsion to insanity.",
		},
		"Psychic_Crush": 
		{
			"power": 70,
			"style": "Ranged",
			"flavor": "The target is trapped in a contracting force field force field.",
			"effect": "This traps the target and deals 20 repeating damage. Only a mind save can counteract this, but a successful save will elimate both.",
			"critical": "+15 repeating damage.",
		},
		"Psycho_Cut": 
		{
			"power": 60,
			"style": "Ranged",
			"flavor": "User slashes at the target with blades of pure mental energy.",
			"effect": "40 damage and crits on any doubles.",
			"critical": "+30 damage.",
		},
		"Psyshock": 
		{
			"power": 50,
			"style": "Melee",
			"flavor": "The user propels itself with a wave of telekinetic energy.",
			"effect": "This deals 50 damage.",
			"critical": "+30 damage.",
		},
		"Psywave": 
		{
			"power": 60,
			"style": "Ranged",
			"flavor": "A wave of chaotic psychic energy at a foe.",
			"effect": "This deals 2d60 damage to the target.",
			"critical": "Target has a compulsion to confusion.",
		},
		"Reflect": 
		{
			"power": 70,
			"style": "Self",
			"flavor": "User conjures a protective barrier around that bounces attacks back to where they came from",
			"effect": "User may make mind saves in place of sense and speed saves to avoid damage. On a successful defense, the atttacker has to dodge its own move or take the effect.",
			"critical": "",
		},
		"Rest": 
		{
			"power": 70,
			"style": "Self",
			"flavor": "User falls into a healing sleep.",
			"effect": "This heals 60 damage and removes all statuses, replacing them with the status of sleep.",
			"critical": "",
		},
		"Synchronize": 
		{
			"power": 50,
			"style": "Ranged",
			"flavor": "The user harmonizes energies with the target and then destroy it from within.",
			"effect": "This deals 90 damage to all Pokémon in range that share a type with the user, bypassing type multipliers and damage modifiers. If the user has two types, any Pokémon with either type will be affected. This bypasses any resistances and weaknesses, except it does double damage to all Pokémon that share both types.",
			"critical": "",
		},
		"Telepathic_Bond": 
		{
			"power": 60,
			"style": "Ranged",
			"flavor": "The user and an ally share perceptions, watching each others' back with supernatural awareness.",
			"effect": "The user and an ally in range are linked. Any time either needs to make a sense or mind save, both roll and take the higher effect. But if either takes a compulsion, both do. This effect lasts only while both are on the field simultaneously.",
			"critical": "",
		},
		"Ally_Switch": 
		{
			"power": 50,
			"style": "Ranged",
			"flavor": "The user switches places with a willing partner.",
			"effect": "Choose any allied Pokémon on the map. Trade places with it.",
			"critical": "",
		},
		"Mind_Control": 
		{
			"power": 100,
			"style": "Ranged",
			"flavor": "The user seizes control of the target’s mind.",
			"effect": "Force the target to take its turn immediately, taking complete control of its turn and having it dash and use a move as you see fit, even targeting a former ally.",
			"critical": "This effect is treated as a compulsion, and until the target passes a mind save the user may continue to dictate its actions.",
		},
		"Mind_Crush": 
		{
			"power": 90,
			"style": "Ranged",
			"flavor": "User blasts the target's mind directly.",
			"effect": "This deals 90 damage.",
			"critical": "The target takes a compulsion to insanity.",
		},
		"Nullify": 
		{
			"power": 100,
			"style": "Ranged",
			"flavor": "The target is returned to its normal state.",
			"effect": "This changes a mega-evolved Pokémon back to its normal form. It loses the 100 HP it gained by mega evolving.",
			"critical": "The target can’t use any difficult moves on its next turn.",
		},
		"Purple_Haze": 
		{
			"power": 100,
			"style": "Weather",
			"flavor": "The user calls up purple mist that expands consciousness.",
			"effect": "This weather nullfies all status effects except compulsions, which become harsh.",
			"critical": "",
		},		
		"Psi_Kick": 
		{
			"power": 90,
			"style": "Melee",
			"flavor": "The user teleports and plants its foot on the unsuspecting target's face.",
			"effect": "Instead of dashing as a part of this move, teleport to any space in range without passing through the intervening spaces. Deal the user’s strength in damage to an adjacent target.",
			"critical": "+30 damage.",
		},
		"Psi_Storm": 
		{
			"power": 100,
			"style": "Ranged",
			"flavor": "Mental attacks wash over everyone around in the area.",
			"effect": "This deals 90 damage to everyone in range.",
			"critical": "Also causes a compulsion to insanity.",
		},
		"Psychic": 
		{
			"power": 90,
			"style": "Ranged",
			"flavor": "Telekinesis slams the target into everything in sight.",
			"effect": "Move the target 3 spaces and deal 60 damage.",
			"critical": "+30 damage.",
		},
		"Psycho_Boost": 
		{
			"power": 80,
			"style": "Ranged",
			"flavor": "The user unleashes the darkest depths of its mind.",
			"effect": "This deals 120 damage but the next attack the user makes deals half damage. ",
			"critical": "Too deep, too dark! +60 damage and the user is stunned.",
		},
		"Psystrike": 
		{
			"power": 90,
			"style": "Melee",
			"flavor": "The user puppets its own body with psychic powers.",
			"effect": "This deals 90 damage.",
			"critical": "+30 damage.",
		},
		"Zen_Headbutt": 
		{
			"power": 80,
			"style": "Melee",
			"flavor": "Mind-to-mind energy transfer is easier when skulls are touching.",
			"effect": "This deals 90 damage.",
			"critical": "Target is stunned. ",
		},
	},
	"Rock":
	{
		"Grind": 
		{
			"power": 20,
			"style": "Self",
			"flavor": "The user moves so fast that pieces of its rocky skin grind against each other.",
			"effect": "The user moves 4 extra spaces using this move, and takes 20 damage. ",
			"critical": "",
		},
		"Heavyweight": 
		{
			"power": 20,
			"style": "Self",
			"flavor": "The user latches onto the ground, using its weight to remain in place.",
			"effect": "This prevents the user from being moved by any move, even beneficially. Any melee move used against this Pokémon instead causes the attack to face the knockback.",
			"critical": "",
		},
		"Rock_Polish": 
		{
			"power": 20,
			"style": "Self",
			"flavor": "The user smoothes itself out to move faster.",
			"effect": "The user gets to take an extra dash action on the next turn.",
			"critical": "",
		},
		"Slab": 
		{
			"power": 40,
			"style": "Melee",
			"flavor": "A hard hit with a hard piece of rock.",
			"effect": "The user whacks the target for 40 damage.",
			"critical": "The target is stunned.",
		},
		"Stone_Fist": 
		{
			"power": 30,
			"style": "Melee",
			"flavor": "Well documented by the Rocky movies, this punch is hard as granite.",
			"effect": "The user deals 30 damage.",
			"critical": "+30 damage.",
		},
		"Ancient_Power": 
		{
			"power": 60,
			"style": "Self",
			"flavor": "The user calls upon the power it had in a previous age.",
			"effect": "This deals 60 damage.",
			"critical": "The user’s next attack deals double damage.",
		},
		"Boulder_Throw": 
		{
			"power": 70,
			"style": "Ranged",
			"flavor": "Lobbing boulders might not be the most accurate attack, but doing so can make effective cordons.",
			"effect": "This allows the user to throw a number of boulders equal to its strength divided by 10. For each boulder, pick a space within range and place a boulder marker there. Any Pokémon on that space rolls a speed save. If it passes, it immediately is moved to an adjacent space without taking damage. Otherwise, it is moved and it takes 10 damage. If the Pokémon is incapable of moving from the space, no marker is palced and the target takes 30 damage. Boulder markers are terrain that is impassible for Pokémon not strong against rock.",
			"critical": "All boulders do double damage, but do not automatically hit.",
		},
		"Rock_Blast": 
		{
			"power": 90,
			"style": "Ranged",
			"flavor": "The user fires a spray of rock fragments at the targets.",
			"effect": "This deals 2d60 damage to all targets along a line.",
			"critical": "+1d60 damage.",
		},
		"Rock_Throw": 
		{
			"power": 50,
			"style": "Ranged",
			"flavor": "The user lobs a rock at the target.",
			"effect": "This deals the user’s strength in damage to the target.",
			"critical": "+30 damage.",
		},
		"Rock_Tomb": 
		{
			"power": 70,
			"style": "Ranged",
			"flavor": "This traps the target under a mountain of rubble.",
			"effect": "This deals 40 damage to the target. Additionally, it is surrounded by boulder markers that are impassible rock terrain.",
			"critical": "The target is trapped.",
		},
		"Rollout": 
		{
			"power": 60,
			"style": "Melee",
			"flavor": "User curls up and rolls at the target.",
			"effect": "This deals 40 damage and allows the user to move one extra space. If it hits, the user continues to rollout on the next turn, moving 1 extra space and dealing 40 extra damage for each time it has hit. When rollout ends, the user takes a compulsion to severe dizziness.",
			"critical": "+30 damage.",
		},
		"Power_Gem": 
		{
			"power": 70,
			"style": "Ranged",
			"flavor": "The user fires a beam of power from its gem.",
			"effect": "This deals 70 damage.",
			"critical": "+30 damage.",
		},
		"Smackdown": 
		{
			"power": 60,
			"style": "Melee",
			"flavor": "The user knocks that airborne sissy to the ground, where it’ll have to fight for real.",
			"effect": "The target is no longer airborne or levitating and it is weak against ground attacks. It takes 30 damage as well.",
			"critical": "The target is stunned.",
		},
		"Stalagmite": 
		{
			"power": 60,
			"style": "Melee",
			"flavor": "The user stabs the opponent with a rocky protrusion.",
			"effect": "This deals 60 damage.",
			"critical": "+30 damage.",
		},
		"Diamond_Armor": 
		{
			"power": 100,
			"style": "Self",
			"flavor": "The user covers itself in adamant plates",
			"effect": "The user takes half damage from all attacks for the rest of combat.",
			"critical": "",
		},
		"Diamond_Storm": 
		{
			"power": 100,
			"style": "Ranged",
			"flavor": "The user whips up a storm of industrial diamonds that pelt everyone in range.",
			"effect": "This deals 90 damage to all targets in range, friend or foe.",
			"critical": "User’s next attack deals 30 extra damage.",
		},
		"Head_Smash": 
		{
			"power": 90,
			"style": "Melee",
			"flavor": "No matter what, someone’s going down.",
			"effect": "This deals 150 damage and the user takes 60 automatic damage.",
			"critical": "The target faints and the user takes an additional 50 damage.",
		},
		"Rock_Slide": 
		{
			"power": 80,
			"style": "Ranged",
			"flavor": "A wave of stones buries the user’s foes.",
			"effect": "This deals 70 damage to the target and all adjacent targets, friend or foe.",
			"critical": "+30 damage.",
		},
		"Sandstorm": 
		{
			"power": 100,
			"style": "Weather",
			"flavor": "User causes the sky to go dark with gravel in the air.",
			"effect": "All Pokémon on the field take 1d60 rock damage every turn, unless they’re resistant or immune. ",
			"critical": "",
		},
		"Stone_Edge": 
		{
			"power": 90,
			"style": "Melee",
			"flavor": "The razor-sharp edge of a stone knife.",
			"effect": "The target takes 70 damage.",
			"critical": "+30 damage.",
		},
		"Wide_Guard": 
		{
			"power": 100,
			"style": "Self",
			"flavor": "Stone walls protect allies from attack.",
			"effect": "Until the start of the user’s next turn, it is immune to all damage, as is any ally that is adjacent to the user while being attacked. Status effects still occur.",
			"critical": "",
		},
	},
	"Steel":
	{
		"Brass_Knuckles": 
		{
			"power": 20,
			"style": "Melee",
			"flavor": "User punches its target with a metallic fist.",
			"effect": "This deals 20 damage.",
			"critical": "+30 damage.",
		},
		"Bullet_Punch": 
		{
			"power": 40,
			"style": "Melee",
			"flavor": "User strikes, quick as a bullet.",
			"effect": "This deals 30 damage and doesn’t miss. ",
			"critical": "This move does not crit.",
		},
		"Interface": 
		{
			"power": 40,
			"style": "Melee",
			"flavor": "The user integrates with other technology.",
			"effect": "This allows one technical Pokémon such as Porygon, Magnemite, or Electrode to integrate with another such Pokémon, or with any machinery on the battlefield. If used on an ally, both get double damage on their next attack and gain a friendship point. If used on an enemy, it has a harsh compulsion to aid the user, and this move bypasses type resistances. If used on technology on the field, this allows the user to hack computers or use its parts to drive machinery.",
			"critical": "",
		},
		"Metal_Claw": 
		{
			"power": 30,
			"style": "Melee",
			"flavor": "The user strikes with bladelike fingers.",
			"effect": "This deals 30 damage.",
			"critical": "User’s next attack automatically crits.",
		},
		"Polish_Armor": 
		{
			"power": 30,
			"style": "Melee",
			"flavor": "Buffing armor to a perfect sheen allows deflecting energy and slipping out of tight squeezes.",
			"effect": "The user ignores the next negative status effect to hit it. ",
			"critical": "",
		},
		"Shuriken": 
		{
			"power": 30,
			"style": "Ranged",
			"flavor": "User throws several shards of metal at a foe.",
			"effect": "This deals 1d60 damage.",
			"critical": "+1d60 damgage.",
		},
		"Steel_Bash": 
		{
			"power": 40,
			"style": "Melee",
			"flavor": "User bludgeons its target with steel.",
			"effect": "This deals 40 damage.",
			"critical": "Target is stunned. ",
		},
		"Steel_Strike": 
		{
			"power": 30,
			"style": "Melee",
			"flavor": "The user hits with pure steel.",
			"effect": "This deals 30 damage.",
			"critical": "Crit: +30 damage.",
		},
		"Acupuncture": 
		{
			"power": 60,
			"style": "Melee",
			"flavor": "User places steel pins in an ally’s pressure points, strengthening it.",
			"effect": "For the remainder of combat the target does +30 damage with all damaging attacks.",
			"critical": "",
		},
		"Automatize": 
		{
			"power": 50,
			"style": "Self",
			"flavor": "User sheds parts it don’t need right now, getting lighter.",
			"effect": "For the remainder of combat, the user gets an extra dash action.",
			"critical": "",
		},
		"Gear_Grind": 
		{
			"power": 70,
			"style": "Ranged",
			"flavor": "User throws two gears at the target.",
			"effect": "This makes two 30 damage attacks.",
			"critical": "Roll separately for each attack. Each crit does +20 damage.",
		},
		"Gyro_Ball": 
		{
			"power": 60,
			"style": "Melee",
			"flavor": "User comes at the target in a high-speed spin.",
			"effect": "This move does damage equal to the target’s speed.",
			"critical": "+30 damage.",
		},
		"Heavy_Slam": 
		{
			"power": 60,
			"style": "Melee",
			"flavor": "User slams into the targets with its full weight.",
			"effect": "This deals the user’s strength in damage to the target and all adjacent targets.",
			"critical": "Target is stunned.",
		},
		"Iron_Head": 
		{
			"power": 60,
			"style": "Melee",
			"flavor": "User rams the target head on.",
			"effect": "This deals 60 damage.",
			"critical": "Target is stunned.",
		},
		"Iron_Tail": 
		{
			"power": 50,
			"style": "Melee",
			"flavor": "A smack with a steel tail.",
			"effect": "This deals 50 damage.",
			"critical": "Target does half damage on its next attack.",
		},
		"Magnet_Bomb": 
		{
			"power": 70,
			"style": "Ranged",
			"flavor": "User launches a magnetic bomb at its targets.",
			"effect": "This attack deals 40 damage to the target and all adjacent targets, friend or foe. It does not miss, and electric Pokémon are weak against it.",
			"critical": "",
		},
		"Shift_Gears": 
		{
			"power": 60,
			"style": "Self",
			"flavor": "The user optimizes its speed or strength.",
			"effect": "On the user’s next turn it either deals double damage or takes an extra dash action. This may not have the same effect twice in row.",
			"critical": "",
		},
		"Spike_Shot": 
		{
			"power": 60,
			"style": "Ranged",
			"flavor": "User fires steel spikes are its target. ",
			"effect": "This deals 2d60 damage.",
			"critical": "+1d60 damage.",
		},
		"Steel_Cage": 
		{
			"power": 50,
			"style": "Ranged",
			"flavor": "User launches steel spikes at the target, surrounding it in a cage.",
			"effect": "This deals 20 damage and the target is trapped.",
			"critical": "+30 damage.",
		},
		"Steel_Horn": 
		{
			"power": 70,
			"style": "Melee",
			"flavor": "User impales a foe with a crown of spikes.",
			"effect": "This deals 70 damage.",
			"critical": "+30 damage.",
		},
		"Steel_Wing": 
		{
			"power": 60,
			"style": "Melee",
			"flavor": "User slashes its opponent with a metallic wing.",
			"effect": "This deals 60 damage.",
			"critical": "User’s next attack automaticaly crits.",
		},
		"Unipole": 
		{
			"power": 50,
			"style": "Melee",
			"flavor": "The user is pulled by the earth’s magnetic field.",
			"effect": "The user moves 5 spaces directly north or south instead of dashing. It deals 30 damage to every Pokémon along its path, friend or foe.",
			"critical": "Crit: +20 damage on each hit.",
		},
		"Armor_Coat": 
		{
			"power": 100,
			"style": "Self",
			"flavor": "The user grows an outer layer of steel plating.",
			"effect": "The user takes 50 less damage from all attacks for the remainder of combat.",
			"critical": "",
		},
		"Ironsides": 
		{
			"power": 80,
			"style": "Self",
			"flavor": "User coats itself in a layer of protective metal.",
			"effect": "User takes half damage from all attacks for the rest of combat.",
			"critical": "",
		},
		"Meteor_Mash": 
		{
			"power": 100,
			"style": "Melee",
			"flavor": "User punches the target like an iron meteorite impact.",
			"effect": "This deals 100 damage.",
			"critical": "User's next attack automatically crits.",
		},
		"Steel_Press": 
		{
			"power": 100,
			"style": "Melee",
			"flavor": "User crushes the target between 2 steel plates.",
			"effect": "The target gets to make 2 saves against this attack. If it fails both, it is KO’d.",
			"critical": "The target only gets 1 save.",
		},
		"Trumpet": 
		{
			"power": 100,
			"style": "Ranged",
			"flavor": "The user sounds a victory blast that inspires everyone.",
			"effect": "All allies in range do 30 extra damage and take an extra dash action on their next turn, as does the user.",
			"critical": "All enemies in range do half damage on their next attack.",
		},
	},
	"Water":
	{
/*
Aqua ⠂ 30
Style: Ranged
User shoots a ball of water that bursts.
This deals 20 damage to the targeted space and every adjacent space.
Crit: +50 damage.


Aqua Jet ⠂ 40
Style: Melee
User rides a jet of water to move quickly
Move 3 extra spaces and deal 10 damage. This move does not miss.
Crit: +30 damage.


Bubble ⠂ 20
Style: Ranged
User shoots a bubble at the target. This deals damage for unknown reasons.
This deals 30 damage.
Crit: Target is stunned.


Octazooka ⠂ 40
Style: Ranged
A glob of ink is shot at the target’s face.
The target is blinded and takes 10 damage.
Crit: +30 damage.


Soak ⠂ 30
Style: Ranged
User drenches the target in salt water.
The target is now weak against electricity.
Crit: Target’s dash is set to 0 for one turn.


Splash   10
Style: Melee
User flops around the map, jumping high.
Move without terrain penalties and do nothing to all adjacent Pokemon.
Crit: All adjacent Pokémon are mildly moistened, which has no noticeable effect on battle performance.


Squirt ⠂ 30
Style: Ranged
A small but powerful spray of water.
This deals 20 damage and moves the target one space.
Crit: +50 damage.
Tier 2
Brine ⠅ 60
Style: Ranged
User spits a stream of briny water, filled with its bitterness.
This deals 40 damage, 80 if the user is at or below half health.
Crit: Target takes 15 repeating damage. 


Bubblebeam ⠅ 60
Style: Ranged
A beam of bubbles that defies explanation.
This deals 40 damage to every target along a line.
Crit: Target’s dash is set to 0 for its next turn.


Clear Water ⠅ 60
Style: Melee
Pure water to cure the worst wounds.
This heals the target for 40 HP.
Crit: This move does not crit.
Out of Combat: This move can be used as a downtime action to heal Pokémon. 


Dive ⠅ 50
Style: Melee Type: Water
Dah dum… dah dum… dah dum, dah dum, dah dum, dah dum, DAH DAH!
This takes 2 turns. On the first turn, the Pokémon goes underwater, and cannot be hit except by ranged water moves and anyone else underwater using dive. On the second turn this deals 120 damage. This move can only be used in water and it allows the user to bypass difficult water terrain.
Crit: +30 damage.


Downpour ⠅ 70
Style: Ranged
A heavy but brief downpour of water strikes everyone in range.
This deals 40 damage to everyone in range and causes them to lose their next dash action.
Crit: Targets are also trapped (due to mud).


Fish ⠅ 50
Style: Ranged
The user draws aqutic Pokémon to its location, perhaps by using an incredibly flavorful tail.
Choose a Pokémon in the water. It is under a compulsion to approach the user. Water Pokémon are weak to this move. 
Crit: The compulsion is harsh.
Out of Combat: Once per session the move acts in place of super bait for fishing.


Muddy Water ⠅ 60
Style: Ranged
User blinds the target with silt. 
Deal 30 damage and blinds the target.
Crit: +30 damage. 


Scald ⠅ 70
Style: Ranged
User shoots boiling hot water at the target to burn it.
This deals 30 damage and the target takes 20 repeating damage.
Crit: Reduce the target’s strength by 30. 


Surf ⠅ 70
Style: Melee
The user rides a wave toward its foes, and can do so even on land.
Move 3 extra spaces and deal 40 damage to all adjacent targets.
Crit: +30 damage.


Water Gun ⠅ 50
Style: Ranged
A blast of water pushes the target away.
This deals 40 damage and moves the target 1 space.
Crit: +30 damage.


Water Jet ⠅ 60
Style: Ranged
A powerful gush of water.
This deals mind + 60 damage.
Crit: +30 damage.


Water Shiruken ⠅ 70
Style: Ranged
User throw bolts of water at its target.
This deals 1d60 damage and it has 4 extra spaces of range.
Crit: +30 damage. 
Tier 3
Hurricane ⠕ 90
Style: Ranged
Watery chaos all around while the user stands peaceful at the center.
This deals 90 damage to everyone in range.
Crit: Targets are trapped.


Hydro Cannon ⠕ 90
Style: Ranged
A powerful blast of water slams into the target, but it exhausts the user.
This deals 120 damage, but the user cannot use any other moves until it is encouraged.
Crit: Move the target 5 spaces. 


Hydro Pump ⠕ 100
Style: Ranged
A powerful blast of water that obliterates anything in its path.
This deals 100 damage.
Crit: Move the target 3 spaces.


Maelstrom ⠕ 100
Style: Ranged
User causes a chaotic cyclone water to continually buffet everyone around.
Everyone in range 60 damage and is trapped.
Crit: Also move everyone 3 spaces.


Rain Dance ⠕ 100
Style: Weather
User calls down rain from the sky.
Change the weather to raining, which makes all water moves natural, all fire moves difficult, makes all electric moves crit on any doubles, and allows water Pokémon with the swift swim ability to move over any terrain as if it were aquatic.
Crit: This move does not crit.


Rainstorm ⠕ 80
Style: Ranged
User causes a deluge of water to pour all around it.
This 40 damage to all targets in range, friend or foe, and they lose their next dash action. This deals double damage if it is raining.
Crit: +30 damage.


Steam Eruption ⠕ 100
Style: Ranged
User causes a geyser of steam to erupt, burning its target.
This deals 60 damage to the target and it takes 20 repeating damage.
Crit: Target loses 30 mind.  


Water Spout ⠕ 100
Style: Ranged
The Pokémon uses all its strength to call up a waterspout.
This deals half the user’s current HP rounded up in damage to the target and all adjacent targets.
Crit: Target is trapped. 


Waterfall ⠕ 80
Style: Ranged Type: Water
User charges with enough power to scale a waterfall.
This deals 60 damage and the user moves 2 extra spaces.
Crit: +30 damage.


Whirlpool ⠕ 90
Style: Melee Type: Water
User stands at the center of a whirlpool.
This deals 50 damage to all adjacent targets.
Crit: +30 damage. 
*/
	},
	"Null":
	{
		"Novelty_Pokemon": 
		{
			"name": "Novelty Pokemon", 
			"power": 0,
			"style": "N/A",
			"flavor": "The Pokemon has a tendency to picking up odd moves.",
			"effect": "This is not a move. Instead, if your Pokemon has this, you may teach it any move of your choice as a way to give it a cute quirk.",
			"critical": "N/A",
		},	
		"Cosplay": 
		{
			"power": 0,
			"style": "N/A",
			"flavor": "The Pokemon gets a special move for each costume it wears.",
			"effect": "Replace this move slot with a unique move inspired by the outfit worn. You may never use the same move for two different costumes.",
			"critical": "N/A",
		},		
	}
};